{"content2":"原文地址：http://blog.sina.com.cn/s/blog_01482fb60100p2cg.html什么是本体论？想必大凡刚刚接触这个概念的人都是一头雾水，有的甚至几年时间都弄不明白它说的到底是什么意思，鄙人不才就是这样的愚人。哲学上的概念本来就够烦人的了，抽象拗口、晦涩难懂，一副不把你搞晕誓不罢休的样子，但就这还都是其次，更让人恼火的是，这些不明不白的东西竟然延伸到了科学技术领域，比如，本体论这头怪物就已经开始在人工智能、图书馆学、知识工程等领域中大行其道了。为了搞清人工智能中的本体论究竟是怎么回事，前年我特意买了一本专门讲本体论的书，结果是看得云里雾里，分不清东南西北。原本对本体论的认识是一盆糊糊，看完这本书后糊糊变成了浆糊，最终还是没有弄明白什么是本体论。我敢对天发誓，这次绝对不是由于本人天生愚钝，而是书的作者本身就没有搞懂什么是本体论，东拼西凑，弄了一大堆资料，一二三四五倒是罗列了不少，可就是没有一句话能够解释清楚本体论究竟是什么。大凡对本体论的解释都是这样的：首先是一段辞源探讨，诸如，本体这个词来源于拉丁文的尾巴英文的头、西方的哲学东方的道，等等、等等，前五百年后五百年详详细细罗列一番，结果，罗列完了也就算是解释完了。避实就虚，说了一大堆，就是没有一句能够涉及问题核心的，到了也没有给你交代出本体论究竟指的是什么。用爱智论坛上的一个网友的话说，那就是：“你们分得真细，佩服！！！！！但我对答案还挺朦胧的。”闲话少叙，我们还是来探讨一下究竟什么是本体论吧。首先我们要清楚一点，本体论原本是一个哲学概念，只是最近这些年，它被引用到一些科学技术领域，成了一个带有哲学色彩的科学技术概念。下面我们来看一看本体论在哲学上是怎样解释的。哲学上的本体论要想弄清楚什么是本体论，我们就得先弄明白什么是本体。对于什么是本体，有多种不同的解释，下面，我选出两种我认为比较准确的说法供大家参考。1、新华字典上的解释：德国哲学家康德唯心主义哲学中的重要概念，指与现象对立的不可认识的‘自在之物’。2、百度百科上的两种解释：“1.事物的本身。 2.哲学名词。形成现象的根本实体(常与“现象”相对) 。详细解释 ： 事物的原样或自身。”应该说，新华字典和百度百科对本体的解释还是比较到位的，只是新华字典上说本体是德国哲学家康德唯心主义哲学中的重要概念，这一点似乎有些问题，因为本体论远在康德之前就已经出现了。另外，我们要对百度百科上的“事物的本身”这一解释也要注意，这一解释应该说已经不是原汁原味的哲学概念了，因为“事物”这一概念是包含各种现象和关系在内的，而哲学上的本体是不包含关系和现象的，哲学上的本体似乎更应该解释为“物体或者物质本身（见《什么是物质？》一文）”。所以说，哲学上的本体应该就是康德所说的“自在之物”或者“形成现象的根本实体”这个意思， “自在之物”与“形成现象的根本实体”应该就是同一个意思——也就是“物体或者物质本身”。这听起来怎么这么绕呢？事实上，理解上面解释的字面意思很容易，但是真正理解其含义的人却并不是很多，让我们以“羊”为例来说明这个问题：通常，我们理解“一只羊本身”的时候，可能想到的是：羊有两只坚硬的角、四个蹄子、白色的或者黑色的、皮毛是柔软的光滑的、有一种羊膻味、能够发出咩咩的叫声等等。其实这种理解并不是哲学上所说的本体。在哲学上，我们所看到的、听到的和感觉到的一切都只是一种现象，颜色不是羊本身的东西，它是光线带给我们的一种视觉效果，同样，气味、声音也不是，我们所说的坚硬、光滑等等，也都只是我们的一种感觉，是我们比较的结果……。也就是说，被我们叫做羊的那个东西是存在的，但是我们对它的一切认识却都只是现象，那个被我们叫做羊的东西本身是不可认识的，那个东西就是哲学上所说的本体。理解了本体，本体论这个概念我们就不用再做更多的解释，大概可以理解为关于本体的学说。它主要是探究世界的本原或基质，探究天地万物产生、存在、发展变化的根本原因和根本依据的。人工智能中的本体论在人工智能中，本体与本体论基本上是同一个概念，那么，在这里，本体又指的是什么呢？我们先来看看人工智能中本体的几种定义：1、在人工智能界，最早给出本体定义的是Neches等人，他们将本体定义为“给出构成相关领域词汇的基本术语和关系，以及利用这些术语和关系构成的规定这些词汇外延的规则的定义。”2、目前得到比较广泛认可的定义是斯坦福大学的Gruber给出的：“本体是概念模型的明确的规范说明”。也有的地方翻译成：本体是指一种“形式化的，对于共享概念体系的明确而又详细的说明”。不知道别人怎样，我个人的感觉是，Gruber的定义要比前一种好一些，但也不是那么容易理解。对于一个没有使用过本体工具、没有构建过本体的人来说，理解Gruber的定义恐怕也不是一件容易的事情：似乎明白了一点什么，但似乎又还是朦朦胧胧的。那么，人工智能中的本体究竟是怎么回事呢？我认为，人工智能中的本体应该定义为：本体就是用详细的描述方法定义出来的概念或者概念体系。事实上，人工智能建立本体的过程就是一个定义概念的过程，只是它与我们平时定义概念的方法恰恰相反而已。通常情况下，我们都是先对事物进行高度的抽象和概括，然后用抽象出来所谓的本质属性来定义概念的。比如说“羊”这个概念，我们忽略了羊长着一只头、两只角、四只蹄子、一身毛、会吃草、喝水、叫唤等等具体属性，而把它定义为“一种哺乳动物”。而人工智能建构本体的方法却恰恰与此相反，它要做的不是对事物进行抽象，而是对抽象的概念进行详细的描述，把抽象的概念还原成具体的东西，把“一种哺乳动物”的羊，描述成一只长着一只头、两只角、四只蹄子、一身毛，吃草、喝水、会叫唤……的羊。要想真正理解这一点，我们就得知道人和机器分别是怎样理解概念的。我们知道，每个概念都代表着现实中的某个事物。通常情况下，我们并不是根据概念的定义来理解事物的，我们对一个事物的理解是基于对该事物的大量的知识的。比如说，我们知道一只羊是什么，这并不是因为我们知道它的定义是“一种哺乳动物”。而是因为我们知道，它长着一只头、两只角、四只蹄子、一身毛，它吃草、喝水、会叫唤……。但是，对于计算机来说，它并不具备关于羊的这么多的知识，它只能是根据羊的定义来理解什么是羊。而问题恰恰就出现在这里，我们输入到计算机里的就是那种经过高度抽象和概括的概念，而仅靠概念的定义，计算机是根本不可能理解什么是羊的，难道“一种哺乳动物”就是羊么？为了能让计算机能够真正“理解”什么是羊，没有办法，人们只有对抽象的概念再进行还原，把羊的各种属性重新添加到“羊”这一概念中。这样描述出来的概念就叫做本体。人工智能的本体论，就是建立本体的那一整套方法。它是通过头、角、蹄子等等概念与羊之间的关系来说明什么是羊的。"}
