{"content2":"2017年中国国务院《新一代人工智能发展规划》中预计，到2020年人工智能总体技术和应用与世界先进水平同步，人工智能核心技术超过1500亿元，中国人工智能产业发展迅速，市场规模不断攀升，人工智能企业数量也在不断增长。但目前人工智能技术应用存在风险，计算机视觉方面存在人脸识别漏洞等问题;语音识别存在泄露风险，语音助手或成非法监听重灾区。iiMedia Research(艾媒咨询)数据显示，网民认为人工智能技术中无人驾驶汽车是风险最高，超六成中国网民认为人工智能或造成失业问题。\n(《艾媒报告| 2019中国人工智能发展风险预警白皮书 》完整高清PDF版共59页，欢迎加v：iimediaLucy，参与更多行业交流。）\n以下为报告节选内容：\n中国人工智能发展备受国家重视\n中国人工智能市场规模未来将不断攀升\n2017年中国国务院《新一代人工智能发展规划》中预计，到2020年人工智能总体技术和应用与世界先进水平同步，人工智能核心技术超过1500亿元;到2025年，人工智能基础理论实现重大突破，部分技术和应用达到世界领先水平，核心技术规模超过4000亿元。\n中国人工智能产业链全面落地\n基于深度学习的人工智能发展受限于框架条件\n作为必备基础的大数据 风险存在于各个阶段\n深度学习是人工智能的基础技术之一，深度学习算法的实现基于海量的数据。反过来，数据的质量又决定了深度学习模型的最终实现效果。\n深度学习系统本身面临多种安全威胁\n人脸识别技术存在漏洞或将导致安防失效\n语音小助手的传感器可作为监听设备使用\n语音小助手是现阶段受欢迎的人工智能应用之一，开发商更看重语音助手的便捷性和灵敏性，往往对语音助手的安全性有所忽略，这其中包括识别人耳听不到的声音和各智能助理相互间的语音识别。\n人工智能在教育领域应用的风险\n人工智能推动了教育的改革与创新，为智慧校园的建设提供了助力。目前在大学阶段的部分等级考试中已经应用了人脸识别技术，部分校外辅导机构也运用了人工智能为每一位学生提供定制化学习攻略。\n人工智能在军事领域的应用对国家安全造成威胁\n人工智能对人类现存法律伦理的挑战\n58.1%的中国网民愿意尝试无人驾驶汽车\niiMedia Research(艾媒咨询)数据显示，58.1%的中国网民愿意尝试无人驾驶汽车。\n64.1%的中国网民认为人工智能是存在风险\niiMedia Research(艾媒咨询)数据显示，64.1%的中国网民认为人工智能是存在风险/安全威胁的。\n中国网民对人工智能风险认知尚不全面\niiMedia Research(艾媒咨询)数据显示，40.3%的网民认为人工智能带来的最大危害就是个人信息泄露，其比重相对较高。艾媒咨询分析师认为，中国网民现阶段对人工智能存在的危害认知尚不全面。\n41.4%的网民认为无人驾驶汽车是风险最高\niiMedia Research(艾媒咨询)数据显示，41.4%的网民认为无人驾驶汽车是现阶段风险最高的人工智能产品，其次是智能摄像头(40.9%)和指纹锁(38.1%)。艾媒咨询分析师认为，无人驾驶汽车、摄像头和指纹锁都是与人类近距离接触且能产生直接效果的人工智能产品，这类产品无论是否存在技术不足，都与人类的利益攸兮相关。\n超六成中国网民认为人工智能或造成失业\niiMedia Research(艾媒咨询)数据显示，45.0%的中国网民认为人工智能可能造成失业，18.5%的网民则认为人工智能非常有可能造成失业。\n超过一半网民认为人工智能技术存在小程度的歧视性\niiMedia Research(艾媒咨询)数据显示，59.9%的中国网民认为人工智能技术存在歧视性问题，但是程度较小。\n网民认为人工智能对人类构成威胁的原因\niiMedia Research(艾媒咨询)数据显示，中国网民认为人工智能技术会引发大数据信息泄露，占比达38.6%。其次是人工智能或使得人类生存能力降低，占比为31.6%。\n人工智能技术未来将获得更多重视和发展机会\n大数据保护将引起全面重视 或成未来焦点\n教育和技术的共同进步才能维护人类的优势地位\n关于艾媒咨询\niiMedia Research(艾媒咨询)是全球知名的新经济产业第三方数据挖掘和分析机构，2007年诞生于广州，在广州、香港、北京、上海、硅谷设有运营和分析机构。艾媒咨询致力于输出有观点、有态度、有结论的研究报告，以权威第三方实力，通过艾媒大数据决策和智能分析系统，结合具有国际化视野的艾媒分析师观点，在产业数据监测、调查分析和趋势发展等方向的大数据咨询具有丰富经验。艾媒每年公开或定制发布新经济前沿报告超过2000份，覆盖了人工智能、新零售、电商、教育、视频、生物、医疗、音乐、出行、房产、营销、文娱、传媒、金融、环保与公共治理等领域，通过深入数据挖掘，通过数学建模，分析推理与科学算法结合，打造有数据、有理论支撑的大数据分析成果。艾媒咨询的数据报告、分析师观点平均每天被全球超过100家主流媒体，1500家(个)自媒体、行业KOL广泛引用，覆盖语言类型包括中、英、日、法、意、德、俄、阿等约二十种主流官方版本。\n基于公司独立自主研发的“中国移动互联网大数据挖掘与分析系统(CMDAS)”，艾媒咨询建立了互联网运营数据、企业舆情和商情、用户属性和行为偏好、零售数据挖掘、广告投放效果、商业模式等多维度的数据监测体系，可视化还原“数据真相”，实现市场趋势的捕捉和用户信息的洞察，提升品牌的行业竞争和影响力。"}
