{"content2":"让计算机具有视觉,科学家与工程师们,作出了近40年的不懈努力:应该说,40年努力的进展是显著的,进展主要有两个方面:已经形成一些计算视觉的基本理论框架,如80年代初形成的以Marr为代表的视觉计算理论(有些学者称之为三维重建框架)和以后出现的基于模型的视觉( Model based vision)、主动视觉( Active Vision)等。现在看来,虽然我们仍然不清楚这些计算理论框架能否最终成为最理想的计算机视觉系统的基础,但有几点几乎是可以肯定的:一是迄今为止提出的各种理论框架虽然有方法论上的差异,有些甚至具有科学哲学思想的差异,但并没有本质上的相互排斥,而且是互补的。二是这些已有的视觉系统理论框架已经可以作为有一定程度视觉功能的实用视觉系统的基础。随着计算机性能价格比的指数增长,以现有视觉系统理论框架为基础的,针对特定任务的实用视觉系统将会广泛应用于现实生活中。三是与人工智能的其他许多领域类似,真正的突破要比当初想像的要困难得多。这里,“真正的突破”是指:当我们将当前的人工智能系统与人相比时,人的智能系统具有更强的通用性、自学习能力、自适应性和对噪声的鲁棒性。在计算机视觉另一方面的重要进展是,提出了大量的计算方法。尤其是90年代以来,为适应不同计算理论框架和为改进计算机视觉系统对噪声的鲁棒性,引进了许多数学方法和与之相对应的计算方法。几乎所有的数学分支,尤其是应用数学分支都要到计算机视觉领域来一显身手,使许多初学者,甚至搞了多年研究的学者都感到困惑。人们不禁要问,难道我们真需要这么多的复杂数学分支和计算方法来解决计算机视觉问题吗?事实上,这确实反映了当前的许多数学工具还不能有效解决“更强的通用性、自学习能力、自适应性和对噪声的鲁棒性”,另一方面,现在的许多数学方法,本质上是相通的。而我们缺少既对这些方法都精通,又对计算机视觉中所面临的实际问题有深入理解的理论工作者来对各种方法加以融会贯通。在上述视觉计算方法的研究中,基于几何的视觉计算方法,在90年代发展到了几乎是完美的程度。本书的作者既是这方面的先驱者,也在本书中作出了很好的总结与系统论述。基于几何的视觉计算方法,之所以引起很大关注是因为：1.计算机视觉的研究目标是使计算机具有通过二维图像认知三维环境信息的能力。这种能力将不仅使机器能感知三维环境中物体的几何信息,包括它的形状、位置、姿态、运动等,而且能对它们进行识别与理解。事实上,80年代形成的Marr的计算理论框架和其他计算理论框架中,绝大部分内容都涉及利用几何方法计算环境中的三维物体的形状、位置、姿态和运动。2.如果读者对欧几里德几何和近几百年来提出的各种几何,如本书中提到的射影几何、仿射几何等有些深入了解的话,应该理解“各种几何的本质是描述几何元素在不同变换群下的不变量”。由此,使用几何方法,不仅可以由二维图像重建( reconstruct)三维物体,还可以描述它们在摄像机变换下的不变量,从而达到识别的目的,也就是说,几何方法,可以贯穿计算视觉理论框架下的所有部分,有人称之为基于几何的计算机视觉。3.90年代以来,计算机视觉界将对应于射影几何、仿射几何、欧几里德几何的射影变换、仿射变换、欧几里德变换系统地引进到视觉计算方法中,三种变换都构成变换群,而且,后者为前者的子群,它们所对应的几何不变量,前者为后者的子集,这些性质比较完美地对应为视觉系统中对物体由粗到细的描述,在一些特定任务的计算机视觉系统中降低了对系统参数了解的要求(如本书中所描述的不需要对摄像机标定的三维重建),一定条件下提高了系统对噪声的鲁棒性,而这些确实是许多实用计算机视觉系统极为需要的品质。本书全面介绍了近10年来发展的基于几何的计算机视觉计算方法及其数学基础。除了上述内容外,其中多摄像机视图几何及其计算方法,值得读者关注,这是因为当前计算机的性能价格比大大提高,使人们有条件在视觉系统中使用更多的摄像机,以利用冗余的信息,来换取系统对噪声的鲁棒性。系统对噪声的鲁棒性一直是实用计算机视觉系统的瓶颈问题,解决该问题的可能的办法是:提高摄像机的分辨率、多摄像机方法和近年来大量引进的统计最优化鲁棒算法(本书许多章节也有描述)。安徽大学的老师们将本书译成中文,是一件很有益的工作,我曾长期讲授计算机视觉课程,深感我国工科大学研究生,缺乏现代几何的有关知识,对近10年来发展的基于几何的计算机视觉计算方法的本质接受较慢本书比较系统地介绍了射影几何,在各章节中也注意介绍有关数学基础,使即使缺少这方面系统知识的工科学生也能接受,应该对我国专门从事十算机视觉研究的读者有较好的参考价值。这本书对我国从事相关数学领域研究的人士也值得一读,计算机视觉涉及的数学,量大面广,是一个典型的数学工作者可有用武之地的领域,但比起其他国家来说,我国的数学家们基本不介入一些有相当实用背景的新兴学科,学科不能交叉,创新从何而来面？来自为知笔记(Wiz)"}
