{"content2":"阶段1、人工智能基础 －　高等数学必知必会本阶段主要从数据分析、概率论和线性代数及矩阵和凸优化这四大块讲解基础，旨在训练大家逻辑能力，分析能力。拥有良好的数学基础，有利于大家在后续课程的学习中更好的理解机器学习和深度学习的相关算法内容。同时对于AI研究尤为重要，例如人工智能中的智能很大一部分依托“概率论”实现的。一、数据分析1）常数e2）导数3）梯度4）Taylor5）gini系数6）信息熵与组合数7）梯度下降8）牛顿法二、概率论1）微积分与逼近论2）极限、微分、积分基本概念3）利用逼近的思想理解微分，利用积分的方式理解概率4）概率论基础5）古典模型6）常见概率分布7）大数定理和中心极限定理8）协方差(矩阵)和相关系数9）最大似然估计和最大后验估计三、线性代数及矩阵1）线性空间及线性变换2）矩阵的基本概念3）状态转移矩阵4）特征向量5）矩阵的相关乘法6）矩阵的QR分解7）对称矩阵、正交矩阵、正定矩阵8）矩阵的SVD分解9）矩阵的求导10）矩阵映射/投影四、凸优化1）凸优化基本概念2）凸集3）凸函数4）凸优化问题标准形式5）凸优化之Lagerange对偶化6）凸优化之牛顿法、梯度下降法求解阶段2、人工智能提升 － Python高级应用随着AI时代的到来以及其日益蓬勃的发展，Python作为AI时代的头牌语言地位基本确定，机器学习是着实令人兴奋，但其复杂度及难度较大，通常会涉及组装工作流和管道、设置数据源及内部和云部署之间的分流而有了Python库后，可帮助加快数据管道，且Python库也在不断更新发布中，所以本阶段旨在为大家学习后续的机器学习减负。一、容器1）列表:list2）元组:tuple3）字典: dict4）数组: Array5）切片6）列表推导式7）浅拷贝和深拷贝二、函数1）lambda表达式2）递归函数及尾递归优化3）常用内置函数/高阶函数4）项目案例：约瑟夫环问题三、常用库1）时间库2）并发库3）科学计算库4）Matplotlib可视化绘图库5）锁和线程6）多线程编程阶段3、人工智能实用 － 机器学习篇机器学习利用算法去分析数据、学习数据，随后对现实世界情况作出判断和预测。因此，与预先编写好、只能按照特定逻辑去执行指令的软件不同，机器实际上是在用大量数据和算法去“自我训练”，从而学会如何完成一项任务。所以本阶段主要从机器学习概述、数据清洗和特征选择、回归算法、决策树、随机森林和提升算法、SVM、聚类算、EM算法、贝叶斯算法、隐马尔科夫模型、LDA主题模型等方面讲解一些机器学习的相关算法以及这些算法的优化过程，这些算法也就是监督算法或者无监督算法。一、机器学习1）机器学习概述二、监督学习1）逻辑回归2）softmax分类3）条件随机场4）支持向量机svm5）决策树6）随机森林7）GBDT8）集成学习三、非监督学习1）高斯混合模型2）聚类3）PCA4）密度估计5）LSI6）LDA7）双聚类四、数据处理与模型调优1）特征提取2）数据预处理3）数据降维4）模型参数调优5）模型持久化6）模型可视化阶段4、人工智能前沿 －　深度学习篇深度学习是实现机器学习的技术，同时深度学习也带来了机器学习的许多实际应用，拓展了AI的使用领域，本阶段主要从TensorFlow、BP神经网络、深度学习概述、CNN卷积神经网络、递归神经网、自动编码机，序列到序列网络、生成对抗网络，孪生网络，小样本学习技术等方面讲解深度学习相关算法以，掌握深度学习前沿技术，并根据不同项目选择不同的技术解决方案。针对公司样本不足，采用小样本技术和深度学习技术结合，是项目落地的解决方案。1）TensorFlow基本应用2）BP神经网络3）深度学习概述4）卷积神经网络(CNN)5）图像分类(vgg,resnet)6）目标检测(rcnn,fast-rcnn,faster-rcnn,ssd)7）递归神经网络(RNN)8）lstm,bi-lstm,多层LSTM9）无监督学习之AutoEncoder自动编码器10）Seq2Seq11）Seq2Seq with Attension12）生成对抗网络13）irgan14）finetune及迁移学习15）孪生网络16）小样本学习阶段5、人工智能进阶 － 图像处理篇数字图像处理(Digital Image Processing)是通过计算机对图像进行去除噪声、增强、复原、分割、提取特征等处理的方法和技术。广泛的应用于农牧业、林业、环境、军事、工业和医学等方面，是人工智能和深度学习的重要研究方向。深度学习作为当前机器学习领域最热门的技术之一，已经在图像处理领域获得了应用，并且展现出巨大的前景。本阶段学习了数字图像的基本数据结构和处理技术，到前沿的深度学习处理方法。掌握前沿的ResNet,SSD,Faster RCNN等深度学习模型，对图像分类，目标检测和模式识别等图像处理主要领域达到先进水平。实际工作中很多项目都可以转化为本课程的所学的知识去解决，如行人检测，人脸识别和数字识别。一、图像基础图像读，写，保存，画图（线，圆，多边形，添加文字）二、图像操作及算数运算图像像素读取，算数运算，ROI区域提取三、图像颜色空间运算图像颜色空间相互转化四、图像几何变换平移，旋转，仿射变换，透视变换等五、图像形态学腐蚀，膨胀，开/闭运算等六、图像轮廓长宽，面积，周长，外接圆，方向，平均颜色，层次轮廓等七、图像统计学图像直方图八、图像滤波高斯滤波，均值滤波，双边滤波，拉普拉斯滤波等阶段八、人工智能终极实战 － 项目应用本阶段重点以项目为导向，通过公安系统人脸识别、图像识别以及图像检索、今日头条CTR广告点击量预估、序列分析系统、聊天机器人等多个项目的讲解，结合实际来进行AI的综合运用。项目一：公安系统人脸识别、图像识别使用深度学习框架从零开始完成人脸检测的核心技术图像类别识别的操作，从数据预处理开始一步步构建网络模型并展开分析与评估，方便大家快速动手进行项目实践！识别上千种人靓，返回层次化结构的每个人的标签。项目二：公安系统图像检索本项目基于卷积神经网在训练过程中学习出对应的『二值检索向量』，对全部图先做了一个分桶操作，每次检索的时候只取本桶和临近桶的图片作比对，而不是在全域做比对，使用这样的方式提高检索速度，使用Tensorflow框架建立基于ImageNet的卷积神经网络，并完成模型训练以及验证。项目九：手工数字识别人认知世界的开始就是从认识数字开始的，深度学习也一样，数字识别是深度学习的一个很好的切入口，是一个非常经典的原型问题，通过对手写数字识别功能的实现，可以帮助我们后续对神经网络的理解和应用。选取手写数字识别的主要原因是手写数字具有一定的挑战性，要求对编程能力及神经网络思维能力有一定的要求，但同时手写数字问题的复杂度不高，不需要大量的运算，而且手写数字也可以作为其它技术的一个基础，所以以手写数字识别为基础，贯穿始终，从而理解深度学习相关的应用知识。项目十：癌症筛选检测技术可以改变癌症患者的命运吗，对于患有乳腺癌患者来说，复发还是痊愈影响这患者的生命，那么怎么来预测患者的患病结果呢，机器学习算法可以帮助我们解决这一难题，本项目应用机器学习logistic回归模型，来预测乳腺癌患者复发还是正常，有效的预测出医学难题。项目十一：葡萄酒质量检测系统随着信息科技的快速发展,计算机中的经典算法在葡萄酒产业中得到了广泛的研究与应用。其中机器学习算法的特点是运用了人工智能技术,在大量的样本集训练和学习后可以自动地找出运算所需要的参数和模型。项目十三：手工实现梯度下降回归算法梯度下降法（英语：Gradient descent）是一个一阶最优化算法，通常也称为最速下降法。 要使用梯度下降法找到一个函数的局部极小值，必须向函数上当前点对应梯度（或者是近似梯度）的反方向的规定步长距离点进行迭代搜索。如果相反地向梯度正方向迭代进行搜索，则会接近函数的局部极大值点；这个过程则被称为梯度上升法。项目十四：基于TensorFlow实现回归算法回归算法是业界比较常用的一种机器学习算法，通过应用于各种不同的业务场景，是一种成熟而稳定的算法种类；TensorFlow是一种常用于深度学习相关领域的算法工具；随着深度学习热度的高涨，TensorFlow的使用也会越来越多，从而使用TensorFlow来实现一个不存在的算法，会加深对TensorFlow的理解和使用；基于TensorFlow的回归算法的实现有助于后续的TensorFlow框架的理解和应用，并可以促进深度学习相关知识的掌握。项目十六：行人检测行人检测是利用图像处理技术和深度学习技术对图像或者视频序列中是否存在行人并给予精确定位。学习完行人检测技术后，对类似的工业缺陷检测，外观检测和医疗影像检测等目标检测范畴类的项目可以一通百通。该技术可与行人跟踪，行人重识别等技术结合，应用于人工智能系统、车辆辅助驾驶系统、智能机器人、智能视频监控、人体行为分析、智能交通等领域。由于行人兼具刚性和柔性物体的特性 ，外观易受穿着、尺度、遮挡、姿态和视角等影响，使得行人检测成为计算机视觉领域中一个既具有研究价值同时又极具挑战性的热门课题。阶段九、人工智能实战 － 企业项目实战课程一、基于Python数据分析与机器学习案例实战教程课程风格通俗易懂，基于真实数据集案例实战。主体课程分成三个大模块(1)python数据分析，(2)机器学习经典算法原理详解,(3)十大经典案例实战。通过python数据科学库numpy,pandas,matplot结合机器学习库scikit-learn完成一些列的机器学习案例。算法课程注重于原理推导与流程解释，结合实例通俗讲解复杂的机器学习算法，并以实战为主，所有课时都结合代码演示。算法与项目相结合，选择经典kaggle项目，从数据预处理开始一步步代码实战带大家快速入门机器学习。旨在帮助同学们快速上手如何使用python库来完整机器学习案例。选择经典案例基于真实数据集，从数据预处理开始到建立机器学习模型以及效果评估，完整的讲解如何使用python及其常用库进行数据的分析和模型的建立。对于每一个面对的挑战，分析解决问题思路以及如何构造合适的模型并且给出合适评估方法。在每一个案例中，同学们可以快速掌握如何使用pandas进行数据的预处理和分析，使用matplotlib进行可视化的展示以及基于scikit-learn库的机器学习模型的建立。1）Python数据分析与机器学习实战课程简介2）Python快速入门3）Python科学计算库Numpy4）Python数据分析处理库Pandas5）Python可视化库Matplotlib6）回归算法7）模型评估8）K近邻算法9）决策树与随机森林算法10）支持向量机11）贝叶斯算法12）神经网络13）Adaboost算法14）SVD与推荐15）聚类算法19）案例实战：鸢尾花数据集分析20）案例实战：级联结构的机器学习模型21）案例实战：员工离职预测22）案例实战：使用神经网络进行手写字体识别课程二、人工智能与深度学习实战课程风格通俗易懂，必备原理，形象解读，项目实战缺一不可！主体课程分成四个大模块(1)神经网络必备基础知识点，(2)深度学习模型，(3)深度学习框架Caffe与Tensorflow，(4)深度学习项目实战。 课程首先概述讲解深度学习应用与挑战，由计算机视觉中图像分类任务开始讲解深度学习的常规套路。对于复杂的神经网络，将其展开成多个小模块进行逐一攻破，再挑战整体神经网络架构。对于深度学习模型形象解读卷积神经网络原理，详解其中涉及的每一个参数，对卷积网络架构展开分析与评估，对于现阶段火爆的对抗生成网络以及强化学习给出形象解读，并配合项目实战实际演示效果。 基于框架实战，选择两款深度学习最火框架，Caffe与Tensorflow，首先讲解其基本使用方法，并结合案例演示如何应用框架构造神经网络模型并完成案例任务。 选择经典深度学习项目实战，使用深度学习框架从零开始完成人脸检测，验证码识别，人脸关键点定位，垃圾邮件分类，图像风格转换，AI自己玩游戏等。对于每一个项目实战，从数据预处理开始一步步构建网络模型并展开分析与评估。 课程提供所涉及的所有数据，代码以及PPT，方便大家快速动手进行项目实践！1）深度学习概述与挑战2）图像分类基本原理门3）深度学习必备基础知识点4）神经网络反向传播原理5）神经网络整体架构6）神经网络案例实战图像分类任务7）卷积神经网络基本原理8）卷积参数详解9）卷积神经网络案例实战10）经典网络架构分析11）分类与回归任务12）三代物体检测算法分析13）数据增强策略14）TransferLearning15）网络架构设计16） 深度学习框架Caffe网络结构配置17）Caffe18）深度学习项目实战人脸检测19）人脸正负样本数据源制作20）人脸检测网络架构配置习模型21）人脸检测代码实战22）人脸关键点定位项目实战23）人脸关键点定位网络模型24）人脸关键点定位构建级联网络25）人脸关键点定位测试效果与分析26）Tensorflow框架实战27）Tensorflow构建回归模型28）Tensorflow构建神经网络模型29）Tensorflow深度学习模型30）Tensorflow打造RNN网络模型31）Tensorflow项目实战验证识别32）项目实战图像风格转换33）QLearning算法原理34）DQN网络架构35）项目实战DQN网络让AI自己玩游戏36）项目实战对抗生成网络等"}
