{"content2":"http://www.viblue.com/archives/5587.htm\n一.机器人简介：\n机器人（Robot）是自动执行工作的机器装置。它既可以接受人类指挥，又可以运行预先编排的程序，也可以根据以人工智能 技术制定的原则纲领行动。它的任务是协助或取代人类工作的工作，例如生产业、建筑业，或是危险的工作[1]。\n同时，机器人的研究和开发制造一直将下面三条原则作为机器人开发的准则。即：\n第一条：机器人不应该伤害人类；\n第二条：机器人应该遵守人类的命令，与第一条违背的命令除外；\n第三条：机器人应能保护自己，与第一条相抵触者除外[2]。\n二．机器人技术的发展：\n1.机器人在国内的发展过程:\n在我国，机器人研究的起步较晚，我国工业机器人总装机量约为1200台，其中国产机器人占有量约l/3，但发展步伐较快，已经在工业机器人、特种机器人和智能机器人等各个方面取得了显著的成效，为我国机器人学的发展打下了初步的基础。我国的工业机器人起步于20世纪70年代初。经过30多年的发展，大致经历了3个阶段[3]：\n(1)20世纪70年代的萌芽期，机器人技术的发展较为缓慢，许多研究机构所作的努力均未获得成功。随着自动控制理论、电子计算机和航天技术的迅速发展，人工智能学界开始对机器人产生浓厚的兴趣，他们发现机器人的出现与发展为人工智能的发展带来了新的生机，随之机器人技术也进入了一个新的发展阶段。我国于1972年开始研制工业机器人，由上海起，接着天津、北京、吉林、哈尔滨、广州、昆明等十几个研究单位和院校分别开发了固定程序，组合式、液压伺服型通用机器人，并开始了机构学、计算机控制和应用技术的研究，这些机器人大约有三分之一用于生产。\n(2)20世纪80年代的开发期，机器人生产继续保持70年代后期的发展势头。80年代尤其是后5年，又吸引了160多个单位从事机器人及其相关技术的研究，形成了京津、东北、华南等机器人技术地区，培养了一支2000多人的工业机器人设计、研制、应用队伍，造就了一批机器人专家。1985年，我国在“七·五”科技攻关计划中将工业机器人列入了发展计划，由当时的机械工业部牵头组织了点焊、弧焊、喷漆、搬运等型号的工业机器人攻关，其他部委也积极立项支持，形成了中国工业机器人第一次高潮。1986年，我国再一次将智能机器人列入了高技术研究发展计划，成立了专家组，规划和领导机器人先进技术研究与应用工作。使我国的工业机器人技术发展基本可以立足于国内。\n(3)20世纪90年代的实用化期。90年代，在863计划的支持下，在发展工业机器人的同时，也对非制造环境下的应用机器人问题进行了研究，并取得了一批成果。20世纪90年代初期，我国主要开发喷漆、点焊、搬运、装配等机器人，到了90年代中期，已经选择以焊接机器人的工程应用为重点进行开发研究，到了90年代末，主要是实现国产机器人的商品化，为产业化奠定基础的时期。经过广大科技工作者的辛勤努力，在2001年举办的863计划15年成果展上，863计划机器人主题有58项关键技术和应用基础技术研究成果达到国际先进水平，先后获得国家科技进步奖21项，省部级科技进步奖116项，发明专利48项，实用新型专利125项，发表学术论文5725篇。开发了7种工业机器人系列产品，102种特种机器人，实施了100余项机器人应用工程。其中 “九·五”863计划“机器人化工程机械现代集成制造应用工程”， 攻克了一大批制约工程机械产品研发的关键技术，研制出了新一代铲运机械、压实机械和路面机械，促进了国产工程机械技术升级换代，极大地提高了国产工程机械的市场竞争力。但是我们必须看到，我们国家的机器人技术与发达国家相比还有一定的差距，比如我们的仿人机器人与日本的相比，在整体上还有不小的差距，主要体现在运动稳定性、协调性、功能和外观等方面。我国现在己是国际先进机器人协会的成员国，机器人技术比较发达的国家如美、同、法、德、意、英都是成员国，目前该协会有13个成员国。这说明我们在特种机器人方面，我们国家的水平与国外的差距正在逐步缩小。\n进入21世纪，机器人己成为现代工业不可缺少的重要工具，它标志着工业的现代化程度。机器人是一门高度交叉的前沿学科，引起许多不同专业背景的人们的兴趣，如机械学、生物学、人类学、计算机科学与工程、控制论与控制工程学、人工智能、社会学等。机器人包含机器人运动学、机器人动力学、机器人控制、机器人智能化等领域[3-7]。\n2.机器人在国外的发展：\n美国\n美国是机器人的诞生地，早在1962年就研制出世界上第一台工业机器人，比起号称”机器人王国”的日本起步至少要早五六年。经过30多年的发展，美国现已成为世界上的机器人强国之一，基础雄厚，技术先进。综观它的发展史，道路是曲折的，不平坦的[8]。\n由于美国政府从60年代到70年代中的十几年期间，并没有把工业机器人列入重点发展项目，只是在几所大学和少数公司开展了一些研究工作。对于企业来说，在只看到眼前利益，政府又无财政支持的情况下，宁愿错过良机，固守在使用刚性自动化装置上，也不愿冒着风险，去应用或制造机器人。加上，当时美国失业率高达6．65％，政府担心发展机器人会造成更多人失业，因此不予投资，也不组织研制机器人，这不能不说是美国政府的战略决策错误。70年代后期，美国政府和企业界虽有所重视，但在技术路线上仍把重点放在研究机器人软件及军事、宇宙、海洋、核工程等特殊领域的高级机器人的开发上，致使日本的工业机器人后来居上，并在工业生产的应用上及机器人制造业上很快超过了美国，产品在国际市场上形成了较强的竞争力。\n进入80年代之后，美国才感到形势紧迫，政府和企业界才对机器人真正重视起来，政策上也有所体现，一方面鼓励工业界发展和应用机器人，另一方面制订计划、提高投资，增加机器人的研究经费，把机器人看成美国再次工业化的特征，使美国的机器人迅速发展。\n80年代中后期，随着各大厂家应用机器人的技术日臻成熟，第一代机器人的技术性能越来越满足不了实际需要，美国开始生产带有视觉、力觉的第二代机器人，并很快占领了美国60％的机器人市场。\n尽管美国在机器人发展史上走过一条重视理论研究，忽视应用开发研究的曲折道路，但是美国的机器人技术在国际上仍一直处于领先地位。其技术全面、先进，适应性也很强。具体表现在：\n（1）性能可靠，功能全面，精确度高；\n（2）机器人语言研究发展较快，语言类型多、应用广，水平高居世界之首；\n（3）智能技术发展快，其视觉、触觉等人工智能技术已在航天、汽车工业中广泛应用；\n（4）高智能、高难度的军用机器人、太空机器人等发展迅速，主要用于扫雷、布雷、侦察、站岗及太空探测方面。\n英国\n早在1966年，美国Unimation公司的尤尼曼特机器人和AMF公司的沃莎特兰机器人就已经率先进入英国市场。1967年英国的两家大机械公司还特地为美国这两家机器人公司在英国推销机器人。接着，英国 Hall Automation公司研制出自己的机器人RAMP。70年代初期，由于英国政府科学研究委员会颁布了否定人工智能和机器人的Lighthall报告，对工业机器人实行了限制发展的严厉措施，因而机器人工业一蹶不振，在西欧差不多居于末位。\n但是，国际上机器人蓬勃发展的形势很快使英政府意识到：机器人技术的落后，导致其商品在国际市场上的竞争力大为下降。于是，从70年代末开始，英国政府转而采取支持态度，推行并实施了一系列支持机器人发展的政策和措施，如广泛宣传使用机器人的重要性、在财政上给购买机器人企业以补贴、积极促进机器人研究单位与企业联合等，使英国机器人开始了在生产领域广泛应用及大力研制的兴盛时期。\n法国\n法国不仅在机器人拥有量上居于世界前列，而且在机器人应用水平和应用范围上处于世界先进水平。这主要归功于法国政府一开始就比较重视机器人技术，特别是把重点放在开展机器人的应用研究上。\n法国机器人的发展比较顺利，主要原因是通过政府大力支持的研究计划，建立起一个完整的科学技术体系。即由政府组织一些机器人基础技术方面的研究项目，而由工业界支持开展应用和开发方面的工作，两者相辅相成，使机器人在法国企业界很快发展和普及.\n德国\n德国工业机器人的总数占世界第三位，仅次于日本和美国。这里所说的德国，主要指的是原联邦德国。它比英国和瑞典引进机器人大约晚了五六年。其所以如此，是因为德国的机器人工业一起步，就遇到了国内经济不景气。但是德国的社会环境却是有利于机器人工业发展的。因为战争，导致劳动力短缺，以及国民技术水平高，都是实现使用机器人的有利条件。到了70年代中后期，政府采用行政手段为机器人的推广开辟道路；在”改善劳动条件计划”中规定，对于一些有危险、有毒、有害的工作岗位，必须以机器人来代替普通人的劳动。这个计划为机器人的应用开拓了广泛的市场，并推动了工业机器人技术的发展。日尔曼民族是一个重实际的民族，他们始终坚持技术应用和社会需求相结合的原则。除了像大多数国家一样，将机器人主要应用在汽车工业之外，突出的一点是德国在纺织工业中用现代化生产技术改造原有企业，报废了旧机器，购买了现代化自动设备、电子计算机和机器人，使纺织工业成本下降、质量提高，产品的花色品种更加适销对路。到1984年终于使这一被喻为”快完蛋的行业”重新振兴起来。与此同时，德国看到了机器人等先进自动化技术对工业生产的作用，提出了1985年以后要向高级的、带感觉的智能型机器人转移的目标。经过近十年的努力，其智能机器人的研究和应用方面在世界上处于公认的领先地位。\n俄罗斯\n在前苏联（主要是在俄罗斯），从理论和实践上探讨机器人技术是从50年代后半期开始的。到了50年代后期开始了机器人样机的研究工作。1968年成功地试制出一台深水作业机器人。1971年研制出工厂用的万能机器人。早在前苏联第九个五年计划（1970年一1975年）开始时，就把发展机器人列入国家科学技术发展纲领之中。到1975年，已研制出30个型号的120台机器人，经过20年的努力，前苏联的机器人在数量、质量水乎上均处于世界前列地位。国家有目的地把提高科学技术进步当作推动社会生产发展的手段，来安排机器人的研究制造；有关机器人的研究生产、应用、推广和提高工作，都由政府安排，有计划、按步骤地进行。\n日本\n日本在60年代末正处于经济高度发展时期，年增长率达11％。第二次世界大战后，日本的劳动力本来就紧张，而高速度的经济发展更加剧了劳动力严重不足的困难。为此，日本在1967年由川崎重工业公司从美国Unimation公司引进机器人及其技术，建立起生产车间，并于1968年试制出第一台川崎的“尤尼曼特”机器人。\n正是由于日本当时劳动力显著不足，机器人在企业里受到了“救世主”般的欢迎。日本政府一方面在经济上采取了积极的扶植政策，鼓励发展和推广应用机器人，从而更进一步激发了企业家从事机器人产业的积极性。尤其是政府对中、小企业的一系列经济优惠政策，如由政府银行提供优惠的低息资金，鼓励集资成立“机器人长期租赁公司”，公司出资购入机器人后长期租给用户，使用者每月只需付较低廉的租金，大大减轻了企业购入机器人所需的资金负担；政府把由计算机控制的示教再现型机器人作为特别折扣优待产品，企业除享受新设备通常的40%折扣优待外，还可再享受 13％的价格补贴。另一方面，国家出资对小企业进行应用机器人的专门知识和技术指导等等。\n这一系列扶植政策，使日本机器人产业迅速发展起来，经过短短的十几年，到80年代中期，已一跃而为“机器人王国”，其机器人的产量和安装的台数在国际上跃居首位。按照日本产业机器人工业会常务理事米本完二的说法：“日本机器人的发展经过了60年代的摇篮期，70年代的实用期，到80年代进人普及提高期。”并正式把1980年定为“产业机器人的普及元年”，开始在各个领域内广泛推广使用机器人。\n日本政府和企业充分信任机器人，大胆使用机器人。机器人也没有辜负人们的期望，它在解决劳动力不足、提高生产率、改进产品质量和降低生产成本方面，发挥着越来越显著的作用，成为日本保持经济增长速度和产品竞争能力的一支不可缺少的队伍。\n日本在汽车、电子行业大量使用机器人生产，使日本汽车及电子产品产量猛增，质量日益提高，而制造成本则大为降低。从而使日本生产的汽车能够以价廉的绝对优势进军号称“汽车王国”的美国市场，并且向机器人的诞生国出口日本产的实用型机器人。此时，日本价廉物美的家用电器产品也充斥了美国市场，这使“山姆大叔”后悔不已。日本由于制造、使用机器人，增大了国力，获得了巨大的好处，迫使美、英、法等许多国家不得不采取措施，奋起直追。\n三．目前研究热点及发展趋势\n机器人诞生到本世纪80年代初，机器人技术经历了一个长期缓慢的发展过程。到了90年代，随着计算机技术、微电子技术、网络技术等的快速发展，机器人技术也得到了飞速发展。除了工业机器人水平不断提高之外，各种用于非制造业的先进机器人系统也有了长足的进展[5]。\n1.国内工业机器人的发展趋势：\n（1）国内汽车业的高速发展有力促进了工业机器人市场的发展。汽车制造业属于技术、资金密集型产业，也是自动化程度要求高、竞争相当激烈的行业。自2000年开始，受国家宏观政策调控及居民消费水平提高的影响，我国汽车业进入高速增长期。面对这种局面，国际汽车巨头纷纷进入中国市场，与我国企业合资设厂或扩大原有生产规模，国内企业也纷纷转型或加大对汽车行业的投资，整个行业增产扩能增加了对工业机器人的需求。可以说，汽车工业的发展是近几年我国工业机器人增长的主要原动力之一。\n（2）沿海经济发达地区是工业机器人的主要市场。我国工业机器人的使用主要集中在广东、江苏、上海、北京等地，其工业机器人拥有量占全国的一半以上。这种分布态势也与我国现阶段经济发展状况相吻合。珠江三角洲地区和长江三角洲地区是我国经济最发达的两个地区，其中长江三角洲地区在制造业中所占的比例越来越大。企业资金与技术实力雄厚、对产品质量和劳动生产率要求高，这促使企业使用较多的工业机器人。\n（3）外商独资企业、中外合资企业是目前工业机器人的主要用户。工业机器人属于技术含量高、价格相对昂贵的制造装备。采用工业机器人较多的企业，一般对产品的质量要求较高，企业在市场上具有更高的影响力。外商独资或中外合资企业自动化程度一般比较高，也导致工业机器人的需求量较大。近几年来，随着国内消费电子产业的快速发展，大量的日本、台湾、香港企业进入内地建立塑料加工厂，从事与IT、电器、个人数码产品相关的塑料部件生产，带动了内地塑料机械销售量的快速增长，注塑取件机械手的市场需求从2005年开始快速增长。\n（4）国内一些现代化水平比较高的企业开始越来越多地应用工业机器人。国内一些汽车厂家如奇瑞等为了提高产品竞争力，开始较多地应用工业机器人。军工企业特别是坦克装甲战车等开始应用焊接机器人，焊接速度与焊接质量得到明显提高。在船舶行业中，一些特种船舶，例如液化石油气运输船舶，也开始采用焊接机器人进行焊接作业。由于我国基础设施建设的高速发展，工程机械行业繁荣壮大，也成为应用焊接机器人较多的行业之一。铁路机车行业由于我国货运、客运、城市地铁等需求量的不断增加，以及列车提速的需求，机器人的需求也一直处于稳步增长态势。制造业中的大中型国有企业，近几年的工业机器人使用量也在较快速地攀升。此外，我国的民营企业也逐渐认识到了工业机器人的优势，对工业机器人的采用量也在逐年增加，虽然在装备的数量上与上述企业存在较大差距，但是增长的速度惊人，预计将很快成为工业机器人市场的重要客户。\n（5）劳动力成本的不断提高促使工业机器人不断进入企业。长期以来，由于机器人成本较高而劳动力价格相对低廉，我国大部分企业主要是劳动密集型企业。随着经济的持续快速发展，国内相当数量的企业技术实力得到很大提高，生产设备更新换代，劳动力供应格局也逐步从买方市场转为卖方市场，由供远大于求转向供求平衡。作为制造业主力的农民工也从早期的仅解决温饱问题到现在对薪资和工作条件提出了更高的要求。为了更好地适应市场经济发展的需要，提高生产率，提高产品质量和企业竞争力，改善工人劳动条件，企业对工业机器人的需求自然不断增加。利用机器人技术提升我国工业发展水平，完成从制造业大国向制造业强国的转变，已经逐步成为全社会的共识。\n（6）进口工业机器人基本情况。我国日益增长的工业机器人市场以及巨大的市场潜力吸引了包括瑞典的ABB公司，日本的安川电机、FANUC、OTC、松下、川崎重工，德国的KUKA、CLOOS、REIS，意大利的COMAU以及奥地利的IGM公司等世界著名机器人生产厂家的目光。目前，我国进口的工业机器人主要来自日本，2004年日本对华出口金额占我国进口工业机器人金额的一半。中国是ABB在全球的第一大市场和意大利机器人的第二大进口国。\n我国目前正从劳动密集型向现代化制造业方向发展，虽然工业机器人保有量已经达到一定规模，但与工业发达国家相比仍然有不小的差距，例如从汽车行业每万名生产工人占有的机器人来讲，中国仍然是世界上相对比较落后的国家之一[9]。\n2.国外机器人的发展趋势：\n目前国际机器人界都在加大科研力度，进行机器人共性技术的研究，并朝着智能化和多样化方向发展。主要研究内容集中在以下几个方面[9]：\n（1）工业机器人操作机结构的优化设计技术：探索新的高强度轻质材料，进一步提高负载/自重比，同时机构向着模块化、可重构方向发展。\n（2）机器人控制技术：重点研究开放式，模块化控制系统，人机界面更加友好，语言、图形编程界面正在研制之中。机器人控制器的标准化和网络化，以及基于PC机网络式控制器已成为研究热点。编程技术除进一步提高在线编程的可操作性之外，离线编程的实用化将成为研究重点。\n（3）多传感系统：为进一步提高机器人的智能和适应性，多种传感器的使用是其问题解决的关键。其研究热点在于有效可行的多传感器融合算法，特别是在非线性及非平稳、非正态分布的情形下的多传感器融合算法。另一问题就是传感系统的实用化。\n（4）机器人的结构灵巧，控制系统愈来愈小，二者正朝着一体化方向发展。\n（5）机器人遥控及监控技术，机器人半自主和自主技术，多机器人和操作者之间的协调控制，通过网络建立大范围内的机器人遥控系统，在有时延的情况下，建立预先显示进行遥控等。\n（6）虚拟机器人技术：基于多传感器、多媒体和虚拟现实以及临场感技术，实现机器人的虚拟遥操作和人机交互。\n（7）多智能体（multi-agent）调控制技术：这是目前机器人研究的一个崭新领域。主要对多智能体的群体体系结构、相互间的通信与磋商机理，感知与学习方法，建模和规划、群体行为控制等方面进行研究。\n（8）微型和微小机器人技术（micro/miniature robotics）:这是机器人研究的一个新的领域和重点发展方向。过去的研究在该领域几乎是空白，因此该领域研究的进展将会引起机器人技术的一场革命，并且对社会进步和人类活动的各个方面产生不可估量的影响，微小型机器人技术的研究主要集中在系统结构、运动方式、控制方法、传感技术、通信技术以及行走技术等方面。\n（9）软机器人技术（soft robotics）:主要用于医疗、护理、休闲和娱乐场合。传统机器人设计未考虑与人紧密共处，因此其结构材料多为金属或硬性材料，软机器人技术要求其结构、控制方式和所用传感系统在机器人意外地与环境或人碰撞时是安全的，机器人对人是友好的。\n（10）仿人和仿生技术：这是机器人技术发展的最高境界，目前仅在某些方面进行一些基础研究[10]。\n要使按照工业机器人和先进机器人两条技术发展路线来说明的话可能会更加的清楚一些：\n1．工业机器人\n（1）机器人操作机：通过有限元分析、模态分析及仿真设计等现代设计方法的运用，机器人操作机已实现了优化设计。以德国KUKA公司为代表的机器人公司，已将机器人并联平行四边形结构改为开链结构，拓展了机器人的工作范围，加之轻质铝合金材料的应用，大大提高了机器人的性能。此外采用先进的RV减速器及交流伺服电机，使机器人操作机几乎成为免维护系统。\n（2）并联机器人：采用并联机构，利用机器人技术，实现高精度测量及加工，这是机器人技术向数控技术的拓展，为将来实现机器人和数控技术一体化奠定了基础。意大利COMAU公司，日本FANUC等公司已开发出了此类产品。\n（3）控制系统：控制系统的性能进一步提高，已由过去控制标准的6轴机器人发展到现在能够控制21轴甚至27轴，并且实现了软件伺服和全数字控制。人机界面更加友好，基于图形操作的界面也已问世。编程方式仍以示教编程为主，但在某些领域的离线编程已实现实用化。\n（4）传感系统：激光传感器、视觉传感器和力传感器在机器人系统中已得到成功应用，并实现了焊缝自动跟踪和自动化生产线上物体的自动定位以及精密装配作业等，大大提高了机器人的作业性能和对环境的适应性。日本KAWASAKI、YASKAWA、FANUC和瑞典ABB、德国KUKA、REIS等公司皆推出了此类产品。\n（5）网络通信功能：日本YASKAWA和德国KUKA公司的最新机器人控制器已实现了与Canbus、Profibus总线及一些网络的联接，使机器人由过去的独立应用向网络化应用迈进了一大步，也使机器人由过去的专用设备向标准化设备发展。\n（6）可靠性：由于微电子技术的快速发展和大规模集成电路的应用，使机器人系统的可靠性有了很大提高。过去机器人系统的可靠性MTBF一般为几千小时，而现在已达到5万小时，几冬天可以满足任何场合的需求。\n2．先进机器人\n近年来，人类的活动领域不断扩大，机器人应用也从制造领域向非制造领域发展。像海洋开发、宇宙探测、采掘、建筑、医疗、农林业、服务、娱乐等行业都提出了自动化和机器人化的要求。这些行业与制造业相比，其主要特点是工作环境的非结构化和不确定性，因而对机器人的要求更高，需要机器人具有行走功能，对外感知能力以及局部的自主规划能力等，是机器人技术的一个重要发展方向。\n（1）水下机器人：美国的AUSS、俄罗斯的MT-88、法国的EPAVLARD等水下机器人已用于海洋石油开采，海底勘查、救捞作业、管道敷设和检查、电缆敷设和维护、以及大坝检查等方面，形成了有缆水下机器人（remote operated vehicle）和无缆水下机器人（autonomous under water vehicle）两大类。\n（2）空间机器人：空间机器人一直是先进机器人的重要研究领域。目前美、俄、加拿大等国已研制出各种空间机器人。如美国NASA的空间机器人Sojanor等。Sljanor是一辆自主移动车，重量为11.5kg，尺寸630~48mm，有6个车轮，它在火星上的成功应用，引起了全球的广泛关注。\n（3）核工业用机器人：国外的研究主要集中在机构灵巧，动作准确可靠、反应快、重量轻、刚度好、便于装卸与维修的高性能伺服手，以及半自主和自主移动机器人。已完成的典型系统，如美国ORML基于机器人的放射性储罐清理系统、反应堆用双臂操作器，加拿来大研制成功的辐射监测与故障诊断系统，德国的C7灵巧手等。\n（4）地下机器人：地下机器人主要包括采掘机器人和地下管道检修机器人两在类。主要研究内容为：机械结构、行走系统、传感器及定位系统、控制系统、通信及遥控技术。目前日、美、德等发达国家已研制出了地下管道和石油、天然气等大型管道检修用的机器人，各种采机器人及自动化系统正在研制中。\n（5）医用机器人：医用机器人的主要研究内容包括：医疗外科手术的规划与仿真、机器人辅助外科手术、最小损伤外科、临场感外科手术等。美国已开展临场感外科（telepresence surgery）的研究，用于战场模拟、手术培训、解剖教学等。法、英、意、德等国家联合开展了图像引导型矫形外科（telematics）计划、袖珍机器人（biomed）计划以及用于外科手术的机电手术工具等项目的研究，并已取得一些卓有成效的结果。\n（6）建筑机器人：日本已研制出20多种建筑机器人。如高层建筑抹灰机器人、预制件安装机器人、室内装修机器人、地面抛光机器人、擦玻璃机器人等，并已实际应有和。美国卡内基梅隆重大学、麻省理工学院等都在进行管道挖掘和埋设机器人、内墙安装机器人等型号的研制、并开展了传感器、移动技术和系统自动化施工方法等基础研究。英、德、法等国也在开展这方面的研究。\n（7）军用机器人：近年来，美、英、法、德等国已研制出第二代军用智能机器人。其特点是采用自主控制方式，能完成侦察、作战和后勤支援等任务，在战场上具有看、嗅和角摸能力，能够 自动跟踪地形和选择道路，并且具有自动搜索、识别和消灭敌方目标的功能。如美国的Navplab自主导航车、SSV半自主地面战车，法国的自主式快速运动侦察车（DARDS），德国MV4爆炸物处理机器人等。目前美国ORNL正在研制和开发Abrams坦克、爱国者导弹装电池用机器人等各种用途的军用机器人。\n四．机器人仿真系统简介\n机电系统研发的任务是再研制机电一体化产品（装置）或者原理样机，机电系统开发要经理从技术规范的确定，到总体方案设计、理论分析、样机研制、实验研究、再到产品销售的过程。而仿真的基本思想是利用物理或者数学模型来类比模仿显示过程以寻求过程和规律[10]。它的基础是相似现象，即几何相似性和物理相似性。\n再工程应用中，按照实现方式和手段的不同，系统仿真可划分为以下三种类型：\n（1） 物理仿真\n（2） 数学仿真\n（3） 半物理仿真\n机器人系统仿真是指通过计算机对实际的机器人系统进行模拟的技术。\n通过计算机对实际的机器人系统进行模拟。机器人系统仿真可以通过单机或多台机器人组成的工作站或生产线。仿真可以通过交互式计算机图形技术和机器人学理论等，在计算机中生成机器人的几何图形，并对其进行三维显示，用来确定机器人的本体及工作环境的动态变化过程。通过系统仿真，可以在制造单机与生产线之前模拟出实物，缩短生产工期，可以避免不必要的返工。在使用的软件中，工作站级的仿真软件功能较全，实时性高且真实性强，可以产生近似真实的仿真画面；而微机级仿真软件随实时性和真实性不高，但具有通用性强、使用方便等优点。目前机器人系统仿真所存在的主要问题是仿真造型与实际产品之间存在误差，需要进一步的研究解决[11]。\n1.国内仿真研究的现状\n目前国内对机器人仿真的研究基本上还处于探索阶段，大部分研究都依附于已有的软件而进行的二次开发。我国仿真技术研究起步较晚，但还是取得了一些成果[12]。\n1.清华大学THROBSM机器人仿真系统它包括了机器人的动力学和控制的仿真，因而可以利用该系统对机器人系统进行动态分析和研究。尤其适合于对机器人进行控制和轨迹规划方法的研究。该系统由于配备了机器人语言及示教功能，因而也具备离线编程的功能，它为机器人的应用提供了经济和安全的试验手段。同时也可用作机器人的教学和培训的辅助工具。\n2. ROSIDY仿真软件\nROSIDY是上海交通大学机器人研究所的俞文伟和邓建一研制开发的一套通用化工业机器人图形仿真软件[13]。其图形功能和通用性具有很强的实用价值。ROSIDY是机器人设计、分析研究和推广的有力工具。由于ROSIDY采用商品化图形软件作为图形支撑从而大大地降低了软件开发的成本并保持了完善的图形功能。该软件对于一般工业机器人有良好的扩展性，以利于用户的开发使用。此外，用户可独立运行ROSIDY对感兴趣的机器人进行图形仿真，也可通过软件接口调用ROSIDY。尽管在某些功能方面如速度、实体造型、光源等尚不能与大型软件包相媲美，\n但就其图形功能和对工业机器人的通用性来说已具有实用价值，尤其在工业机器人的初步设计、研究和分析的辅助方面以及应用论证匕将会起到积极的作用。\n3.PCROBSM[14]微机机器人仿真系统\nPCROBSM微机机器人仿真系统是清华大学的崔培莲和孙增圻开发研制的，微机机器人仿真系统(PCROBSM)是一个适用于IBM—PC及其兼容机的机器人仿真系统，该系统功能齐全，可以对机器人的运动学、轨迹规划、动力学、控制算法、力传感器和典型任务等进行仿真。它的主要特色在于具有丰富的机器人控制算法和轨迹规划算法。系统具有良好的用户界面，为用户设计、验证自己的轨迹规划和控制算法提供了方便的环境，如系统提供了机器人语言SvAL、三维示教和三维图显功能。同时为了更接近实用，系统还考虑了许多实际因素。系统采用c语言和FORTRAN语言编程，具有模块化结构，可扩充，易移植。\n4.刚柔耦合机器人动力学仿真系统\n北京工业大学的陈晏、余跃庆等人利用多体动力学软件LMSVirtual[15].Lab和有限元分析ANSYS开发了刚柔耦合机器人动力学仿真系统。由于LMSVirtual．Lab适于机械系统动力学分析但不能直接用于柔性分析，而ANSYS适于有限元分析的情况，将两者结合起来，建立了刚柔耦合机器人动力学仿真系统\n5.JOGL[16]实现的机器人仿真系统JOGL是Java对OpenGL API绑定的开源项目，并设计为采用Java开发的应用程序提供3D图形硬件支持。利用JOGL提供的物体建模、平移、旋转等功能，提出灵活的机器人交互设计方案，实现了机器人系统的快速仿真。通过Applet实现了基于Browser／Server模式的系统开发，用户可以通过网络远程控制机器人的运动行为，克服了对机器人控制的空间限制，机器人运动模型可以严格按照数学模型构造，仿真具有较高的精确度。用JOGL实现的机器人仿真系统具有易扩展、易移植等优点。利用JOGL提供的物体建模、平移、旋转等功能，避开繁琐的底层开发．将注意力集中到机器人的交互原理设计上，从而快速实现机器人仿真系统。本文通过Applet实现了B，S模式的开发，用户可以通过网络远程控制机器人的运动行为，克服对机器人控制的空间限制。机器人运动模型可以严格按照机器人的数学模型构造，具有较高的精确度。\n6．华北电力大学的机器人仿真通用试验平台华北电力大学的机器人仿真通用试验平台的设计与实现是将MATLAB6.0[17]，OpenGL[18]和VC++6.0[19]这三者结合起来，充分发挥它们各自的优点和特长，无论是从开发效率和程序功能的实现，还是开发速度和程序的可扩充性等，对机器人仿真系统开发将具有显而易见的优越性。这种结合各个软件的优势，使最终结果最优的思想是值得我们学习和借鉴的。\n2.国外仿真研究的现状\n国外对工业机器人仿真系统的开发从1982年开始至1987年，基本上形成了一些成熟的CAD软件包。例如美国的UOBSM、英国的SAMMIE、以色列的ROBCAD等，还有StephenDerby等人1983年开发的GRASP仿真系统等。\n1.DELMIA[20]软件\nDELMIA软件在机器人应用仿真方面处于世界领先地位。DELMIA软件能显著降低人机时和工程准备时间，提高仿真的精度。DELMIA/IGRIP是专业机器人模拟软件，利用IGRIP可快速和图形化地构造各种应用工作单元作业，同时DELMIA/IGRIP能很容易导入CAD数据，自动碰撞侦测功能从而避免破坏，减小风险。不管是对单个机器人作业单元还是整个工厂生产线，IGRIP都能提供相应的解决方案以提高制造质量、精度和效益。应用DELMIM/IGRIP软件的建模仿真模块，成功解决了机器人在工作过程中无法直接观察空间运动状况的难题，是直观方便地进行机器人仿真的有益尝试。\n2.ADAMS[21]软件\nADAM软件是虚拟样机领域非常优秀的软件。它的功能很强大，给用户提供了友好的界面，快速简便的建模功能，强大的函数库，交互式仿真和动画显示功能等等。使用这套软件可以产生复杂机械系统的虚拟样机，真实地仿真其运动过程，并且可以迅速地分析和比较多种参数方案，直至获得优化的工作性能，从而大大减少了昂贵的物理样机制造及试验次数，提高了产品设计质量，大幅度地缩短产品研制周期和费用。对于形状十分复杂的机械零部件，用ADAMS建立三维实体模型会十分困难，需要借助PRO/E等来辅助建模，利用两个软件之间的接口程序Mechanism/Pro生成刚体并加一些约束和标记等；其次，将模型转化到ADAMS界面下，再加复杂的约束和力等，对仿真结果进行检验(如和物理样机对比等)，如果不合适，再调整模型或约束等条件，最终达到理想的仿真结果。\n3. ROBCAD[22]软件\nROBCAD是运行在SGI图形工作站、UNIX操作系统下的大型机器人设计、仿真和离线编程系统。其主要功能包括：\n(1)完整的二维、二维半、三维图形设计，图形的逻辑运算，提供线框图、消隐图、实体造型及光照模型。\n(2)提供多种标准几何建模协议，实现了其它CAD软件如IGES、VDAFS、SET、GEOMOD和ROBCAD的兼容。在这些环境下建立的几何模型可以互相调用。\n(3)机器人及设备运动学自动建模，具有大自由度以下机器人通用运动学逆解调器，提供机器人库及部件库，机器人库里面包括了目前国际上商业化机器人100多种。\n(4)机器人工作单元设计、布置方案可行性检查及优化，工作点及轨迹的交互式生成，机器人及设备的运动和示教，机器人及设备作业任务自动生成。\n(5)工作单元作业任务描述及机器人、设备之间的相互通讯，提供了通用编译型的任务描述语言TDL。\n(6)工作单元作业任务动态图形仿真，随机中断和继续，实时观察，碰撞检测及报警，并提供仿真结果视频输出。\n(7)整个工作单元或单元内任一元素均可根据ANSI/ISO/DIN标准绘出机械图纸，提供完整的尺寸标注及数据，具有绘图机接口。\n(8)可实现离线编程和机器人任务的上调、下装，提供了17种机器人控制器语言的翻译器或编译器。实现机器人工作单元作业的动态图形仿真。在仿真过程中，可对工作单元进行任意平移、旋转、缩放、视点变化；用户可以在任意位置和角度观察单元内的作业情况，系统提供多窗口显示，在每个图形窗内显示单元不同侧面或局部。\n4.Matlab/Simulink软件\nMATLAB经过长期不断地发展和完善，已经成为当今世界上最优秀的数值计算软件。它除了具有强大的科学计算功能和丰富的图形功能之外，还具有一些其它软件无法比拟的功能和优点，尤其是它提供了系统动态仿真工具箱SIMULINK。SIMULINK由模块库、模型构造及分析指令、演示程序等三部分组成。是一个模块化、模型化的系统动态仿真环境。用户应用SIMULINK对系统进行建模、仿真相分析时如同堆积积木一样简单方便，只需要在模型窗口中单击或是拖动鼠标即可。在SIMULINK环境中，对于由微分方程或差分方程描写的系统，用户无须编写文本形式的程序，而只要通过一些简单操作就可形象地建立起研究系统的数学模型，并进行仿真析研究。\n5.Webots[23]软件\nWebots经瑞士洛桑市瑞士联邦科技中心协同开发、测试于验证，可让使用者节省大量的开发时间，全球已有超过300所大学和研究中心采用。Webots内建的感测器与制动器资料库，可让使用者设定所有的机器人属性，即使在同一工作环境有数个不同类型的机器人。对于每个物件使用者可定义外型、颜色、材质、质量与摩擦系数等等各种属性，同时可在每一个机器人装设大量的感测器与制动器。应用内建的整合开发环境或个人所喜好的程式语言软件编辑模拟机器人控制程式，然后转移到实际的移动式机器人。\n6.Microsofl Robotics Studio[24]软件\nMicrosoft Robotics Studio软件开发包包含一个轻量级的、面向服务的运行库，一套可视化编辑和模拟工具，以及能够帮助我们入门的开发指南和示例代码。可以直接在微软网页上免费下载，Microsoft Robotics Studio允许开发人员使用任何他们擅长的编程语言(VB．net，C#，JavaScript甚至IronPython)，同时也能很好地支持Web以及基于Windows的监控，可以支持很多种机器人平台以及硬件。\n7.Real Motion System软件\nReal Motion System软件平台是由总部位于日本东京的Speecys公司开发的，该软件平台包括SolidWorks、3D/CAD和COSMOSMotion，以及一个机械仿真分析软件，它已经在SPC-003机器人原型上试运行成功。RealMotion System包括一个用于机器人运动编程控制的机器人软件开发工具、一个实现机器人运动的软件、机器人原型、3DCAD数据和机械仿真工具。有了这个平台，工程师可以在SolidWorks和COSMOSMotion之间传输数据来实现机器人的三维运动。R20、Solidworks和COSMOSMotion无需真正的机器人原型就模拟了三维机器人运动。这个模拟包括了机器人如何保持平衡，它的重心位置，以及每部分产生的扭矩。通过这个系统也可以比较一个CAD设计和一个真正的机器人的运动。以前，如果工程师想更换机器人的一只手臂，只能做一个铝架然后装配成一个真的机器人。现在，可以通过COSMOSMotion和三维设计数据模拟这个更换过程。\n五．Matlab/Simulink+Adams联合仿真简介\n利用Adams软件和Matlab软件联合进行联合仿真，就是在设计带有控制系统的机械系统时，运用Adams建立机械模型——ADAMS提供虚拟样机的三维模型、运动学模型和动力学模型，并导入Matlab进行控制系统设计和虚拟样机调试——Matlab提供控制目标轨迹、控制算法，然后反馈给机械模型的过程[25-26]。形成完整的闭环控制系统，这种通过共用一个虚拟模型的交互式设计仿真能将基本力学原理与现代控制理论相结合，能够更有效地解决机械系统的控制问题。\n利用Adams和Matlab及其动态仿真集环境Simulink分别建立六关节机器人的机械系统模型和控制系统模型，然后通过交互方式进行仿真，并对该机器人的运动学和动力学特性进行分析。\n1.Adams简介：\nADAMS[27]，即机械系统动力学自动分析(Automatic Dynamic Analysis of Mechanical Systems)，该软件是美国MDI公司(Mechanical Dynamics Inc.)开发的虚拟样机分析软件。目前，ADAMS已经被全世界各行各业的数百家主要制造商采用。根据1999年机械系统动态仿真分析软件国际市场份额的统计资料，ADAMS软件销售总额近八千万美元、占据了51%的份额,现已经并入美国MSC公司。\n2.Adams软件应用\nADAMS软件使用交互式图形环境和零件库、约束库、力库，创建完全参数化的机械系统几何模型，其求解器采用多刚体系统动力学理论中的拉格郎日方程方法，建立系统动力学方程，对虚拟机械系统进行静力学、运动学和动力学分析，输出位移、速度、加速度和反作用力曲线。ADAMS软件的仿真可用于预测机械系统的性能、运动范围、碰撞检测、峰值载荷以及计算有限元的输入载荷等。\nADAMS一方面是虚拟样机分析的应用软件，用户可以运用该软件非常方便地对虚拟机械系统进行静力学、运动学和动力学分析。另一方面，又是虚拟样机分析开发工具，其开放性的程序结构和多种接口，可以成为特殊行业用户进行特殊类型虚拟样机分析的二次开发工具平台。ADAMS软件有两种操作系统的版本：UNIX版和Windows NT/2000版。在这里将以Windows 2000版的ADAMS l2.0为蓝本进行介绍。\n对于机器人的建模：运用ADAMS样机技术对虚拟机器人系统做考虑重力后影响的运动学仿真，过程如下：先借助Pro/E或CATIA等其它的三维软件进行参数化建模，建立6自由度通用机器人的虚拟三维实体模型，并通过专用接口模块Mechanism/Pro与其它的接口模块将该虚拟机器人导入ADAMS平台，再参照机器人实际的几何参数、物理特性以及约束等各种条件，建立了该虚拟6自由度机器人的运动学仿真模型，并在考虑重力作用下，进行空间轨迹跟踪的仿真，获取了一系列的结果，为优化机器人结构和提升控制品质的后续研究工作提供有价值的数据信息[28-29]。\n3.Adams主要模块简介\n使用的主要模块介绍[29]：\nADAMS模块\nADAMS/View\nADAMS/View是Adams系列产品的核心模块之一，采用以用户为中心的交互式图形环境。提供了强大的建模仿真环境，并能够对模型进行参数化的分析，用实验数据验证模型。\nADAMS/Solver\nADAMS/Solver是Adams系列产品的核心模块之一，是ADAMS产品系列中处于心脏地位的仿真器。改模块自动生成机械系统模型的动力学方程，提供了静力学、运动学和动力学分析的结算结果。ADAMS/Solver有各种建模和求解选项，以便精确有效的解决各种工程应用问题。\nADAMS/Solver可以对刚体和弹性体进行仿真研究。\nADAMS/PostProcessor\nADAMS/PostProcessor是后处理模块，可以用来处理仿真结果数据，显示仿真动画等，既可以在Adams/View环境中运行也可以脱离该环境独立的运行。\nADAMS/Controls\nADAMS／Controls是ADAMS软件包中的一个集成可选模块。\n在ADAMS／Contro1s中，设计师既可以通过简单的继电器、逻辑与非门、阻尼线圈等建立简单的控制机构，也可以利用通用控制系统软件（如MATLAB，MATRIX，EASY5）建立的控制系统框图，建立包括控制系统、液压系统、气动系统和运动机械系统的仿真模型。\nMechanism/Pro\nMechanism／Pro是连接Pro/E与ADAMS之间的桥梁。\nPro/E与ADAMS采用无缝连接的方式使Pro/E用户不必退出其应用环境，就可以将装配的总成根据其运动关系定义为机构系统，进行系统的运动学仿真，并进行干涉检查、确定运动锁止的位置、计算运动副的作用力。 Mechanism/Exchange是采用Pro／DEVELOP工具创建的，因此Pro/E用户可以在其熟悉的CAD环境中建立三维机械系统模型，并对其运动性能进行仿真分析，通过一个按键操作，可将数据传送到ADAMS中，进行全面的动力学分析。\n4.Matlab/Simulink简介\nMATLAB是矩阵实验室[30]（Matrix Laboratory）的简称，是美国MathWorks公司出品的商业数学软件 ，用于算法开发、数据可视化、数据分析以及数值计算的高级技术计算语言和交互式环境，主要包括MATLAB和Simulink两大部分。\nMATLAB和Mathematica 、Maple 并称为三大数学软件。它在数学类科技应用软件中在数值计算 方面首屈一指。MATLAB可以进行矩阵 运算、绘制函数和数据、实现算法、创建用户界面、连接其他编程语言的程序等，主要应用于工程计算、控制设计、信号处理与通讯、图像处理 、信号检测 、金融建模设计与分析等领域。\nMATLAB的基本数据单位是矩阵，它的指令表达式与数学、工程中常用的形式十分相似，故用MATLAB来解算问题要比用C，FORTRAN等语言完成相同的事情简捷得多，并且mathwork也吸收了像Maple等软件的优点,使MATLAB成为一个强大的数学软件。在新的版本中也加入了对C ，FORTRAN ，C++ ，JAVA 的支持。可以直接调用,用户也可以将自己编写的实用程序导入到MATLAB函数库中方便自己以后调用，此外许多的MATLAB爱好者都编写了一些经典的程序，用户可以直接进行下载就可以用。\nSimulink[31-32]是MATLAB 最重要的组件之一，它提供一个动态系统建模、仿真和综合分析的集成环境。在该环境中，无需大量书写程序，而只需要通过简单直观的鼠标操作，就可构造出复杂的系统。Simulink具有适应面广、结构和流程清晰及仿真精细、贴近实际、效率高、灵活等优点，并基于以上优点Simulink已被广泛应用于控制理论和数字信号处理的复杂仿真和设计。同时有大量的第三方软件和硬件可应用于或被要求应用于Simulink。\n5.Simulink软件应用\nSimulink是MATLAB中的一种可视化仿真工具， 是一种基于MATLAB的框图设计环境，是实现动态系统建模、仿真和分析的一个软件包，被广泛应用于线性系统、非线性系统、数字控制及数字信号处理的建模和仿真中。Simulink可以用连续采样时间、离散采样时间或两种混合的采样时间进行建模，它也支持多速率系统，也就是系统中的不同部分具有不同的采样速率。为了创建动态系统模型，Simulink提供了一个建立模型方块图的图形用户接口(GUI) ，这个创建过程只需单击和拖动鼠标操作就能完成，它提供了一种更快捷、直接明了的方式，而且用户可以立即看到系统的仿真结果。\nSimulink[33]是用于动态系统和嵌入式系统的多领域仿真和基于模型的设计工具。对各种时变系统，包括通讯、控制、信号处理、视频处理和图像处理系统，Simulink提供了交互式图形化环境和可定制模块库来对其进行设计、仿真、执行和测试。.\n构架在Simulink基础之上的其他产品扩展了Simulink多领域建模功能，也提供了用于设计、执行、验证和确认任务的相应工具。Simulink与MATLAB® 紧密集成，可以直接访问MATLAB大量的工具来进行算法研发、仿真的分析和可视化、批处理脚本的创建、建模环境的定制以及信号参数和测试数据的定义。\n对于机器人的控制：Simulink是Matlab软件中用来对动态系统进行建模、仿真和分析的一个软件包，它支持连续、离散及两者混合的线性和非线性系统，也支持具有多种采样频率的系统。Simulink包含有SINKS(输入方式)、SOURCE(输入源)、LINEAR(线性环节)、ONLINEAR(非线性环节)、CONNECTIONS(连接与接口)和EXTRA(其他环节)子模型库，而且每个子模型库中包含有相应的功能模块。用户也可以定制和创建自己的专用模块。\n6.ADAMS与Simulink联合仿真介绍\n联合仿真[34]：在仿真过程中，机械动力学解算通过植入的ADAMS模块进行，控制解算通过控制软件求解器，两者之间通过状态空间进行接口变量的联系，在仿真离散时间点上通过IPC进行相关信息的交互。仿真运行时，可以在Matlab/Simulink中观察并输出仿真结果曲线。同时，也可以在仿真结束后，进入ADAMS的后处理(Postprocess)模块观看仿真动画。\n通过观看动画可以验证步态规划的合理性以及控制方法的有效性，在后处理模块还可以计算处理各个关节运动副上的角位移、角速度、角加速度、作用力和作用力矩等数据曲线[35-36]。\n具体的实现步骤：\n1.建立虚拟模型\n对于简单的模型，可以使用Adams软件直接建立，对于复杂的模型需要其它CAD软件建立之后通过相应的接口导入，然后施加各种约束。\n2.定义Adams的输入和输出\nAdams的输入输出时控制系统输入输出的接口。同时adams的输入就是控制系统的输入。Adams的输出相当与控制系统的测量值。\n3.通过Adams建立的机器人模型和Matlab建立的控制系统，使其形成一个闭环系统，对这个闭环系统进行仿真分析；通过对输出地结果进行分析，不断地修改控制系统的参数达到理想的状态。"}
