{"content2":"1、机器学习在工程项目中的应用实践经验谈\n目前，人工智能、机器学习在很多人眼中是数据科学家们的专属武器，能够应用和掌握他们的数据科学家们都有着极其深厚的数学理论功底。那些想要学习和实践人工智能的工程师们，往往要么是在打开相关书籍的时被映入眼帘的数学公式吓倒，要么就是学习了很多机器学习的理论及算法但面对实际项目却手足无措。\n近年来蔡超带领亚马逊工程团队应用机器学习、深度学习技术在全球客服系统智能化，推荐系统本地化及合规性检测自动化等多个方面实现了大量的成功创新。本案例是亚马逊工程师的学习和实践经验分享，告诉广大工程师如何成长为一个人工智能的实践者。\n2、打造人工智能时代的最强计算引擎——深度学习框架演进漫谈\n随着深度学习技术在图像、语言、语音等应用场景都达到了state of the art效果，深度学习框架也呈现群雄逐鹿的态势，谷歌、脸书、微软、亚马逊、百度等大企业及少数几家创业公司都推出了自己的产品。本案例将对现有主流深度学习框架做一梳理，和业界同行探讨这个领域的技术是否已收敛。\n首先，从用户体验角度讨论，一个好的深度学习框架应该有什么样的特点；\n其次，从技术角度讨论，什么样的设计和实现才能打造人工智能时代的最强计算引擎。\n3、机器学习和运筹优化在外卖行业的应用实践\n外卖行业继电商、出行之后成为第三个千万级别的互联网消费行业，每天有2500万人次足不出户地在外卖平台上找到自己喜欢的餐厅和食物，享受着30分钟送到手里的便利。如何精准地找到用户需求，提高转化率和增加用户粘度，最大化平台的物流效率和服务质量，都需要大数据和人工智能的帮助。\n本案例将主要通过分享4个实例，介绍机器学习和运筹优化在外卖行业的应用实践，具体讲讲算法解决方案和迭代过程。\n4、第四范式如何利用大规模机器学习技术解决问题并创造价值\n目前深度学习在某些领域已经有了较成熟的解决方案，例如图像特征提取、语音识别、文本翻译等。但企业级应用涉及各个范围，以上只是企业经营过程中的一小部分。在其他领域如营销、反欺诈、广告等行业应用，就需要一些其他的算法和技术，比如说超高维的特征工程和算法。\n本案例将从机器学习的概念开始，讲到怎样做数据清洗处理、机器学习的典型建模流程、机器学习常见的评估指标，以及第四范式在金融、互联网领域应用机器学习的成功案例。\n5、如何使用机器学习实现 News Feed 正向交互率提升100%\n从 2016 年年底开始，知乎使用机器学习技术对 News Feed 进行了改进，期间经历了 Edge Rank - Learning to Rank - DNN 模型推荐等阶段，并且取得了不错的成果：News Feed 的正向交互率提升了100%，用户在 Feed 页的停留时长上升了 40%。\n本案例将会从产品和技术等方面向大家阐释知乎过去一年内所做的改进，包括他们在构建用户画像系统、首页的推荐和排序模块中遇到的一些技术问题和解决方法。\n6、Tutorabc如何通过机器学习有效解决业务难题\n本次分享将从大数据团队的构建、数据平台的架构和落地、数据仓库的建设、数据可视化、机器学习和人工智能如何结合大数据平台落地，讲叙Tutorabc大数据和AI的快速成长之路，以及在实践过程中，如何通过机器学习和人工智能有效帮助业务解决问题，提高业务服务效率，提升用户体验。\n在介绍过程中，会穿插讲解如何用一个不足10人的团队，解决“缺少银弹”的问题，并在完成对公司业务帮助的同时，见缝插针的解决技术架构升级。\n7、深度学习在直播推荐系统中的应用\n本案例将从推荐系统的两个关键技术点：召回和排序，来讲解深度学习模型的应用，包括推荐召回中的标签提取，结果排序中的CTR预估等方面，探讨深度神经网络在自然语言处理和CTR预估领域中的优势与挑战，以及深度推荐系统的前景与发展。\n8、国美推荐引擎与算法持续部署实践\n电商平台中，个性化推荐是提高用户购物体验的关键组件。作为国美在人工智能领域的重要试金石，“推荐系统如何做好算法的持续部署”是一个非常有挑战性的问题。\n本案例以国美推荐引擎提升自身训练和决策能力的升级历程为主线，介绍了流式计算引擎、特征多级存储系统、机器学习算法的演进、A/B测试系统、算法和特征的双链路监控、深度学习模型的实践部署等内容。同时还探讨了国美在人工智能领域未来的发力点。\n除了机器学习，还有哪些AI前沿？\n1、从视觉计算近期进展“管窥”AI之ABCDE\n本次分享将在回顾计算机视觉领域近期部分重要进展的基础上，对此次AI热潮背后的深度学习技术源起和基本原理做概括性的介绍，特别是将探寻深度学习与脑神经科学的关系。之后，将以一个具体的例子为切入点，介绍深度学习给AI研发带来的方法论上的变迁，继而分析深度学习对全面实现AI的不足之处以及未来需要努力的方向。\n听众收益：\n1.学到一个公式：AI=A+B+C+D+E，即AI背后需要的几大驱动力；\n2.深度学习从生物神经系统那里得到了哪些启发；\n3.现有深度学习为代表的AI方法论的优缺点是什么；\n4.AI全面开花还需要哪些努力。\n2、微信小程序商业智能技术应用实践\n2017年初微信小程序正式上线，经过一年的发展，人们已经逐渐认识到小程序带来的便利，随着越来越多的人开始使用小程序，小程序已经成了微信生态系统中不可分割的一部分。本案例将和大家一起分享小程序在商业化方向的技术尝试和相关应用案例，包括商业智能、数据决策、用户分析、个性化推荐等，并与大家一起探讨小程序未来的发展方向。\n3、苏宁智能机器人平台\n随着苏宁云商、金融、体育、文创等线上、线下业务的不断拓展，积累了大量的用户行为以及客服会话数据，如何充分挖掘海量规模的数据，改进用户体验、提高客服效率，成为苏宁亟待解决的问题。苏宁技术研究院人工智能实验室研发了智能机器人平台，采用当前流行的会话即平台技术，集成闲聊陪伴和专业助理等不同技能，包括家电控制、智能办公、智能客服、智能导购等，为业务线提供良好支持。\n本次分享主要介绍苏宁智能机器人平台的架构设计、基于深度学习的文本、可视化问答实现和在视频、家居、办公等不同场景的广泛应用。\n分享朋友圈 也是另一种赞赏\nThe more we share, The more we have\n欢迎加入数据君高效数据分析社区\n加我私人微信进入大数据干货群：tongyuannow\n\n目前100000+人已关注加入我们"}
