{"content2":"计算机视觉-机器学习近年部分综述计算机视觉和机器学习领域 近两年部分综述文章，欢迎推荐其他的文章，不定期更新。【2015】[1].    E.Sariyanidi, H. Gunes, A. Cavallaro, Automatic Analysisof Facial Affect: A Survey of Registration, Representation, and Recognition,IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE, VOL. 37, NO. 6,JUNE 2015PDF:  2015-1. Automatic Analysis of Facial Affect A Survey of Registration, Representa.pdf (1.51 MB)[2].    T. Li,H. Chang, M. Wang, B.B. Ni, R.C. Hong, S.C. Yan, CrowdedScene Analysis: A Survey, IEEE TRANSACTIONS ON CIRCUITS AND SYSTEMS FORVIDEO TECHNOLOGY, VOL. 25, NO. 3, MARCH 2015PDF:  2015-2. Crowded Scene Analysis A Survey.pdf (5.42 MB)[3].    Z.Zhang, Y. Xu, J. Yang, X.L. Li, D. Zhang, A Survey of Sparse Representation: Algorithms and Applications, IEEE ACCESS, date ofpublication May 6, 2015PDF:  2015-3. A Survey of Sparse Representation.pdf (4.8 MB)[4].    J.Galbally, S. Marcel, J. Fierrez, Biometric AntispoofingMethods: A Survey in Face Recognition, IEEE ACCESS, date of publicationDecember 18, 2014PDF:  2015-4. Biometric Antispoofing Methods A Survey in Face Recognition.pdf (10.43 MB)[5].    B.Tian, B. T. Morris, M. Tang, Y.Q. Liu, Y. J. Yao, C. Guo, D.Y. Shen, S.H. Tang, Hierarchical and Networked Vehicle Surveillance in ITS:A Survey, IEEE TRANSACTIONS ON INTELLIGENT TRANSPORTATION SYSTEMS, VOL.16, NO. 2, APRIL 2015PDF:  2015-5. Hierarchical and Networked Vehicle Surveillance in ITS A Survey.pdf (1.12 MB)[6].    A. Betancourt,P. Morerio, C. S. Regazzoni, and M. Rauterberg, TheEvolution of First Person Vision Methods: A Survey, IEEE TRANSACTIONS ONCIRCUITS AND SYSTEMS FOR VIDEO TECHNOLOGY, VOL. 25, NO. 5, MAY 2015PDF:  2015-6. The Evolution of First Person Vision Methods A Survey.pdf (2.69 MB)[7].    L.Shao, F. Zhu, and X.L. Li, Transfer Learning for VisualCategorization: A Survey, IEEE TRANSACTIONS ON NEURAL NETWORKS ANDLEARNING SYSTEMS, VOL. 26, NO. 5, MAY 2015PDF:  2015-7. Transfer Learning for Visual Categorization A Survey.pdf (3.11 MB)[8].    Freek Stulp, Olivier Sigaud, Many regression algorithms, one unified model: A review, Neural Networks, June 2015PDF: 2015-NN-Many regression algorithms, one unified model A review.pdf (1.1 MB)[9].      Qixiang Ye, David Doermann，Text Detection and Recognition in Imagery: A Survey， IEEE TPAMI, July 2015PDF:  2015-PAMI-Text Detection and Recognition in Imagery A survey.pdf (1.12 MB)[10].    Salient Object Detection: A Benchmark, Ali Borji, Ming-Ming Cheng, Huaizu Jiang, Jia Li, arXiv eprint, 2015.  [pdf] [Project page]【2014】[1].    S. Fu,H. B. He, Z.G. Hou, Learning Race from Face: A Survey, IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE, VOL. 36, NO.12, DECEMBER 2014PDF:  2014-1. Learning Race from Face A Survey.pdf (2.55 MB)[2].    H.L. Zhou,A. Mian, L. Wei, D. Creighton, M. Hossny, and S. Nahavandi, Recent Advances on Singlemodal and Multimodal FaceRecognition: A Survey, IEEE TRANSACTIONS ON HUMAN-MACHINE SYSTEMS, VOL.44, NO. 6, DECEMBER 2014PDF:  2014-2. Recent Advances on Singlemodal and Multimodal Face Recognition A Survey.pdf(669.19 KB)[3]       Salient Object Detection: A Survey, Ali Borji, Ming-Ming Cheng, Huaizu Jiang, Jia Li, arXiv eprint, 2014.  [pdf] [Project page] [Bib]【2013】[1].  O. D. Lara, M.A. Labrador, A Survey on Human Activity Recognition using WearableSensors,IEEE COMMUNICATIONS SURVEYS & TUTORIALS, VOL. 15, NO. 3,THIRD QUARTER 2013PDF:  2013-1. A Survey on Human Activity Recognition using Wearable Sensors.pdf (1.65 MB)[2].  A. Sotiras, C. Davatzikos, Nikos. Paragios, Deformable Medical Image Registration: A Survey, IEEETRANSACTIONS ON MEDICAL IMAGING, VOL. 32, NO. 7, JULY 2013PDF:  2013-2.Deformable Medical Image Registration A Survey.pdf (1.3 MB)[3].  A. Alrahayfeh, M. Faezipour, Eye Tracking and Head Movement Detection: A State-of-ArtSurvey, IEEE Journal of Translational Engineering in Health andMedicine, 2013PDF:  2013-3. Eye Tracking and Head Movement Detection A State-of-Art Survey.pdf (2.22 MB)[4].  P.V.K. Borges, N. Conci, and A. Cavallaro, Video-Based Human Behavior Understanding: A Survey, IEEETRANSACTIONS ON CIRCUITS AND SYSTEMS FOR VIDEO TECHNOLOGY, VOL. 23, NO. 11,NOVEMBER 2013PDF:  2013-4. Video-Based Human Behavior Understanding A Survey.pdf (15.27 MB)[5] Mao Ye, Qing Zhang, Liang Wang, Jiejie Zhu, Ruigang Yang, Juergen Gall. A Survey on Human Motion Analysis from Depth Data. Time-of-Flight and Depth Imaging.  2013.PDF: survey-motionanalysis_DRAFT.pdf  (14.47 MB)整理于：http://www.valseonline.org/thread-505-1-1.html声明：如果转载了本文的版本，也请注明转载出处：http://www.cvrobot.net/computer-vision-and-machine-learning-summary-in-recent-years/如果您对该机器学习、图像视觉算法技术感兴趣，可以关注新浪微博：视觉机器人  或者加入 QQ群：101371386欢迎投稿或者推荐好的内容~~"}
