{"content2":"﻿﻿\n人工智能自降生以来就仿佛自带光环、备受瞩目。尤其是今年，国务院印发的《新一代人工智能发展规划》中提出，到2030年使中国人工智能理论、技术与应用总体达到世界领先水平，成为世界主要人工智能创新中心，更使得人工智能将引爆智能投资革命成为行业及大众议论的焦点。\n作为人工智能（AI）的三大领域之一的计算机视觉近期也之间越来越受到关注，在今年7月，商汤科技更是以B轮4.1亿美元的融资创造了AI圈单笔最高融资记录。那么国内有哪些计算机视觉公司值得关注呢？我们来盘点下。\n计算机视觉与机器视觉\n计算机视觉是一门研究如何使机器“看”的科学，间的单说，就是指用摄影机和电脑代替人眼对目标进行识别、跟踪和测量等机器视觉，并进一步做图形处理，使电脑处理成为更适合人眼观察或传送给仪器检测的图像。计算机视觉也可以看作是研究如何使人工系统从图像或多维数据中“感知”的科学。它的最终研究目标就是使计算机能象人那样通过视觉观察和理解世界，具有自主适应环境的能力。\n机器视觉就是用机器代替人眼来做测量和判断。机器视觉系统是通过机器视觉产品（即图像摄取装置，分CMOS和CCD两种）将被摄取目标转换成图像信号，传送给专用的图像处理系统，得到被摄目标的形态信息，根据像素分布和亮度、颜色等信息，转变成数字化信号;图像系统对这些信号进行各种运算来抽取目标的特征，进而根据判别的结果来控制现场的设备动作。\n从学科分类上，二者都被认为是AI下属科目，不过计算机视觉偏软件，通过算法对图像进行识别分析，而机器视觉软硬件都包括（采集设备，光源，镜头，控制，机构，算法等），指的是系统，更偏实际应用。简单的说，我们可以认为计算机视觉是研究“让机器怎么看”的科学，而机器视觉是研究“看了之后怎么用”的科学。\n随着硬件、算法及大数据的不断发展，整个人工智能领域面临前所未有的规模增长，也促使了国外的许多创业公司被大公司收购。　同时图像识别的能力越来越强，错误率越来越低，国内也陆续爆发了大批优秀的计算机视觉（ComputerVision）创业公司。\n1、SenseTime商汤科技：教会计算机看懂这个世界\n提到计算机视觉，最火的莫过于商汤科技，该公司在今年7月宣布完成4.1亿美元B轮融资，创下公开报道中全球人工智能领域单轮融资最高纪录。\n罗马不是一日建成的，人工智能也不可能横空出世。商汤在深度学习领域经历了一个长期艰苦积累的过程。\n80后徐立是商汤联合创始人、CEO，也是一位计算机视觉科学家。2010年，徐立于香港中文大学攻读博士学位，与深度学习视觉领域应用的先驱——汤晓鸥教授以及其带领的香港中文大学多媒体实验室的师兄弟联系紧密。\n2011年，汤晓鸥、徐立所在实验室的几十个博士、教师开始研究深度学习。这是学术界最早涉猎深度学习的华人团队。2011至2013年间，在CVPR和ICCV两大全球计算机视觉世界顶级学术会议上，29篇涉及深度学习的文章中，有14篇出自该实验室。这个团队，成为了后来商汤的中坚力量。\n2014年，商汤首次出征人工智能领域权威竞赛ImageNet，在大规模物体检测比赛中就以40.7%的成绩荣获世界亚军，战胜微软、百度等企业，仅次于谷歌。\n2015年，在ImageNet竞赛新增的视频物体检测任务中，商汤联合香港中文大学多媒体实验室组成的团队，在30个类别的物体识别准确率PK中获得28个胜利，以压倒性优势夺冠。\n2016年，商汤更是在ImageNet的五项竞赛里取得了三项冠军。同年，由商汤参与的人工智能团队与麻省理工、斯坦福等著名大学一道，入选世界十大人工智能先锋实验室。\n据悉，商汤致力于引领人工智能核心“深度学习”技术突破，构建人工智能、大数据分析行业解决方案。商汤成功聚集了当下华人中较有影响力的深度学习、计算机视觉科学家。在人工智能产业兴起的大背景下，商汤集团凭借在技术、人才、专利上超过十年的积累，迅速成为了人工智能行业领军企业之一。\n2、旷视科技：让机器看懂世界\n旷视科技是国内计算机视觉公司的另一个明星。\n资料显示，北京旷视科技有限公司（Face++）成立于2012年11月，公司专注于人脸识别技术和相关产品应用研究，面向开发者提供服务，能提供一整套人脸检测、人脸识别、人脸分析以及人脸3D技术的视觉技术服务，主要通过提供云端API、离线SDK、以及面向用户的自主研发产品形式，将人脸识别技术广泛应用到互联网及移动应用场景中。\nFace++通过和众多互联网公司合作，并通过“脱敏”技术掌握到了500万张人脸图片数据库，在互联网图片人脸识别LFW的准确率达到99.6%，合作伙伴包括阿里、360等一批大型的图片、社交、设备类企业。\n2014年成了旷视的分水岭，在“摸着石头过河”中，他们发现用人工智能为传统行业赋能具有商机，从而认定了toB（对企业）的商业模式，在互联网、金融、安防、智能楼宇、智能零售等领域铺开业务。\n2016年7月，前微软亚洲研究院首席研究员孙剑加入旷视，引起业内热议。\n旷视的发展也获得了其他行业的高度认可。作为国内最先发布的两款人脸解锁手机，无论是vivo还是小米都选择了与旷视（Face++）进行深度合作，看重的就是旷视科技的雄厚技术实力。两款手机也均可实现500毫秒级别的高速刷脸解锁，明显超越了国际品牌的同档机型。旷视（Face++）云事业副总裁吴文昊表示，刷脸和手机的结合也不会止步于解锁，旷视Face++目前正在打造一套适配整个手机平台的智能视觉解决方案，以解决不同手机厂商在图像增强、相机增强、智能图像和视频处理上的需求。\n毫不夸张的说，从智能手机到智慧手机，旷视（Face++）正在用AI助力手机产业升级！\n3、云从科技：源自计算机视觉之父的人脸识别技术\n2015年4月份，周曦在重庆成立云从科技，作为国内众多的人脸识别初创公司之一，这是一家从“出生”就贴上“国家队”标签的公司，也是唯一一家同时受邀制定人脸识别国家标准、公安部标准、行业标准的企业。团队的创始人员基本来自中科院，也是中科院唯一人脸识别代表团队，参与国家战略性先导科技A类专项，负责人脸识别研究和应用。\n资料显示，广州云从信息科技有限公司即云从科技是一家专注于计算机视觉与人工智能的高科技企业，核心技术源于四院院士、计算机视觉之父——ThomasS.Huang黄煦涛教授。核心团队曾于2007年到2011年6次斩获智能识别世界冠军，得到上市公司佳都科技与香港杰翱资本的战略投资。\n该公司主要技术团队来自中国科学院重庆分院，是中科院研发实力最雄厚的人脸识别团队，并作为中科院战略性先导科技专项的唯一人脸识别团队，代表参与了新疆喀什等地安防布控。\n凭借核心算法、大数据等资源，云从科技已经居于国内人工智能行业的领军地位。\n据报道，目前国内有50多家银行、80%以上的民航枢纽机场在使用云从科技的远程身份认证、人脸与证件照比对识别等产品，22个省（直辖市）采用云从科技的安防技术。2016年，公司实现产值1.5亿元。\n此前，国家发改委确定云从科技与百度、腾讯、科大讯飞共同承担国家人工智能重大工程——“人工智能基础服务资源公共服务平台”建设。其相关负责人透露，下一步，云从科技还将进军教育、医疗、智慧社区等领域，让技术为民生服务。\n4、依图科技：与您一起构建计算机视觉的未来\n成立于2012年9月，并获得了真格基金创始人徐小平100万美元天使投资，在2015年1月获得了高榕资本的数百万美元A轮融资。目前致力于计算机视觉、图像视频智能理解和分布式系统及大数据应用的研究，为用户提供基于图像视频理解的计算机视觉产品。\n依图在成立之初是做车辆识别的，主要与江苏、福建和成都等公安系统合作，之后开始在人脸识别应用上，开发了静态人像对比系统，并将产品的重点之一转向金融，与车辆物体识别相比，人脸识别的应用范围和场景更加广泛，当然难度也会高很多，今年上海金融展上，依图与招商银行推出刷脸取款支付功能。\n2017年5月15日，依图科技宣布得到高瓴资本领投，云锋基金、红杉资本、高榕资本以及真格基金等跟投的3.8亿元C轮融资，最新一轮融资将主要用于人工智能技术在医疗行业的推进。\n与知名度颇高的商汤科技、旷视科技等公司相比，2012年成立的依图科技称得上低调。有人曾建议依图科技创始人兼CEO朱珑加强宣传，但他觉得使公司“全民皆知不一定有意义”。\n5、超多维：让冰冷的机器看懂多彩的世界\n与其他计算机视觉公司相比，超多维的成立时间则要早很多。\n资料显示，深圳超多维科技集团成立于2004年，是全球领先的智能计算视觉生态体系的开创者和引领者。它是目前国内唯一一家以“智能3D识别技术”为创新基础，涵盖“专利授权、3D屏幕制造、3D摄像头制造、3D手机等个人消费电子产品及3D智能图像计算” 的国际创新型企业。\n超多维在智能计算视觉技术领域具有持续的研发能力，凭借十余年的深厚技术沉淀，走出了一条独有的中国企业自主创新之路。超多维拥有覆盖计算视觉关键技术领域——3D显示产业链的完整专利布局。迄今，该公司已在全球范围内申请专利超过1000余项，82%以上为发明专利，专利授权率高达91%。其中，3D显示技术专利数量为中国第一，世界第二。2013年，超多维跟踪式裸眼3D显示技术获得“中国国家技术发明一等奖”，是深圳首家获此国家级最高技术殊荣的企业。\n2016年12月，超多维完成对ivvi手机的并购，进一步完善了其在个人消费电子终端硬件体系的搭建和战略布局，逐步搭建起以核心技术优势为基石，完善的智能计算视觉生态体系（包括裸眼3D、VR、AR、视觉信息模糊计算、AI等）。\n其相关负责人介绍，超多维将加速开发和布局以深度学习、图形图像计算、模糊逻辑计算等核心技术为支撑，具有创新性的个人消费类市场互联网应用及行业垂直领域的专业应用。运用超多维计算视觉综合解决方案，提供与人类视觉感知习惯更加融合的智能化、自然化、人性化、娱乐化的全新极致应用体验，并且在医疗、教育、体验商城、设计等垂直应用领域综合布局。\n据悉，超多维将充分发挥其在信息采集、图形图像运算、智能3D及虚拟显示等方面的技术优势，形成以核心技术为支撑，具备3D及虚拟显示技术的智能硬件为载体，新一代计算视觉互联网及专业应用为基石的产业生态闭环。并以此为牵引，透过与多层次资本市场的互动，与产业链上下游企业进行全方位开放式深度合作和提供扶植，进一步完善布局全球领先的智能计算视觉生态体系，带动整个计算视觉产业链的升级与发展。\n6、格林深瞳：让计算机看懂世界\n格灵深瞳是成立于2013年4月，由创始人赵勇在北京创立，格灵深瞳是一家同时具备计算机视觉和深度学习技术以及嵌入式硬件研发能力的人工智能公司，作为一家视频大数据产品和方案提供商，自主研发的深瞳技术在人和车的检测、跟踪与识别方面居于世界领先水平，公司主要关注的领域包括公共安全、智能交通、金融安防等，同时公司在无人驾驶、机器人和智能医疗方面也进行了深入的布局。\n其创始人赵勇毕业于美国布朗大学计算机工程系，2013年创办北京格灵深瞳信息技术有限公司，在格灵深瞳之前，赵勇主要的工作经历是谷歌总部研究院任资深研究员。\n格灵深瞳已经推出威目视图大数据分析平台，以及威目车辆特征识别系统、威目视频结构化系统、威目人脸识别系统，能够辨识超过4000种车辆，支持车辆和人体的细分特征识别，同时具备人脸识别功能。此外，格灵深瞳还推出了皓目人体行为分析系统；在去年下半年，格灵深瞳人眼摄像机研发成功，它采用独创的像素动态瞬时分配技术，在距离人体50米外，可以达到数亿级等效像素，展现清晰人脸。\n7、陌上花科技（衣+）：人工智能计算机视觉引擎\nYi+成立于2014年，是国内领先的计算机视觉服务商，为企业提供视觉内容智能化和商业化解决方案。Yi+致力于挖掘视觉信息的商业价值。曾获阿里优酷土豆领投A轮融资。公司旗下品牌Yi+是人工智能计算机视觉引擎，衣+是时尚商品搜索引擎。在国际顶级计算机视觉竞赛ImageNet2015中，获得五项世界第一。Yi+致力于人工智能中的感知和认知智能，在图像视频中对场景、通用物体、商品、人脸的检测、识别、理解、搜索及推荐均达到领先水平。\n该公司目前和阿里云、华为、优酷土豆、微博、360、华数、京东、天猫魔盒、CIBN、英伟达、趣拍、花椒、来疯等多家顶级机构和产品深度合作，通过提供边看边买引擎、图像视频内容分析引擎、人脸属性分析引擎服务海量用户，同时帮助内容方实现场景营销、智能分析和内容互动。\n团队成员来自于CMU、新加坡国大、南洋理工、清华、北大、中科院、上海交大、谷歌、微软、IBM、Intel、阿里巴巴、腾讯、百度、华为、360、聚美等。获得阿里巴巴优酷的A轮投资。2017年获1亿元人民币B轮融资，投资方为海通证券、百融骏集团、北京银行旗下基金。\n近3年时间的发展，迅速积累了丰富的行业资源。尤其在传媒和广电方面，YI+拥有其他创业公司无法比拟的资源。除与7个牌照方关系密切外，目前Yi+是帮助广电总局制定TVOS行业标准的唯一视觉AI公司。"}
