{"content2":"1.采集装置\n（1）基本概念\n对某个电磁能量谱波段敏感的物理器件，可以接受辐射并产生与所接收到的电磁辐射能量成正比的模拟电信号并数字化器件，它能将上述模拟电信号转化为数字离散的形式（模/数转换），以输入计算机。\n（2）常用装置\n<1>CCD:电荷耦合器件，其固态阵是由称为感光基元的离散硅成像元素构成的。这样的感光基于能产生与接收所输入光强成正比的输出电压。按照几何组织形式分为线扫描和平面扫描。线阵靠一行基元利用场景和检测器之间的相对运动获得2-D图像。平面可直接得到图像。\n<2>CMOS:互补性金属氧化物，其传感器包括传感器核心，模数转换器，输出寄存器，控制寄存器，增益放大器。感光像元电路分3种：①光敏二极管无源像素结构（其由一个反置的光敏二极管和一个开关管构成，当开关管与垂直的列线连通，位于列线末端的放大器读出放大器电压，当光敏二极管存储的信号被读取时，电压被复位，次数放大器将与输入的光信号成正比的电荷转为为电压输出）②光敏二极管无源像素结构（在无源像元后加上了放大器）③光栅型有源像素结构：信号电荷在光栅下积分，输出前，将扩散点复位，然后改变光栅脉冲，收集光栅下的信号电荷转移到扩散点，复位电压水平之差就是输出电压。\n<3>CID:电荷注入器件，其有一个和图像矩阵对应的电极矩阵，在每一个像素位置有两个隔离/绝缘的能产生电位阱的电极。其中一个电极与同一行的所有像素的对应电极连通，而另一个电极则与同一列的所有像素的对应电极连通。访问像素通常选择行和列实现。这两个电极的电压可分别为正负（包括零），有3种工作模式：①积分模式：此时两个电极的电压为正，光电子会累加，所有的行和列均保持正电压，整个芯片将给出一幅完整的图像。②非消除性模式：此时两个电极一个为正一个为负，为负的电极累加的光电子将会迁移到为正的电极下。这个迁移将会在与第2个电极连通的电路中激发出一个脉冲，脉冲的幅度反映了累加的光电子数。迁移来的光电子会留在电位阱中，这样就可以通过电荷往返迁移来对像素进行反复读出而不消除。③消除性模式：此时两个电极的电压均为负，累加的光电子将会流溢，或注射进电极间芯片硅层中，并在电路中激发处脉冲。同样，脉冲的幅度反映了累加的光电子数。但这个过程将迁移来的光电子排除处电位阱，所以用来“清零”。\n（3）性能指标\n<1>线性响应：指输入物理信号的强度与输出响应信号的强度之间的关系是否线性。\n<2>灵敏度：绝对灵敏度可用所能检测到的最小光子个数表示，相对灵敏度可用能使输出发生一个级别的变化所需的光子个数表示。\n<3>信噪比：指所采集的图像中有用信号与无用干扰的（强度或能量）比值。\n<4>阴影（不均匀度）:指输入物理信号为常数而输出的数字形式部位常数的现象。\n<5>快门速度：对应每次采集拍摄所需的时间。\n<6>读取速率：指信号数据从敏感单元读取信号（传输）的速率。\n2.采集模型\n（1）几何成像模型\n图像采集的过程从几何角度可看作是一个将客观世界的场景通过投影进行空间转化的过程，例如用照相机或摄像机进行图像采集时要将3-D客观场景投影到2-D图像平面，这个投影过程可以用投影变换（也称为成像变化或几何透视变换）描述。一般情况下，客观场景、摄像机和图像平面各有自己不同的坐标系统，所有投影成像涉及到在不同坐标系统之间的转换。\n<1>世界坐标系统:也称真实或现实世界坐标系统XYZ，它是客观时间的绝对坐标。一般的3-D场景都是用这个坐标系统来表示的。\n<2>摄像机坐标系统：是以摄像机为中心制定的坐标系统xyz，一般去摄像机的光学轴为z轴。\n<3>图像平面坐标系统：是在摄像机内形成的图像平面的坐标系统x'y'。一般取图像平面与摄像机坐标系统的xy平面平行，且x轴与x'轴、y轴与y'轴分别重合，这样图像平面的原点就在摄像机的光学轴上。\nPS：归一化摄像机指焦距为1的特定摄像机，也是一种简化的重合模型。\n实际上使用的焦距并不总是1，且在图像平面上是使用像素而不是物理距离来表示位置的。图像平面坐标与世界坐标的联系是(s是尺度因子)，焦距的改变和传感器中光子接受单元的间距变化都会影响平面坐标点与世界坐标点的联系。一个世界坐标系统中的点可用笛卡尔坐标矢量形式表示为,则该点对应的齐次坐标矢量实现为。\n当摄像机与世界坐标不重合时，可通过平移和旋转重合，其中平移矩阵为,xX轴夹角为,zZ轴夹角为\n（2）亮度模型\n图像灰度是由景物亮度转化而来的，成像时如何将景物亮度转化为图像灰度可以遵循一定规律。其由入射到可见景物上的光通量和景物对入射光反射的比率，分布用照度函数和反射函数表示，即。\n3.成像方式\n图像采集方式主要由光源、采集器和景物三者的相对关系所决定。根据光源、采集器和景物三者不同的相互位置和运动情况，可构成多种成像方式。①让光源固定，用一个采集器在一个固定位置对场景取一幅像，亦称单目成像；②如果用多个采集器各在一个位置对同一场景取像就是多目成像；③让采集器相对于景物固定而将光源绕景物运动，就是构成光移成像；如果保持光源固定而让采集器进行运动以跟踪场景是主动视觉成像；④让采集器和景物同时运动，为主动视觉自运动成像；⑤用可控光源照射景物，通过采集到的投影模式来解释景物的表面形状为结构光成像。\n(1)结构光法\n该方法是采集图像是直接获取深度信息的方法，基本思想是用照明中的几何信息来帮助提取景物自身的几何信息。结构光测距成像系统主要有光源和摄像机两部分组成，与被观察物体成一个三角形。光源产生一系列的点或线激光并照射到物体表面，再由摄像机将景物被照明的部分记录下来，最后通过三角计算来获得深度信息，也称主动三角测距法。其测距精度可达微米级别，深度场范围是测距精度的几百或者几万倍。\n其具体方式有很多：采用光条法、栅格法、圆形光条线、交叉线、厚光条、空间编码模版法、彩色编码条、密度比例等，由于投射光束的结构不同，拍摄方式和深度距离计算方法也不同，但共同点是利用了摄像机与光源之间的结构关系。\n在基本的光条法中，使用单个的光平面依次（移动或旋转）照射景物各部分，每次使景物上仅出现一个光条且仅让光条部分被检测到，每照射一次就会得到一张二维实体图，再通过摄像机视线与光平面的交点，就可以得到光条上可见图像点所对应的空间点第三维信息。\n,将代入，Z可表示为,其中成像高度包含了3-D深度信息，或者说深度是成像高度的函数。\n结构光成像不仅能给出空间点的距离Z，也能给出沿Y方向的物体厚度，这时可借助从摄像机顶部向下所观察到的yz平面上的成像金银珠宝产业，其中w为成像宽度：,式中镜头中心到W点在Z轴垂直投影的距离：,而,就可得到。"}
