{"content2":"微软在上月宣布组建自己的 AI 研究小组。该小组汇集了超过 5000 名计算机科学家和工程师，加上微软内部研究部门，将共同挖掘 AI 技术。与此同时，亚马逊，Facebook，Google，IBM 还有微软联合宣布成立一个非盈利组织「人工智能合作伙伴」。该组织将致力于推进人工智能研究，树立开发新的人工智能技术准则，以及加强公众对人工智能的认识。而巨头们也纷纷拿出了自己的看家本领，Apple 的 Siri 利用自然语言处理来识别语音命令；Facebook 的深度学习面部识别算法能够快速准确地识别出人脸；Google 的「大脑」可能更为聪明，而且能够安装在数百万安卓系统的设备上。而隐藏在 CRM 领域的对手之一 Salesforce 也声称推出了一款全新的人工智能平台。还有 Amazon、Netflix 和 Spotify 都在强调使用机器学习了解如何与客户建立联系。最近的人工智能领域如此炙手可热，就连微软的首席执行官纳德拉也提到，「将 AI 覆盖到所有领域，是因为微软想要实现「AI 技术民主化」，从而解决全球最紧迫的挑战。」据悉，微软将从以下四个细分方向实现「AI 技术民主化」：Agents. Harness AI to fundamentally change human and computer interaction through agents such as Microsoft』s digital personal assistant Cortana1、助手。利用 AI 从根本上改变人机交互过程，如微软的数字个人助理 Cortana。Applications. Infuse every application, from the photo app on people』s phones to Skype and Office 365, with intelligence2、应用平台。从移动端的照片 app 到 Skype，再到 Office365，每一个应用平台融入了 AI 技术。Services. Make these same intelligent capabilities that are infused in Microsoft』s apps—cognitive capabilities such as vision and speech, and machine analytics—available to every application developer in the world3、服务。让全球每位应用开发者都能获取同样的 AI 技术支持。如微软 app 中视觉与语音识别能力，机器分析能力。Infrastructure. Build the world』s most powerful AI supercomputer with Azure and make it available to anyone, to enable people and organizations to harness its power4、基础架构。以 Azure 云为平台，构建强大的 AI 超级计算机，为企业和个人提供该项服务。那么，微软近期推出的几款人工智能产品看似「姗姗来迟」，但在 AI 领域的重量可不能小视，那么，微软在如何布局 AI 呢？其旗下几大产品又都与 AI 有着怎样的关系？1、推出人工智能版 Dynamics365提升销售转化率，更好地理解客户行为，是如今移动、社交、云三者融合时代的大背景下企业需要具备的重要能力。过去几周，CRM 领域频频传来人工智能利好的消息。如今，微软也向世人透露：在下月 1 日，将推出人工智能版 Dynamics365，为销售人员提供云端商务应用解决方案。该款产品将 ERP 与 CRM 进行整合，打造成为一个单一的云端解决方案。此次产品的推出主要针对的就是 CRM 领域占主导地位的 Salesforce，而此前不久，Salesforce 刚刚推出了一款名为「爱因斯坦」的人工智能云平台，能够为企业客户提供相应服务。Microsoft has built in a couple of intelligence features into the release designed specifically for sales and service personnel. First, there is Customer Insights, a stand-alone cloud service, which enables users to bring in a variety of internal and external data sources. Companies can integrate all of this data with internal metrics (KPIs) to drive automated actions based on the data. The solution includes partner data from the likes of Facebook and Trip Advisor (proving you don』t need to own an external data source to take advantage of it).微软推出的 Dynamics365 能够为销售人员提供以下几类服务：一是客户洞察（Customer Insights），一款单机云服务，帮助用户收集各类内外部数据信息。企业能够将所有数据与内部指标（KPIs）进行集成，基于数据进行自动化行为的驱动。这套解决方案还包括了合作伙伴如 Facebook 和 Trip Advisor 上产生的大量数据，不过，这也说明了用户无需借外部获取数据。It』s been designed as a stand-alone service that can work with any of the Dynamics 365 CRM components—sales, customer service or field service—and can also work with any external CRM tool with open APIs. This last point is particularly telling because it』s giving customers who might not be using Dynamics 365 (but are using other Microsoft tools like Outlook) access to this feature.一方面，单机服务能够与 Dynamics365 CRM 的组成部件进行很好地兼容，包括销售、客服或者现场服务；另一方面，还能与任何一个带有开放 API 接口的外部 CRM 工具进行兼容。此外，单机服务还能为并未使用 Dynamics365，而是微软其他工具如 Outlook 的客户，提供该项服务的渠道。The second piece is called Relationship Insights, which as the name suggests gives sales people information about the status of their customer relationships at any given moment. It』s built on the on the Cortana Intelligence Suite, which Microsoft introduced in 2015 and uses tools like sentiment analysis to check on the likelihood of the deal closing and the next best action to take.二是关系洞察（Relationship Insights），为销售人员即时提供客户关系信息。该服务基于人工智能助手小娜的平台进行提供。这个智能助手于去年在全球推出，通过情感分析检测交易结束的可能性，并判断下一步最佳实践方案。For now, know that Microsoft has consolidated its artificial intelligence tools into a single, coherent division and just about every vendor—not just those selling CRM—is trying to build some level of intelligence into its products. Dynamics 365 is just the latest manifestation.总的来说，微软已将人工智能工具嵌入一个单独连贯的区域，而且不只是 CRM 领域的供应商，基本上每个供应商都在试图将某种程度的智能技术嵌入到其产品中。2、Office365 的个人分析服务在上月举办的 Ignite 年度大会上，微软展示了 Office365 新的 AI 功能，覆盖了为企业提供的核心产品。New smart features coming to Office 365 include Tap in Word and Outlook, which aims to help workers reuse content already to be found in corporate documents for new documents and emails.Office365 本身是一款文档协作工具，但是经过 AI 升级后的 Office365 具有了以下一些特点：Tap in Word 和 Outlook，旨在帮助办公人员将公司文档中现有的内容再次用于新的文件和电邮。Another is Quickstarter for PowerPoint and Sway, offering a faster way to integrate text and images into presentations. Excel meanwhile will gain a Bing Maps feature to visualize geographic data.另外，Quickstarter for PowerPoint 和 Sway，能够更为快速地将文本与图像集成到同一个演示文档中。同时，Excel 表格也添加了 Bing 地图功能，将地理数据进行可视化。Office 365 is also gaining the MyAnalytics personal analytics service, formerly known as Delve Analytics, which Microsoft gained when it acquired VoloMetrix last year.同样，Office365 还添加了 MyAnalytics 个人分析服务（之前被称为 Delve Analytics），该服务主要是通过去年对 VoloMetrix 的收购而来。MyAnalytics provides a visualized breakdown of personal performance at work, offering a snapshot of 'meeting hours', 'email hours', 'focus hours', and 'after hours'. Users can also query the percentage of email read by recipients and what time email was read to help workers optimize the timing of email.MyAnalytics 将个人工作表现进行视觉化细分，如将「会议时间」、「电邮时间」、「关注时间」等进行快照处理。用户还能查询用户电邮的读取情况，从而帮助工作人员优化发送电邮的时间。The main goal of MyAnalytics is to help workers manage how they personally spend their time at work. However, it also has a social component that, for example, shows response times to colleagues as well as customers. Users can drill down into each category to discover how much time was spent multi-tasking and assess whether it was time well spent.MyAnalytics 主要帮助员工有效管理个人工作时间。不过，这也包括社交时间，如能够显示出对同事和客户的响应时间。通过仔细研究每项功能，用户能够发现在进行多任务时的耗时，评估时间的利用是否妥当。3、Azure 云融入 AI 技术除了应用程序和服务上进行人工智能技术的嵌入，微软还悄悄在其 Azure 云服务上进行了一定程度 AI 技术的融入。在过去的两年间，微软已在全球五大洲 15 个国家进行了大规模数据中心的部署。前不久，微软在爱尔兰都柏林的发布会称要将 Azure 云打造成为世界上第一款人工智能超计算机（下称「超算」）。\"Ultimately the cloud is about powering the next generation of applications,\" he said. \"It is always the next generation applications that have driven infrastructure and when we look at this current generation of applications that people are building, the thing that is going to define these applications, that characterises these applications, is machine learning and artificial intelligence. Therefore we are building out Azure as the first AI supercomputer.\"纳德拉认为，「云计算将最终主导下一代应用，而下一代应用将推动基础设施建设。目前来看，定义和塑造这些应用的是机器学习和人工智能。因此，我们正力图将 Azure 云打造成为第一款 AI 超级计算机。」「We made a major investment in PGAs [programmable gate arrays],」said Microsoft』 Research engineer Doug Burger at the company』s Ignite conference in Atlanta this week.「PGAs are programmable hardware. You get the efficiency of hardware, but you also get the flexibility to change your functionality on the fly. This new architecture that we built effectively embeds an FPGA-based AI super computer into our old, hyper-scaled cloud. You get compute, scale and efficiency. It will change what is possible for AI.」「我们目前在可编程门阵列 PGAs 上做了大量投入」，微软研究部工程师 Doug Burger 提到，「PGAs 是一款可编程硬件。这样，你能高效利用硬件，并能灵活改变运行中的功能。这种新的基础架构是将基于 FPGA 的人工智能超算，有效嵌入到旧有的超规模云端，从而在计算和扩展能力以及效率进行提升。这将改变人工智能的应用。」「We now have FPGA support across every compute port of Azure,」said Microsoft CEO Satya Nadella.「It means we have the ability through the magic of the fabric of the network to distribute you machine learnings, your deep neural nets to all of the silicon that is available so you get back performance, that scale.」纳德拉还提到，「现在，FPGA 可以支持 Azure 云平台的每个运算过程，这意味着我们有能力通过构造网络，将机器学习等深层神经网分发给所有的内部芯片，通过 BPS 衡量计算机的性能。」微软并不是在打无把握之仗微软高层人士之一 Qi Lu 认为，想要赢得这场没有硝烟的战争，手中还是得具备五个核心要素：Qi Lu is happy to make the case for Microsoft』s competitive advantage. Lu is one of the dozen people on Nadella』s senior leadership team, overseeing the company』s applications and service groups.But to win, Lu says, a company needs five \"key assets.\" The first is a \"conversation canvas\"—a place where people are doing lots of talking and texting. Microsoft has Office, Outlook, Skype, and Cortana. The second is that AI \"brain\"—a sophisticated mental model of the world. Microsoft says its own AI efforts date back nearly 20 years. The third is access to a social graph—people』s activity on the internet often involves their friends and coworkers. Not coincidentally, a few days after I met Lu, Microsoft announced it would spend $26.2 billion to acquire LinkedIn, and its 433 million registered users.一是「会话区域」，也就是人们能够进行大量交谈和信息发送的地方。比如，微软现在有了 Office，Outlook，Skype 和 Cortana。二是 AI「头脑」，能够面对周围世界进行复杂的思维模式。三是能够获取社交图谱，因为人类在互联网上的活动往往会与朋友和同事有交集。正因如此，前一段时间，微软打败其中一个强大的竞争对手 Salesforce，以 262 亿美元收购 LinkedIn，目的是为了获取其大量的注册用户资源。四是为人工智能研发而创建的平台。微软有 Windows，Xbox 等一系列设备。五是拥有一批强大的开发团队，并且该团队愿意为此项事业献身。毫无疑问，微软将目光转向人工智能，与强大对手争抢资源，打得并不是无把握之仗。目前 AI 技术也有一定的局限性While AI research has been going on for more than 60 years, the technology is now at an inflection point, the panelists agreed. That has happened because of three things: faster, more powerful computers; critical computer science advances, mainly statistical machine learning and deep learning techniques; and the massive information available due to sensors and the Internet of Things.尽管 AI 研究已经持续了近 60 年，但是该项技术目前仍是处于转折期。这主要基于三类事物的改变：更快更强大的计算机；关键领域计算机科学的进步，即机器学习和深度学习技术；以及基于传感器和物联网环境下可获取到的大量信息。Teaching machines common sense, said LeCun. He gave the problem of text translation as an example. The technology is far from perfect, he said, because machines don』t have a deep understanding of the text they are translating.「Most of what we [humans] learned, we learned in the first few years of life just by observing the world,」said LeCun.「And we don』t know how to do that with machines, how to teach them to learn by observing the world. This is one mountain we need to climb, but we don』t know how many mountains are behind it.」局限一：以文字翻译为例，文字翻译技术目前还远远不够完美，因为机器对所翻译出来的文字内容没有深层次的感知能力。Facebook AI 技术负责人 Yann LeCun 曾提到，「人类所习得的大多数知识主要通过早年观察周围世界获取的。完全不知道如何改造机器，教会机器通过观察世界进行学习。」Technical challenges aside, another massive mountain to climb, says Banavar, is how to deploy AI in the real world. That would have to involve the point-of-view of not just tech developers, but also users and policy-makers.「In environments where machines and humans are interacting there』s got to be an element of trust,」he said.「That trust building will take time.」局限二：除了一个又一个的技术挑战需要攻克，如何在现实世界对人工智能进行部署同样也是一个问题。这必然会受到技术开发人员、用户甚至是政治决策者的影响。「在人机交互的环境中，必然存在信任的问题。这种信任的建立需要一定的时间。」Banavar 提到。Deploying AI systems in the real world will also include other humanistic challenges, said Jeannette Wing, corporate vice president at Microsoft Research. Her comments stemmed from the fiasco earlier this year with Microsoft』s AI chatbot Tae, which got hacked and learned to become racist and abusive, forcing the company to take it down within 24 hours. This was in the U.S. A similar chatbot in use in China since 2014 has been massively successful.局限三：「在真实世界部署 AI 技术，同样还涉及到其他方面人性的挑战。」微软研究小组负责人 Jeannette Wing 提到。她提起这个话题的主要原因在于，今年上半年微软开发出的一款名叫 Tae 的人工智能聊天机器人，因受到黑客攻击，结果经过学习之后言语变得十分具有攻击性，这不得不迫使微软公司在 24 小时之内将其下架。而相对来说，该款产品引进中国之后却获得了极大的成功。总之，人类对人工智能的认知和开发还是处于最初级阶段。或许，在未来人类看到一款带有智能属性的机器人，能够简化软件运行的复杂程度，并引导用户获取问题的解决方案。尽管目前这个目标还未实现，但心中抱有实现生产力的提升的想法不是不可能。（本文由国外媒体综合编译）作者：T客汇 杨丽网站：www.tikehui.com"}
