{"content2":"1. 数学\n我们所说的图像处理实际上就是数字图像处理，是把真实世界中的连续三维随机信号投影到传感器的二维平面上，采样并量化后得到二维矩阵。数字图像处理就是二维矩阵的处理，而从二维图像中恢复出三维场景就是计算机视觉的主要任务之一。这里面就涉及到了图像处理所涉及到的三个重要属性：连续性，二维矩阵，随机性。所对应的数学知识是高等数学（微积分），线性代数（矩阵论），概率论和随机过程。这三门课也是考研的三门课，构成了图像处理和计算机视觉最基础的数学基础。如果想要更进一步，就要到网上搜搜林达华推荐的数学数目了。\n2. 信号处理\n图像处理其实就是二维和三维信号处理，而处理的信号又有一定的随机性，因此经典信号处理和随机信号处理都是图像处理和计算机视觉中必备的理论基础。\n2.1经典信号处理\n信号与系统(第2版)  Alan V.Oppenheim等著 刘树棠译\n离散时间信号处理(第2版)  A.V.奥本海姆等著 刘树棠译\n数字信号处理:理论算法与实现胡广书 (编者)\n2.2随机信号处理\n现代信号处理 张贤达著\n统计信号处理基础:估计与检测理论Steven M.Kay等著 罗鹏飞等译\n自适应滤波器原理(第4版) Simon Haykin著 郑宝玉等译\n2.3 小波变换\n信号处理的小波导引:稀疏方法(原书第3版)  tephane Malla著, 戴道清等译\n2.4 信息论\n信息论基础(原书第2版) Thomas M.Cover等著 阮吉寿等译\n3. 模式识别\nPattern Recognition and Machine Learning Bishop, Christopher M. Springer\n模式识别(英文版)(第4版) 西奥多里德斯著\nPattern Classification (2nd Edition) Richard O. Duda等著\nStatistical Pattern Recognition, 3rd Edition Andrew R. Webb等著\n模式识别(第3版) 张学工著\n4. 图像处理与计算机视觉的书籍推荐\n图像处理，分析与机器视觉 第三版Sonka等著 艾海舟等译\nImage Processing, Analysis and Machine Vision\n这本书是图像处理与计算机视觉里面比较全的一本书了，几乎涵盖了图像视觉领域的各个方面。中文版的个人感觉也还可以，值得一看。\n数字图像处理 第三版 冈萨雷斯等著\nDigital Image Processing\n数字图像处理永远的经典，现在已经出到了第三版，相当给力。我的导师曾经说过，这本书写的很优美，对写英文论文也很有帮助，建议购买英文版的。\n计算机视觉：理论与算法 RichardSzeliski著\nComputer Vision: Theory and Algorithm\n微软的Szeliski写的一本最新的计算机视觉著作。内容非常丰富，尤其包括了作者的研究兴趣，比如一般的书里面都没有的Image Stitching和Image Matting等。这也从另一个侧面说明这本书的通用性不如Sonka的那本。不过作者开放了这本书的电子版，可以有选择性的阅读。\nMultiple View Geometry in Computer Vision 第二版Harley等著\n引用达一万多次的经典书籍了。第二版到处都有电子版的。第一版曾出过中文版的，后来绝版了。网上也可以找到电子版。\n计算机视觉：一种现代方法 DAForsyth等著\nComputer Vision: A Modern Approach\nMIT的经典教材。虽然已经过去十年了，还是值得一读。第二版已经在今年（2012年）出来了，在iask上可以找到非常清晰的版本，将近800页，补充了很多内容。期待影印版。\nMachine vision: theory,algorithms, practicalities 第三版 Davies著\n为数不多的英国人写的书，偏向于工业。\n数字图像处理 第四版 Pratt著\nDigital Image Processing\n写作风格独树一帜，也是图像处理领域很不错的一本书。网上也可以找到非常清晰的电子版。\n5 小结\n罗嗦了这么多，实际上就是几个建议：\n（1）基础书千万不可以扔，也不能低价处理给同学或者师弟师妹。不然到时候还得一本本从书店再买回来的。钱是一方面的问题，对着全新的书看完全没有看自己当年上过的课本有感觉。\n（2）遇到有相关的课，果断选修或者蹭之，比如随机过程，小波分析，模式识别，机器学习，数据挖掘，现代信号处理甚至泛函。多一些理论积累对将来科研和工作都有好处。\n（3）资金允许的话可以多囤一些经典的书，有的时候从牙缝里面省一点都可以买一本好书。不过千万不要像我一样只囤不看。"}
