{"content2":"计算机视觉与模式识别代码合集第二版threeTopicNameReferencecodeOptical FlowHorn and Schunck's Optical FlowcodeOptical FlowBlack and Anandan's Optical FlowcodePose EstimationTraining Deformable Models for LocalizationRamanan, D. \"Learning to Parse Images of Articulated Bodies.\"NIPS 2006codePose EstimationCalvin Upper-Body DetectorE. Marcin, F. Vittorio, Better Appearance Models for Pictorial Structures, BMVC 2009codePose EstimationArticulated Pose Estimation using Flexible Mixtures of PartsY. Yang, D. Ramanan, Articulated Pose Estimation using Flexible Mixtures of Parts, CVPR 2011codePose EstimationEstimating Human Pose from Occluded ImagesJ.-B. Huang and M.-H. Yang, Estimating Human Pose from Occluded Images, ACCV 2009codeSaliency DetectionSaliency detection: A spectral residual approachX. Hou and L. Zhang. Saliency detection: A spectral residual approach. CVPR, 2007codeSaliency DetectionSaliency Using Natural statisticsL. Zhang, M. Tong, T. Marks, H. Shan, and G. Cottrell. Sun: A bayesian framework for saliency using natural statistics. Journal of Vision, 2008codeSaliency DetectionAttention via Information MaximizationN. Bruce and J. Tsotsos. Saliency based on information maximization. In NIPS, 2005codeSaliency DetectionItti, Koch, and Niebur' saliency detectionL. Itti, C. Koch, and E. Niebur. A model of saliency-based visual attention for rapid scene analysis. PAMI, 1998codeSaliency DetectionFrequency-tuned salient region detectionR. Achanta, S. Hemami, F. Estrada, and S. Susstrunk.Frequency-tuned salient region detection. In CVPR, 2009codeSaliency DetectionSaliency-based video segmentationK. Fukuchi, K. Miyazato, A. Kimura, S. Takagi and J. Yamato, Saliency-based video segmentation with graph cuts and sequentially updated priors, ICME 2009codeSaliency DetectionSegmenting salient objects from images and videosE. Rahtu, J. Kannala, M. Salo, and J. Heikkila. Segmenting salient objects from images and videos. CVPR, 2010codeSaliency DetectionGraph-based visual saliencyJ. Harel, C. Koch, and P. Perona. Graph-based visual saliency.NIPS, 2007codeSaliency DetectionLearning to Predict Where Humans LookT. Judd and K. Ehinger and F. Durand and A. Torralba, Learning to Predict Where Humans Look, ICCV, 2009codeSaliency DetectionSpectrum Scale Space based Visual SaliencyJ Li, M D. Levine, X An and H. He, Saliency Detection Based on Frequency and Spatial Domain Analyses, BMVC 2011codeSaliency DetectionDiscriminant Saliency for Visual Recognition from Cluttered ScenesD. Gao and N. Vasconcelos, Discriminant Saliency for Visual Recognition from Cluttered Scenes, NIPS, 2004codeSaliency DetectionContext-aware saliency detectionS. Goferman, L. Zelnik-Manor, and A. Tal. Context-aware saliency detection. In CVPR, 2010.codeSaliency DetectionSaliency detection using maximum symmetric surroundR. Achanta and S. Susstrunk. Saliency detection using maximum symmetric surround. In ICIP, 2010codeSaliency DetectionGlobal Contrast based Salient Region DetectionM.-M. Cheng, G.-X. Zhang, NJ Mitra, X. Huang, S.-M. Hu. Global Contrast based Salient Region Detection. CVPR, 2011codeSaliency DetectionLearning Hierarchical Image Representation with Sparsity, Saliency and LocalityJ. Yang and M.-H. Yang, Learning Hierarchical Image Representation with Sparsity, Saliency and Locality, BMVC 2011Sparse RepresentationCentralized Sparse Representation for Image RestorationW. Dong, L. Zhang and G. Shi, “Centralized Sparse Representation for Image Restoration,” ICCV 2011codeSparse RepresentationEfficient sparse coding algorithmsH. Lee, A. Battle, R. Rajat and AY Ng, Efficient sparse coding algorithms, NIPS 2007codeSparse RepresentationFisher Discrimination Dictionary Learning for Sparse RepresentationM. Yang, L. Zhang, X. Feng and D. Zhang, Fisher Discrimination Dictionary Learning for Sparse Representation, ICCV 2011codeSparse RepresentationRobust Sparse Coding for Face RecognitionM. Yang, L. Zhang, J. Yang and D. Zhang, “Robust Sparse Coding for Face Recognition,” CVPR 2011codeSparse RepresentationSparse and Redundant Representations: From Theory to Applications in Signal and Image ProcessingM. Elad, Sparse and Redundant Representations: From Theory to Applications in Signal and Image ProcessingcodeSparse RepresentationSPArse Modeling SoftwareJ. Mairal, F. Bach, J. Ponce and G. Sapiro. Online Learning for Matrix Factorization and Sparse Coding, JMLR 2010codeSparse RepresentationSparse coding simulation softwareOlshausen BA, Field DJ, \"Emergence of Simple-Cell Receptive Field Properties by Learning a Sparse Code for Natural Images\", Nature 1996codeSparse RepresentationA Linear Subspace Learning Approach via Sparse CodingL. Zhang, P. Zhu, Q. Hu and D. Zhang, “A Linear Subspace Learning Approach via Sparse Coding,” ICCV 2011codeStereoConstant-Space Belief PropagationQ. Yang, L. Wang, and N. Ahuja, A Constant-Space Belief Propagation Algorithm for Stereo Matching, CVPR 2010codeStereoStereo EvaluationD. Scharstein and R. Szeliski. A taxonomy and evaluation of dense two-frame stereo correspondence algorithms, IJCV 2001codeImage Denoising andStereo MatchingEfficient Belief Propagation for Early VisionPF Felzenszwalb and DP Huttenlocher, Efficient Belief Propagation for Early Vision, IJCV, 2006codeStructure from motionNonrigid Structure From Motion in Trajectory SpacecodeStructure from motionlibmvcodeStructure from motionBundlerN. Snavely, S M. Seitz, R Szeliski. Photo Tourism: Exploring image collections in 3D. SIGGRAPH 2006codeStructure from motionFIT3DcodeStructure from motionVisualSFM : A Visual Structure from Motion SystemcodeStructure from motionOpenSourcePhotogrammetrycodeStructure from motionStructure and Motion Toolkit in MatlabcodeStructure from motionStructure from Motion toolbox for Matlab by Vincent RabaudcodeSubspace LearningGeneralized Principal Component AnalysisR. Vidal, Y. Ma and S. Sastry. Generalized Principal Component Analysis (GPCA), CVPR 2003codeText RecognitionText recognition in the wildK. Wang, B. Babenko, and S. Belongie, End-to-end Scene Text Recognition, ICCV 2011codeText RecognitionNeocognitron for handwritten digit recognitionK. Fukushima: \"Neocognitron for handwritten digit recognition\", Neurocomputing, 2003codeTexture SynthesisImage Quilting for Texture Synthesis and TransferAA Efros and WT Freeman, Image Quilting for Texture Synthesis and Transfer, SIGGRAPH 2001codeTopicNameReferencecodeVisual TrackingGPU Implementation of Kanade-Lucas-Tomasi Feature TrackerS. N Sinha, J.-M. Frahm, M. Pollefeys and Y. Genc, Feature Tracking and Matching in Video Using Programmable Graphics Hardware, MVA, 2007codeVisual TrackingSuperpixel TrackingS. Wang, H. Lu, F. Yang, and M.-H. Yang, Superpixel Tracking, ICCV 2011codeVisual TrackingTracking with Online Multiple Instance LearningB. Babenko, M.-H. Yang, S. Belongie, Visual Tracking with Online Multiple Instance Learning, PAMI 2011codeVisual TrackingMotion Tracking in Image SequencesC. Stauffer and WEL Grimson. Learning patterns of activity using real-time tracking, PAMI, 2000codeVisual TrackingL1 TrackingX. Mei and H. Ling, Robust Visual Tracking using L1 Minimization, ICCV, 2009codeVisual TrackingOnline Discriminative Object Tracking with Local Sparse RepresentationQ. Wang, F. Chen, W. Xu, and M.-H. Yang, Online Discriminative Object Tracking with Local Sparse Representation, WACV 2012codeVisual TrackingKLT: An Implementation of the Kanade-Lucas-Tomasi Feature TrackerBD Lucas and T. Kanade. An Iterative Image Registration Technique with an Application to Stereo Vision. IJCAI, 1981codeVisual TrackingOnline boosting trackersH. Grabner, and H. Bischof, On-line Boosting and Vision, CVPR, 2006codeVisual TrackingVisual Tracking DecompositionJ Kwon and KM Lee, Visual Tracking Decomposition, CVPR 2010codeVisual TrackingGlobally-Optimal Greedy Algorithms for Tracking a Variable Number of ObjectsH. Pirsiavash, D. Ramanan, C. Fowlkes. \"Globally-Optimal Greedy Algorithms for Tracking a Variable Number of Objects, CVPR 2011codeVisual TrackingLucas-Kanade affine template trackingS. Baker and I. Matthews, Lucas-Kanade 20 Years On: A Unifying Framework, IJCV 2002codeVisual TrackingObject TrackingA. Yilmaz, O. Javed and M. Shah, Object Tracking: A Survey, ACM Journal of Computing Surveys, Vol. 38, No. 4, 2006codeVisual TrackingVisual Tracking with Histograms and Articulating BlocksSM Shshed Nejhum, J. Ho, and M.-H.Yang, Visual Tracking with Histograms and Articulating Blocks, CVPR 2008codeVisual TrackingTracking using Pixel-Wise PosteriorsC. Bibby and I. Reid, Tracking using Pixel-Wise Posteriors, ECCV 2008codeVisual TrackingIncremental Learning for Robust Visual TrackingD. Ross, J. Lim, R.-S. Lin, M.-H. Yang, Incremental Learning for Robust Visual Tracking, IJCV 2007codeVisual TrackingParticle Filter Object Trackingcode一共248篇。one：47、two：45、three： 49、four： 47、five： 44、six： 16。"}
