{"content2":"人工智能和机器学习以及不断增加的数据量正在改变当前的商业和社会格局。这些领域中出现了许多需要CIO注意的主题和问题。\n日前，O’Reilly 公司在伦敦Strata举办了一个为期数天的数据会议，与会者为此更好地了解大数据、机器学习(ML)和人工智能的发展方向。这些新兴技术在过去5年中发展迅速，而新技术、流程和应用程序改变了组织管理数据的方式。\n此次数据会议提供了一个很好的技术发展晴雨表，与会者可以了解最新技术在大数据处理方面的作用，以及开发商和用户的关注点。此次大会还阐明了影响大数据、机器学习和人工智能未来发展的8个因素。\n1. 5G将刺激机器学习的增长，并产生新的应用和服务\nO’Reilly公司首席数据科学家和会议组织者Ben Lorica在会上表示，他认为5G技术的带宽和灵活性增加以及边缘计算将成为关键的推动因素。他指出，中国在这项技术方面成为全球领先的力量，但许多公司仍在为他们正在进行的5G投资制定商业模式。\n2.改变数据科学家的技能组合\n谷歌云首席决策科学家Cassie Kozyrkov在演讲中指出，随着机器学习工具的用户体验得到改善，数据科学家所需的技能将不再专注于专业化，而是更加专注跨孤岛工作的能力，并更加集成到业务方面。\n3.线上和线下世界正在融合\n阿里巴巴电子商务集团和亚马逊正在尝试推出线下实体商店，而实体商店仍在适应新的网络世界。电子商务团体的线下活动对于实体零售商来说是一种竞争性举动，而实体零售商的在线投资则具有防御性。在这一切全面展开之前，还有很长的路要走，但亚马逊和阿里巴巴等公司在大规模管理数据方面的专业知识为他们提供了关键优势。\n4. 内部数据平台正成为增长和创新的关键\nLyft公司和BMW公司的数据科学家在会上的演讲表明，将数据平台置于新产品开发和业务流程管理的中心可以推动创新。虽然对于像Lyft这样的数字原生公司来说，这可能是很自然的事情，但随着数据生成传感器嵌入到产品中，传统的工业公司也不得不参与其中。\n5.开放数据需要像开源软件一样认真对待\n众所周知，开源软件背后是大数据和机器学习产品和服务的兴起。开放源码的商业和技术案例的重要性多年前就得到了证实。然而，人们对开放数据对创新的重要性的关注却少之又少。\n全球最大的开放式公司数据库提供商OpenCorporations公司联合创始人兼首席执行官Chris Taggart强调了企业在依赖专有数据集时遇到的问题，指出这些数据源可能是粗略的，并且元数据不会在产品间共享。开放数据更透明，不会将企业锁定在昂贵的商业合同中，而这些合同对于企业来说很难放弃。\n6.捕获和管理实时数据的重要性\n虽然人工智能和机器学习项目并不总是需要实时或接近实时的数据，但构建能够处理数据的系统的能力可能是一种具有价值的竞争优势形式。随着数据驱动的决策越来越多地嵌入到组织中，竞争优势有时会转移到那些能够对事件作出更快响应的组织中。亚马逊网络服务在这方面的规模和广度表明，实现这一点的工具变得越来越容易和便宜。\n7. 法律和道德问题开始改变企业的创新方式\n牛津大学Sandra Wachter博士在会上的演讲强调了一个问题，而在未来一两年内，这个问题可能会得到更多讨论。她指出，许多公司现在意识到他们有义务保护个人数据，因为GDPR法规等相关法律已经生效。然而，一个讨论较少的问题也是监管机构仍在努力解决的问题是，推理以及由嵌入式算法需要根据其处理的数据做出的决定。\n至少在欧洲，用户有权查看持有的数据，并在不同程度上纠正或删除。但是，由于信用检查和健康保险等领域的数据，企业可能会自动对用户做出假设，因此用户没有相同的补救措施。\n8.中小企业如何在大数据和算法决策时代开展竞争\n最后，人们需要思考的一个问题是，没有互联网巨头或全球快速消费品公司的海量数据集的中小公司如何能够在大数据和算法决策时代开展竞争。大公司利用网络服务的网络效应巩固其领先地位，这对于良性创新圈是一个风险，或许人们已经看到了这种风险。\n然而，正如Unravel Data Systems联合创始人兼首席技术官Shivnath Babu所指出的那样，互联网和应用程序经济仍然能够允许中小公司利用其应用程序和在线活动中的数据，并对市场产生影响。也许这一点以及来自公共数据源的开放数据的兴起，将为新一代初创企业改变世界提供基础，就像谷歌、Facebook、亚马逊公司在过去20年所做的那样。\n如果你恰好在学大数据，想要通过本篇文章就学好大数据，我建议你可以把页面关闭掉，大数据是入门学容易，达到高薪是绝对需要系统学习的，当然如果你想着通过大数据提高你的收入，可以详细阅读我推荐的文章\n推荐阅读文章\n大数据时代需要了解的六件事\n大数据框架hadoop十大误解\n年薪30K的大数据开发工程师的工作经验总结？\n大数据框架hadoop我们遇见过的问题"}
