{"content2":"悦动智能 | 微信公众号ID：aibbtcom\n现如今，人工智能已经被炒的非常火热，似乎不管是不是科技圈的人士，都要在嘴边聊上几句人工智能，以显示自己多么与时俱进。\n人工智能的定义是让机器实现原来只有人类才能完成的任务，其核心是算法。\n例如下图所示就是让机器模拟人各种能力的人工智能领域示意图：\n当然一方面人工智能的确是未来的方向，而另一方面则是因为人工智能有可能是科技圈中的下一个黑天鹅。说不定什么时候，一只独角兽就会从中诞生。\n但在此之前，一定要正确的认清什么才是真正的人工智能。\n伪人工智能横行\n现在大多数人工智能都属于伪人工智能。为什么这么说，可以从以下两个方面来解释。\n第一，人工智能不是一下就能做出来的，需要时间以及实验的积累。\n而做出人工智能的这些人才也是一样，他们需要切实的接触到真正的人工智能当中，不过这样的人才在全世界也就寥寥几百个。\n但是好像在一瞬间，在中国就有几万个人工智能方面的人才被选拔了出来，可想而知这样的人才是真正的人工智能专家吗？\n这些人才往往被大公司冠以年薪30万或50万疯抢，虽然里面的确有很多优秀的人才，但是这样未免显得太过着急。从人才培养角度来看，人工智能领域还存在着大量的泡沫。\n第二，许多项目只不过是换了个‘马甲’。\n许多创业公司喜欢为自己的项目贴上一个标签，这样的话不但可以吸引眼球，更能得到投资人的青睐。\n虽然不能说这种做法是错误的，但这显然也不是真正的人工智能，甚至会误导其他人对于人工智能的认知。\n比如许多项目在贴上人工智能标签之前非常简单，只是一些如同机器人学习，或者算法研究之类的项目，如今摇身一变全都成为了人工智能。\n什么才是真正的人工智能？\n我们既不是专家，也不是专门研究这种领域的学者，有没有简单的方法直接辨别什么是人工智能，什么是伪人工智能？\n答案是有的。\n举一个简单的例子，之前人们也尝试教计算机下国际象棋。计算机经过学习之后，与人们依然互有胜负，在最终完全战胜人类的时候，时间已经过去了10年。\n而谷歌的AlphaGo，从什么都不会到围棋中不可战胜的存在只用了短短一年的时间。\n由此可以看出，真正的人工智能体现在其卓越的学习能力。\n如果你隔一段时间，大概3个月左右去看一个算法的进步，比如面部识别，如语音识别，如果该算法进步只是代数级，没有达到指数级，那么这种算法可能更多的是机器学习，还未达到人工智能水平。\n既然已经辨别了什么是真正的人工智能，那么对于人工智能而言，什么才是最重要的。\n可能有些人会说算法，有些人会说设备，有些人会说编程技术。虽然它们也是构成人工智能中重要的一环，但是这些都不是最重要的。\n对于真正的人工智能而言，最重要的永远是大数据，只有拥有完整的数据，人工智能才能真正的发展起来。就像是一把宝刀，需要有一块好的磨刀石才能让它更加锐利，而大数据恰好就是这块最好的磨刀石。\n就像是谷歌的AlphaGo，有人说为什么AlphaGo不去下象棋，而是只在围棋领域中称雄呢。\nAlphaGo的专家则表示，不是他们不想这么做，而是无法这么做。因为在围棋中，日本人一直以来有保存棋谱的习惯，在每个棋谱上都标注了什么是第1手，什么是第100手，这样很容易被AlphaGo学习。\n但是对于象棋来说，自古以来大多数都是残局。虽说残局也很精彩，但是对于AlphaGo来说，它不知道残局形成的原因，对之前的步骤一无所知，这样就会对它的认知造成障碍。\n这也说明，完整的数据对于人工智能多么重要。任何抛开数据谈人工智能的，全都是耍流氓。\n人工智能中的独角兽\n目前，中国的大部分数据全都被BAT所掌握着，国外则是Facebook、Google、亚马逊之类的企业。对于创业者而言，想要打破数据的垄断具有相当大的挑战，但也不是没有机会。\n比如说医疗数据，BAT就还没有形成垄断。金融方面数据，更多的掌握在金融公司手中，这些互联网企业也没有。\n在这两个领域，不管你的技术水平如何，至少在数据方面是在同一起跑线上，这对于创业者或后进入的公司是一个难得机遇。同时，下一个巨头也有可能在这两个领域诞生。\n就拿医疗来说，国外已经有许多家企业与医院达成协作，直接读取医院中的病例以及X光片或者CT片。\n医生一天看10张并且分析出症状都已经是非常有经验了，而人工智能，则可以在1个小时内看10万张，效率不可同日而语。\n对于医生而言，诊断病因需要基于自己的经验积累。但是对于人工智能来说这就太简单了，通过图像和最终诊断结果的闭环学习，人工智能很快就能对X光片或CT片进行病因分析。当然这一过程需要不断完善，才能提升正确性及智能化。\n在国外由于隐私保护非常严密，很多数据无法开放，因此无法做到大量数据录入。\n但是由于如今中国民众对于隐私保护还没有那么严格，因此中国企业还是有机会在这个领域中实现超越的。\n只要有了大数据，特定领域超越BAT也不是不可能的。\n所以说，数据才是人工智能中最重要的一环。\n原文地址：http://www.aibbt.com/a/29255.html"}
