{"content2":"先来介绍一下自己\n中南大学（不知名985双一流 A 类）大二计算机专业本科生，才学编程1年多一点。大一的时候搞了大半年 ACM，现在慢慢转向项目开发（在学习 JAVA 开发，U3D 和 C#），同时在学习机器学习、大数据等内容，混进了学校的图灵班。\n下面进入正题\n以后是读研还是直接工作？这个问题可能困扰了很多读计算机类的本科生。大一刚入学的时候，我的想法是不读研，之后直接去工作，为什么呢？我当时报计算机专业的时候想的是以后要做游戏开发，那读不读研完全是不重要了，搞好技术，自然就行。今年暑假的时候，去表哥的公司呆了一暑假，当时放弃了 ACM 暑假集训（相当于退队了，寒假开始可能会回去接着搞），虽然还是有些后悔，但是也有了蛮多收获，一个是见识稍微广了些，想的更远了，二是敢于去接触一些看起来很高大上的领域（如人工智能等）。开学后，写了些关于机器学习方面的程序，去听了一些学术研讨会，慢慢开始有了读研的想法，所以纠结了好一阵子，我觉的我纠结的更大一部分原因就是认识面小，不知道在 BAT 这些大公司里工作是什么一种感受，感觉只有出去实习几次，才能更好做出抉择。但这段时间跟一些大神级的前辈交流之后，想的是技术方面接着搞（下大功夫搞），学业方面还是稍微抓一抓。\n上面一段话讲的还是我这一年来的一些经历，下面就讲讲我的看法。一般来说，对于刚进入大一的同学来说，你们可能还没考虑过自己以后的发展路线，那么这时候可以边走边看，先把成绩搞起来（简单地说就是刷绩点），边学习边思考、规划未来，而不是想着以后是读研还是直接工作，这个问题等你们到了真正需要选择的那天再考虑，什么是真正需要选择的时候呢？就是你们既有保研名额，又有BAT的offer的时候，到这时候再考虑也不迟，这时候你们可以根据自己的兴趣来选，如果是对科研方面更感兴趣，当然是保研无疑了，但对开发更有兴趣，那直接工作可能会更好，毕竟读研是搞研究去了，开发方面的东西研究生学不到什么。表示有些后悔大一的时候直接把绩点丢了。对于大二大三的同学来说，目前成绩能拿到保研名额或是争取一下还是有希望拿到的，最好要拿到，多一个选择总没错。而对于保研大体上没戏的，如果你决定要考研，那自然没什么话讲，当然是去考了。那不准备考研的，自然就是选择直接工作了（除了那些现在还是成天浑浑噩噩的同学），那该怎么做？我没经历过，自然不太懂该怎么做，但我也听了许多在 BAT 等大公司工作的学长学姐的分享，我还是谈谈自己的看法吧。（以下看法对读研的同学来说也会适用）\n1.简历\n毫无疑问，有一份好的简历，更容易取得面试资格（好像有时候想去某实验室学习也是需要投简历的），并且，需要从现在就开始准备简历，好的简历不是一时半刻就能写出来的，都是经过长时间的修改加工才能做出来的。\n2.平时敲代码！多敲代码！！\n为什么这么说呢？现在放眼望去，学习编程的人不在少数，你要如何与他们竞争呢？一是学历，这点我们不能否认，二是自身的硬实力，而这硬实力是怎么练出来的？就是平时的积累，多敲代码，但我们要做的不应该是所谓的码农，因此我们还需要多思考，多学习。我始终相信一句话，积少成多，方能成大器。\n3.敢于去接触一些看起来挺高深的东西\n我现在是准备去学校的一个实验室学习有关机器学习、大数据这些方面的内容。对要准备读研的同学来说这点是肯定的了，而对于本科毕业就准备出去工作的同学，想想几年后，自己相比于读研的同学，优势在哪里?绝大部分只是经验，而这经验等他们工作几年后也算不上是优势了，时代在发展，我们要学的东西越来越多，不想被淘汰，就需要去接触这些，撸起袖子就是干，不管会不会，不学肯定不会。\n4.多关注关注外面\n平时多参加些比赛，拿不拿奖不重要，关键是要出去见识见识，见的多了就会有更好的想法。还多与一些厉害的学长学姐交流，有时他们的一些经历或是想法是能让自己更清楚地知道接下来该怎么走的。还有就是，关注前沿的技术，不断学习才能更加强大。\n5.精一门，懂多门\n就是编程涉及的各方面都涉及了解一下，见识的多对自己未来的发展没有坏处，但得要有自己一个专精的地方，得靠这个吃饭。读研的自然也一样，你们研究的方向自然就是精的那门，那只满足与这一门就够了吗？要知道，每一门技术都不是孤立存在的，一定是与其他的技术有关联，涉猎的范围广了，对于一个问题的分析会更加透彻，想的也会更远。像我去年的时候，想的就是做个游戏开发，但接触了一段时间机器学习之后，我想法就稍微变了，现在想的是以后做的是游戏中 AI 的开发（个人认为，一个优秀的游戏少不了好的 AI ）。总结一下就是学归学，总的方向肯定不变，学了只是为了更好地实现自己地目标。\n最后我想说直接工作并不代表以后你就比不上读研的同学，说实话，我们得承认读三年研究生能学到不少东西，但是工作三年期间，不代表你不能学他们学的，不代表几年后你就比不过他们\n以上就是我目前的一些看法，如有说的不好的地方，请多多包涵，同时希望各位大神、前辈们能给些学习上的建议。"}
