{"content2":"链接 https://blogs.nvidia.com/blog/2016/07/29/whats-difference-artificial-intelligence-machine-learning-deep-learning-ai/\n这是多部分系列文章中的第一部，该系列讲解了长期科技记者Michael Copeland的深度学习基础知识。\n人工智能是未来。人工智能是科幻小说。人工智能已经成为我们日常生活的一部分。所有这些陈述都是正确的，它取决于你所指的AI的味道。\n例如，当谷歌DeepMind的AlphaGo计划在今年早些时候的棋盘游戏Go中击败韩国大师Lee Se-dol时，媒体中使用AI，机器学习和深度学习来描述DeepMind如何获胜。这三个都是AlphaGo击败Lee Se-Dol的部分原因。但他们不是一回事。\n想想他们之间关系的最简单的方法是将它们视为同心圆与人工智能 - 首先出现的想法 - 最大的，然后是机器学习 - 后来开花，最后是深度学习 - 这推动了今天的AI爆炸 - 适合两者兼而有之。\n从胸围到繁荣\n自1956年在达特茅斯会议期间，一些计算机科学家围绕这一术语集会并诞生人工智能领域以来，人工智能一直是我们想象力和研究实验室酝酿的一部分。在此后的几十年里，人工智能已经成为我们文明最辉煌未来的关键，并被视为技术的垃圾堆，这是一种难以理解的超螺旋桨头概念。坦率地说，直到2012年，它都是两者兼而有之。\n在过去几年中，AI已经爆炸式增长，特别是自2015年以来。其中大部分都与GPU的广泛可用性有关，这使得并行处理变得更快，更便宜，更强大。它还与几乎无限存储的同时一两个冲击和每个条纹（整个大数据运动）的大量数据 - 图像，文本，事务，映射数据，你命名它有关。\n让我们来看看计算机科学家如何从一个破灭的东西 - 直到2012年 - 转变为每天数以亿计的人使用的应用程序。\n人工智能 - 机器展示的人类智能\nKing me：玩过跳棋的计算机程序是人工智能最早的例子之一，在20世纪50年代激起了早期的兴奋浪潮。\n早在56年夏天的会议上，那些AI先驱的梦想就是建造复杂的机器 - 由新兴计算机提供 - 具有与人类智能相同的特征。这就是我们所认为的“通用人工智能”概念 - 我们所有感官（甚至更多）的神话般的机器，我们所有的理由，并且像我们一样思考。你已经在电影中无休止地看到这些机器作为朋友 - C-3PO - 和敌人 - 终结者。一般人工智能机器有充分的理由留在电影和科幻小说中; 我们不能把它拉下来，至少现在还没有。\n我们所能做的就是“狭义人工智能”的概念。能够执行特定任务的技术，或者比我们人类更好的技术。狭义人工智能的例子包括像Pinterest这样的服务上的图像分类和Facebook上的人脸识别。\n这些都是实践中狭义人工智能的例子。这些技术展现了人类智慧的一些方面。但是怎么样？这种情报来自哪里？这让我们进入下一个圈子，机器学习。\n机器学习 -  实现人工智能的一种方法\n垃圾邮件免费饮食：机器学习有助于保持您的收件箱（相对）没有垃圾邮件。\n最基本的机器学习是使用算法解析数据，从中学习数据，然后对世界上的某些事物做出决定或预测的实践。因此，不是使用特定指令集手动编码软件例程来完成特定任务，而是使用大量数据和算法对机器进行“训练”，使其能够学习如何执行任务。\n机器学习直接来自早期AI人群的思想，多年来的算法方法包括决策树学习，归纳逻辑编程。聚类，强化学习和贝叶斯网络等。众所周知，没有人达到通用人工智能的最终目标，即使是狭窄的人工智能也是早期机器学习方法所无法实现的。\n要了解有关深度学习的更多信息，请使用NVIDIA自己的Will Ramey收听我们的Deep Learning 101播客。\n事实证明，多年来机器学习的最佳应用领域之一是计算机视觉，尽管它仍然需要大量的手工编码来完成工作。人们会进入并编写边缘检测过滤器等手工编码分类器，以便程序可以识别对象的起始和停止位置; 形状检测以确定它是否有八个边; 用于识别字母“停止”的分类器。从所有这些手动编码分类器中，他们将开发算法以理解图像并“学习”以确定它是否是停止符号。\n很好，但不是很精神。特别是在有雾的日子，当标志不是完全可见时，或者一棵树遮住了它的一部分。有一个原因是计算机视觉和图像检测直到最近才与人类相媲美，它太脆弱而且容易出错。\n时间和正确的学习算法完全不同。\n深度学习 - 一种实现机器学习的技巧\n放牧猫：从YouTube视频中挑选猫的图像是深度学习的第一次突破性演示之一。\n早期的机器学习人群，人工神经网络的另一种算法方法来了，并且大部分时间都持续了几十年。神经网络的灵感来自于我们对大脑生物学的理解 - 神经元之间的所有相互联系。但是，与任何神经元可以连接到某个物理距离内的任何其他神经元的生物大脑不同，这些人工神经网络具有离散的层，连接和数据传播方向。\n例如，您可以拍摄一张图像，将其切割成一堆输入到神经网络第一层的图块。在第一层中，单个神经元然后将数据传递到第二层。第二层神经元完成其任务，依此类推，直到产生最终层和最终输出。\n每个神经元为其输入分配权重 - 相对于正在执行的任务的正确性或不正确性。然后，最终输出由这些权重的总和确定。想想我们的停车标志示例。停车标志图像的属性被切断并被神经元“检查” - 它的八角形状，它的火引擎红色，它的独特字母，它的交通标志尺寸，以及它的运动或缺乏。神经网络的任务是判断这是否是一个停止标志。它提出了一个“概率向量”，实际上是一个基于权重的高度教育的猜测。在我们的例子中，系统可能有86％的信心，图像是一个停止标志，7％确信它是速度限制标志，5％是风筝卡在树上，依此类推 - 然后网络架构告诉神经网络是否正确。\n即便是这个例子也超前了，因为直到最近神经网络才被人工智能研究界所避开。他们从人工智能的早期开始就已存在，并且在“智能”方面产生的很少。问题是即使是最基本的神经网络也是计算密集型的，它只是不实用的方法。尽管如此，由多伦多大学的Geoffrey Hinton领导的一个小型异端研究小组坚持不懈，最终将超级计算机的算法并行运行并证明了这一概念，但直到GPU的部署才能实现承诺。 。\n如果我们再次回到我们的停车标志示例，那么很有可能当网络被调整或“训练”时，它会得到错误的答案 - 很多。它需要的是培训。它需要看到数十万甚至数百万个图像，直到神经元输入的权重被精确调整到几乎每次都能得到正确的答案 - 雾或没有雾，太阳或下雨。正是在这一点上，神经网络已经教会了自己的停止标志是什么样的; 或者你的母亲在Facebook的情况下的脸; 还是一只猫，这就是Andrew Ng在2012年在谷歌所做的。\nNg的突破是采用这些神经网络，并基本上使它们变得庞大，增加层和神经元，然后通过系统运行大量数据来训练它。在Ng的案例中，它是来自1000万YouTube视频的图像。Ng深入学习深度学习，它描述了这些神经网络中的所有层。\n今天，在某些情况下通过深度学习训练的机器进行的图像识别优于人类，其范围从猫到识别血液中的癌症和MRI扫描中的肿瘤。谷歌的AlphaGo学习了这款游戏，并通过一遍又一遍地对抗自身来训练其Go比赛 - 它调整了它的神经网络。\n感谢深度学习，AI拥有光明的未来\n深度学习已经实现了机器学习的许多实际应用，并且扩展了AI的整个领域。深度学习以各种方式分解任务，使各种机器辅助似乎成为可能，甚至可能。无人驾驶汽车，更好的预防性医疗保健，甚至更好的电影推荐，都在今天或即将到来。AI是现在和未来。借助深度学习的帮助，人工智能甚至可以进入我们长期以来想象的科幻小说状态。你有一个C-3PO，我会接受它。你可以保留你的终结者。"}
