{"content2":"国内机构： 上海交通大学图像处理与模式识别研究所 微软亚洲研究院计算机视觉研究组 武汉大学数字摄影测量与计算机视觉研究中心 浙江大学图像技术研究与应用团队 西安交通大学人工智能与机器人研究所 天津大学精密测试技术及仪器国家重点实验室 清华大学精密测试技术及仪器国家重点实验室 清华大学电子工程系智能图文信息处理实验室 中科院生物识别与安全技术研究中心 中科院自动化所 中科院自动化所医学影像研究室 中科院模式识别国家重点实验室 中科院长春光机所 中科院沈阳自动化所 中科院西安光机所 北京大学智能科学系 中科院计算所视觉信息处理和学习实验室 中科院自动化所医学影像研究室 中科院计算所视觉信息处理和学习实验室 JDL实验室\n国外机构： Stanford vision实验室 加州大学伯克利分校CV小组 南加州大学CV实验室 卡内基梅隆大学CV主页 微软剑桥研究院ML与CV研究组 普渡大学机器人视觉实验室 宾利州立大学感知、运动与认识实验室 宾夕法尼亚大学GRASP实验室 内达华大学里诺校区CV实验室 密西根大学vision实验室 麻省大学视觉实验室 ETH-Zurich CV实验室 CMU大学ILIM实验室 微软剑桥研究院组织 启明大学计算机视觉与模式识别实验室 康奈尔大学视觉与图像分析组 密西根州立大学生物识别研究组 柏林科技大学计算机视觉与遥感实验室 布里斯托大学数字多媒体研究组 萨利大学视觉、语音与信号处理中心 格拉纳达大学超分辨率重建项目组 巴塞罗那大学计算机视觉中心 Deep Learning Elefant 格拉斯哥大学信息检索小组 威兹曼科技大学超分辨率\n国内牛人：深圳大学于仕祺 微软CV张正友 中科院自动化所李子青 中科院计算所山世光 清华大学章毓晋 上海交通大学刘允才 清华大学丁晓青 北京大学高文 清华大学艾海舟 中科院田捷 微软Redmond研究院Simon Baker 微软亚洲研究院孙剑 微软亚洲研究院马毅 香港中文大学贾佳亚 南京大学吴建鑫 GE研究院李关 百度技术副总监于凯 西安电子科技大学高新波 中科院樊彬 凤巢系统架构师张栋 中科院自动化所肖柏华 中科院自动化所孙哲南 南京信息工程大学刘青山 清华大学冯建江 中山大学郑伟诗 百度深度学习余轶南 中科院计算所常虹 南开大学程明明 江西财经大学袁飞牛 北京航空航天大学周付根 北京航空航天大学姜志国 西南财经大学段江 中科院沈阳自动化所华春生 华中科技大学张天序 南京大学周志华 香港理工大学张磊\n国外牛人： 香港中文大学汤晓鸥 MIT林达华 MIT Douglas Lanman Stanford崔靖宇 UCLA朱松纯 美国Rutgers刘青山 香港中文大学王晓刚 U.C. San Diego 德克萨斯州奥斯汀分校Kristen Grauman 巴塞尔大学Thomas Vetter 俄勒冈州立大学 Rob Hess 卡内基梅隆大学Robert T. Collins MIT Chris Stauffer 密歇根州立大学 Anil K. Jain 伊利诺伊州立大学Thomas S. Huang 巴塞尔大学Sami Romdhani CMU大学Yang Wang 曼彻斯特大学Tim Cootes 罗彻斯特大学Jiebo Luo 华盛顿大学Iva Kemelmacher 魏茨曼科技大学Ronen Basri 普林斯顿大学李凯 普林斯顿大学贾登 牛津大学Andrew Zisserman leeds大学Mark Everingham 爱丁堡大学Chris William 微软剑桥研究院John Winn 佐治亚理工学院Monson H.Hayes\n牛人博客：小魏的修行路邹宇华张睿卿邹晓艺CVPR|Opencv脚踏实地crazy_sparrowyang xinthefutureisour张驰原晃晃悠悠萝卜驿站C++的罗浮宫MIND HACKSeegfmricelerychenxceman1997zouxy09darkscope陈皓Matrix67徐宥赵劼白明懒人有禅图灵社区JerryLeadJulyMoreWindows曹胜欢yang_xian521Sophia_qing\n国际会议： CV会议日历 CV论文索引 CV会议搜索 IEEE 会议 wikicfp CCF推荐排名 ICCV ECCV CVPR AAAI ICIP ICPR ACCV BMVC IAPR MVA SIGGRAPH EUROGRAPHICS IJCAI ICASSP ICML\n国际期刊： IJCV PAMI CVIU TIP PR PR Letters CVGIP IJPRAI 国内期刊 自动化学报 计算机学报 软件学报 电子学报 中国图象图形学报 模式识别与人工智能 光电子激光 光学精密工程 展会信息 慕尼黑上海光博会 中国国际机器视觉展览会 国际光电博览会 光电子中国博览会 中国国际工业博览会 中国国际机器人展览会 美国消费电子展\n代码托管： Github sourceforge Gitlab BitBucket Google code GitCafe GitShell 开源中国 淘宝code 京东code 新浪 sae CSDN code Coding svnchina"}
