{"content2":"松尾丰，作者简介：东京大学院工学系研究科副教授，1997年毕业于东京大学工学部电子信息工学科。2002年完成了该大学的博士课程，成为工程博士。同年任产业技术综合研究所研究员。2005年起任斯坦福大学客座研究员。2007起至今任工学系研究科副教授，兼任新加坡国立大学客座副教授。专业领域为人工智能、网络信息挖掘、大数据分析。日本人工智能专家之一，曾获人工智能学会颁发“论文奖”（2002年）、“创立20周年纪念事业奖”（2006年）、“现场创新奖”（2011年）、“功劳奖”（2013年）等奖项。先后在人工智能学会任多职；2012年起任编辑委员长、理事；2014年任伦理委员长。编著有《大智能时代套装》（机器人的未来、机器人新时代、机器人革命、数字法则、大智能时代）。\n书中对人工智能的三次人工智能的浪潮进行阐述，对三次人工智能浪潮的主要技术进行了介绍，还有各大科技公司面对人工智能浪潮采取的应对措施。当第三次人工智能浪潮来临时，我们的生活会变成什么样，如果都想人工智能专家想像中的那样，90%的事情都可以交给带有人工智能机器去完成，那我们人类剩余出来的时间又该做什么？以及针对人工智能是否会有情感，带有情感的人工智能是否意味着人类的灭亡，作者都进行了详细的分析。\n首先我们要摆平我们的心态：人工智能并未实现，但是没理由不实现！探索人类智能的原理，并通过工程学的方法对其进行实现和利用，这样的人工智能还没有实现。人类对于物理世界的研究从微观的原子到浩瀚的宇宙都有的较为本质上的认识，大型的强子碰撞机，宇宙飞船都是对物理世界认识的产物。然而，人类的大脑能力深奥无比、遥不可及，科学家对其探索的脚步从未停止，然而利用计算机对其进行的模型也未能实现。\n人工智能是什么？一下是专家给出的定义；\n1. 人工智能是“采用人工方法制作的、具有智能的实体，或者是以创造智能为目的的、对智能本身进项研究的领域”。\n2. 把类似我们很自然地接触宠物或者其他人的那种充满感情和幽默的相互作用，在与物理定律无关或者相逆的条件下，用人工方法制造出来的系统，定义为“人工智能”，这种系统采用的不是分析性的理解方法，而是通过对话等交流方式进行的交谈性理解。这就是人工智能。\n3. 以模仿、支持、超越人类的智能行为为目的的建构性(通过制作来进行理解)系统。与建构性对应的词是分析性，举个例子，从事体育运动的是运动员从事的是建构性理解，而体育评论家则是分析性理解。\n4. 采用人工方法制造的类人智能，以及其制造技术，类人指的是具有“发现和察觉功能”的计算机，即能够从数据中生成特征量。\n对于我们非人工智能研究着而言，人工智能分为四个级别：\n1.把单纯的控制程序称作“人工智能”，比如：空调，全自动洗衣机等；\n2.传统人工智能(引入了推理及搜索，或者知识库)，比如可以下棋的程序，智力问题求解等；\n3.引入机器学习的人工智能，机器学习以样本数据为基础、对规则和知识的自学习；\n·4.引入深度学习的人工智能，能够对机器学习时的数据表示所用变量(特征量)本身进行学习的人工智能。\n强人工智能：具备正确的输入与输出、被施与合理程序化的计算机，与拥有心智的人是没有任何区别的，即它也是有心智的。\n弱人工智能：计算机没有必要拥有心智，只要能够通过其有限的智能解决一些智力问题即可。\n第一次人工智能浪潮：\n时间：20世纪50年代------20世纪60年代\n概括：第一次人工智能浪潮是推理和搜索的时代\n代表事件：\n1.用搜索树搜索迷宫\n方法：搜索树\n宽度优先搜索，能够找到距离目标最短的路径，但是需要的存储量大；\n深度优先搜索，需要的存储量小，但是搜索时间不定，可能会很小，也可能会很大；\n2. 梵塔问题\n方法：搜索树\n3.机器人行动过程规划\n方法：搜索树\n4.博弈(棋类游戏)\n棋类游戏的组合是非常大的，对目前的计算机来说，如果采用直接搜索的方法无疑是很难满足需求的。那现在的计算机可以战胜人类的秘诀又是在哪里呢？\n1.能够发现更好的特征量\n2.“蒙特卡洛法”改变评估机制\n第二次人工智能浪潮：\n时间：20世纪80年代------1995年左右\n概括：第一次人工智能浪潮是知识(“专家系统”)的时代\n“专家系统”本身是一种程序，通过引入某个专业领域的知识，在经过推理，计算机便能够像该领域的专家一样出色地开展工作。\n什么是“知识表示”？\n对于我们每个人都熟知的知识，怎样表达才能让计算机易于处理？在这方面的基础性研究，被称为“知识表示”研究。\n本体研究？\n“本体“相当于撰写知识时的规格说明书。本体研究分为“重量级本体”和“轻量级本体”两个派别，重量级本体的支持者认为研究者需要认真考虑该怎么描述知识，并研究为此应该怎么做；轻量级本体的支持者认为，把数据输进计算机里面，并让计算机自己寻找概念之间的相关性。轻量级本体的一个极致例子就是由IBM开发的“沃森”。\n作者在此提到了“机器翻译”、“框架问题”和“符号接地问题”三个问题。利用导入知识的人工智能进行机器翻译，但是导入知识的机器翻译尽管可以较好地理解语言的语法，但是，精确地从语法分析往往会产生语义上的歧义，而语义的理解正是机器翻译的难点所在。“框架问题”，就是在执行某项任务时“仅仅提取出与它相关的知识并对其加以运用”，这对人类来讲很简单，但是对机器来说非常困难。“符号问题”，是否能将符号（词句、语言 ）与它表示的意义连接起来的问题，计算机以为不懂得符号的意义，所以不能把符号与其所表示的意义结合起来。\n第三次人工智能浪潮：\n时间：2000年以后至今\n概括：第一次人工智能浪潮是机器学习与特征表示学习的时代\n什么是机器学习？机器学习指人工智能程序自身进行自身学习的机理。那怎样才算是学到东西呢？学习的主要工作是进行“区分”，对某一事物进行判断和识别，就可以理解它，还能根据对该事物的判断而采取相应的行动。机器学习分为“有监督学习”和“无监督学习”，有监督学习，指的是事先需要准备好输入与正确输出想配套的训练数据，让计算机进行学习，以便当它被输入某个数据时能够得到正确的输出；无监督学习，指仅提供输入用数据、需要计算机自己找出数据内在结构的场合，目的是让计算机从数据中抽取出其中所包含的模式及规则。\n常用的五种“分类”方法：\n1.最近邻分类算法\n2.朴素贝叶斯算法\n3.决策树\n4.支持向量机\n5.人工神经网络\n机器学习的难点（弱点）是特征工程，即特征量的设计。计算机并不能做出选取特征量的判断。提高机器学习的精确度的关键在于“输入何种特征量”，然而这只有靠人用大脑思维来解决。到目前为止人工智能之所以尚未实现，就是因为人工智能在“从这个世界里面应该关注何种特征并提取信息”这点上，还必须借助人的力量。如果计算机能够从被导入的数据里面找出应该关注的特征，并得到表示这种特征程度的特征量，那么机器学习的“特征量设计”问题也将被解决。深度学习，恰好可以解决这个问题。\n深度学习\n深度学习以数据为基础，由计算机自动生成特征量，它不需要由人来设计特征量，而是由计算机自动获取高层特征量。\n自动编码器：输入与输出相同\n深度学习与之前的机器学习相比有两个较大的不同点：一是需要一层一层地逐层学习；二是深度学习使用一种被称为“自动编码器”的“信息压缩器”。自动编码器所执行的处理与众不同，它将“输出”和“输入”做成相同的数据，与“主成分分析”具有同样的工作原理，但是自动编码可以进行“深层”即多层次操作，可以提取出主成分分析无法提取出的高层特征量。下图为深度学习结构，\n从数据里面找出并生成概念，本身是不需要“教师数据”的无监督学习，深度学习在进行无监督学习的时候采用的是有监督学习的方法。自动编码器，在本来应该有教师提供正解的地方输入原来的数据，以此对输入数据本身进行预测，再生成各种各样的特征量，这就是通过有监督学习的方式进行无监督学习。Google的“猫脸识别”研究，处理1000万张图像，使用的神经元之间的链接超过100亿个的巨型神经网络，用1000台计算机（16000个处理器）连续运行3天，就是通过“采用有监督的学习方法实现无监督学习”生成特征量，即提取出“猫脸”的概念，此时，再赋予“猫脸”的名称，即完成了符号（名称和概念的结合）接地的问题，在最后区分的时候采用有监督的学习的分类方法。\n深度学习的关键------“鲁棒性”\n实际上，提取特征量或者概念需要相当长时间的“打造和提炼”过程，只有这样，才能使所获取的特征量或者概念具有鲁棒性（“健壮性”）。如何做到深度神经网络的“鲁棒性”呢？其实是需要在输入型号里面加入“噪声”，通过反复加入噪声后获取的概念，就不会因为一点风吹草动就摇摆不定。(听起来有些矛盾，但又何尝不是这样呢)。鲁邦性的提高与计算机的处理性能有较大的关系。\n增加鲁棒性的方法\n1.加入噪声制作“略微不同的过去”的做法；\n2.dropout方法，让神经网络的一部分神经元停止工作，即让隐层50%的神经元出现任意性缺损。对特征项目进行最优化处理，以便让某个特征量能够覆盖其他特征量，这样，特征表示就不会出现过度依赖某一个特征量的情况。过度依赖仅有的某一特征量是非常危险的，让一部分特征量不能使用，对于发现恰当的特征表示是很有帮助的。\n除此之外，还有很多专家在研究各种各样的针对神经网络鲁棒性的方法，因为如果不使劲“折磨”它，就无法获取存在于数据背后的“本质特征量”。\n深度学习之后的技术发展\n1.能够对图像特征进行抽象化处理的人工智能，能够实现多模态抽象化的人工智能，图像处理相当于人类的视觉，还有听觉、触觉等信息待处理；\n2.能够对行动与结果进行抽象化的人工智能，目前人工智能还是停留在对外界事物进行观察的地步，如何与外界进行交互也是未来的研究方向；\n3.能够通过行动获取特征量的人工智能，通过与外界的交互作用获取新的特征量，类似于，人们根据多次的实验突然间意识到的某个特征量或者窍门，下次遇到同样的事情就会想到这个窍门；\n4.能够进行语言理解和自动翻译的人工智能，解决符号落地问题；\n5.能够获取知识的人工智能，使人工智能具有想像力；\n讨论了人工智能的技术问题以及未来的发展，就得说说人工智能的社会性问题了。\n人工智能是否具有本能？\n人工智能是否具有创造力？\n人工智能的社会性意义？人类具有群居性的动物，那人工之能呢？\n奇点会发生吗？奇点，指的是人工智能能够自动地制造出超越自身能力的人工智能的那个时点。\n如果人工智能妄想征服分类，有哪些方式？\n对于这些问题作者也进行了论述，总结一句话，人工智能必须造福于人类。\n人工智能在对人类生产生活的影响：\n1.广告、图像诊断、网络企业；\n2.个人机器人、安全防范、大数据运用企业；\n3.汽车制造、交通、物流、农业；\n4.家政、医疗护理、接待及呼叫中心；\n5.翻译及全球化；\n6.教学、秘书、白领工作辅助；"}
