{"content2":"AI职位：人工智能职位之计算机视觉算法工程师的简介、知识结构、发展方向之详细攻略\n计算机视觉算法工程师的简介\n截止到2019年7月份，关键指数显示\n1、各大互联网巨头的薪资介绍\n2、计算机视觉应用领域\n3、各大公司职位简介\n(1)、商汤科技   深度学习/计算机视觉研究员\n职位诱惑：人工智能独角兽,技术大牛多,工作氛围好\n工作职责:\n1. 负责计算机视觉和深度学习基本算法的开发与性能提升，涉及的问题包括但不限于：检测、跟踪、分类、语义分割、强化学习、3D视觉和图像处理等\n2. 推动计算机视觉算法和深度学习在众多实际应用领域的性能优化和落地\n3. 提出和实现最前沿的算法，保持算法在工业界和学术界的领先\n任职资格:\n1. 熟练掌握机器学习（特别是深度学习）和计算机视觉的基本方法\n2. 优秀的分析问题和解决问题的能力，对解决具有挑战性的问题充满激情\n3. 较强的算法实现能力，熟练掌握 C/C++ 编程，熟悉 Shell/Python/Matlab 编程\n4. 有较强的研究能力优先，如研究生发表过第一作者CCF A类会议或期刊等论文，或本科发表过第一作者CCF B类以上会议或期刊论文\n5. 有较强的代码能力优先，获得过ACM或其他商业代码竞赛的荣誉，如ACM区预赛金牌、NOI银牌以上、百度之星决赛等；或代码开源在github上并有较大影响\n6. 有较强的学术比赛经验或者在重要数据集的Leaderboard上排名靠前，比如ImageNet等学术数据集或者Kaggle等一些国内外商业比赛\n7. 有较丰富的相关经验优先，如有一年以上在BAT或人工智能知名创业公司进行视觉算法或工程相关的工作经验，或来自国内外计算机视觉/计算机图形学/机器学习/数据挖掘等领域内知名实验室。\n(2)、腾讯  上海-计算机视觉工程师\n职位诱惑：大平台\n岗位职责：\n1、负责视觉相关算法的研究和应用，包括但不限于如下方向：目标追踪，目标检测，图像分割，图像分类等计算机视觉技术。\n2、紧跟前沿算法和技术，推动计算机视觉算法和深度学习在实际应用领域的性能优化和落地。\n岗位要求：\n1、图像处理、计算机视觉、模式识别、机器学习等相关专业硕士及以上；\n2、2年以上图像识别/计算机视觉领域相关工作经验，熟悉图像识别/计算机视觉领域的主流模型和算法，关注领域内的最新进展；\n3、较强的算法实现能力，熟练掌握C/C++，Python，Java等至少一门语言；熟悉Linux环境开发；熟悉OpenCV等常用库，熟练使用一种或几种深度学习框架（caffe，tensorflow， Pytorch）；\n4、有目标检测、语义分割、人脸识别等实际应用经验者优先；\n5、有较强的研究能力者优先，如在领域顶级会议如CVPR，ICCV，ECCV，NIPS等发表过高质量论文； 6、有良好的团队合作和沟通能力。\n(3)、字节跳动  头条实验室工程师-计算机视觉\n职位诱惑：弹性工作，免费三餐，租房补贴，带薪休假\n职位职责：\n1、为产品应用提出人工智能解决方案和模型；\n2、人工智能技术的工程化；\n3、开发新技术的原型系统。\n职位要求：\n1、扎实的数学和算法基础：概率统计、数值优化算法；\n2、快速学习新技术的能力，能够在较短时间内理解前沿论文并评价；\n3、实践动手能力强， ACMICPC, NOI/IOI，top coder，Kaggle比赛获奖者优先；\n4、在机器学习、图像视频理解、图像分类、物体检测等算法方面有经验者优先；\n5、在顶级学术会议上发表论文者优先；\n6、有大规模分布式系统工程经验者优先；\n7、能与团队融洽合作相处；\n8、积极主动有热情。\n(4)、拼多多\n职位诱惑：平台好,大牛多,薪资待遇佳\n岗位职责：\n1、负责计算机视觉、深度学习相关方向的技术难点攻关与前瞻研究。\n2、负责计算机视觉、深度学习相关的技术实现与产品的研发工作。\n3、负责计算机视觉、深度学习相关的算法计算性能优化，并推动其上线应用。\n任职要求：\n1. 硕士及以上学历，模式识别、计算机视觉、数学等相关专业；\n2. 对计算机视觉和模式识别方向有扎实的理论和实践基础；\n3. 有图像检测、数字信号处理、统计机器学习、深度学习项目经验者优先；\n4. 熟悉物体（人体、人脸、通用目标）检测、跟踪与识别的基本算法；\n5. 具有较强编程能力，熟练使用至少一种脚本语言（python/shell等），有C++和java开发经验，熟悉linux开发环境，有caffe, pytorch, tensorflow经验更佳；\n6. 正直诚信、有团队精神，有良好的学习能力，沟通能力和独立解决技术问题的能力。\n计算机视觉算法工程师的知识结构\n1、深度学习原理\n2、深度学习框架\n3、编程语言\n4、专业知识(数字图像处理及OpenCV)\n计算机视觉算法工程师的发展方向\n后期更新……"}
