{"content2":"核心提示：微软在 Office365、Azure 云、Dynamics365 上进行人工智能技术的部署，野心不小。 微软在2016年9月宣布组建自己的 AI 研究小组。该小组汇集了超过 5000 名计算机科学家和工程师，加上微软内部研究部门，将共同挖掘 AI 技术。 与此同时，亚马逊，Facebook，Google，IBM 还有微软联合宣而巨头们也纷纷拿出了自己的看家本领，Apple 的 Siri 利用自然语言处理来识别语音命令；Facebook 的深度学习面部识别算法能够快速准确地识别出人脸；Google 的「大脑」可能更为聪明，而且能够安装在数百万安卓系统的设备上。而隐藏在 CRM 领域的对手之一 Salesforce 也声称推出了一款全新的人工智能平台。还有 Amazon、Netflix 和 Spotify 都在强调使用机器学习了解如何与客户建立联系。最近的人工智能领域如此炙手可热，就连微软的首席执行官纳德拉也提到，「将 AI 覆盖到所有领域，是因为微软想要实现「AI 技术民主化」，从而解决全球最紧迫的挑战。」据悉，微软将从以下四个细分方向实现「AI 技术民主化」：Agents. Harness AI to fundamentally change human and computer interaction through agents such as Microsoft』s digital personal assistant Cortana1、助手。利用 AI 从根本上改变人机交互过程，如微软的数字个人助理 Cortana。Applications. Infuse every application, from the photo app on people』s phones to Skype and Office 365, with intelligence2、应用平台。从移动端的照片 app 到 Skype，再到 Office365，每一个应用平台融入了 AI 技术。Services. Make these same intelligent capabilities that are infused in Microsoft』s apps—cognitive capabilities such as vision and speech, and machine analytics—available to every application developer in the world3、服务。让全球每位应用开发者都能获取同样的 AI 技术支持。如微软 app 中视觉与语音识别能力，机器分析能力。Infrastructure. Build the world』s most powerful AI supercomputer with Azure and make it available to anyone, to enable people and organizations to harness its power4、基础架构。以 Azure 云为平台，构建强大的 AI 超级计算机，为企业和个人提供该项服务。那么，微软近期推出的几款人工智能产品看似「姗姗来迟」，但在 AI 领域的重量可不能小视，那么，微软在如何布局 AI 呢？其旗下几大产品又都与 AI 有着怎样的关系？推出人工智能版 Dynamics365提升销售转化率，更好地理解客户行为，是如今移动、社交、云三者融合时代的大背景下企业需要具备的重要能力。过去几周，CRM 领域频频传来人工智能利好的消息。如今，微软也向世人透露：在下月 1 日，将推出人工智能版 Dynamics365，为销售人员提供云端商务应用解决方案。该款产品将 ERP 与 CRM 进行整合，打造成为一个单一的云端解决方案。此次产品的推出主要针对的就是 CRM 领域占主导地位的 Salesforce，而此前不久，Salesforce 刚刚推出了一款名为「爱因斯坦」的人工智能云平台，能够为企业客户提供相应服务。Microsoft has built in a couple of intelligence features into the release designed specifically for sales and service personnel. First, there is Customer Insights, a stand-alone cloud service, which enables users to bring in a variety of internal and external data sources. Companies can integrate all of this data with internal metrics (KPIs) to drive automated actions based on the data. The solution includes partner data from the likes of Facebook and Trip Advisor (proving you don』t need to own an external data source to take advantage of it).微软推出的 Dynamics365 能够为销售人员提供以下几类服务：一是客户洞察（Customer Insights），一款单机云服务，帮助用户收集各类内外部数据信息。企业能够将所有数据与内部指标（KPIs）进行集成，基于数据进行自动化行为的驱动。这套解决方案还包括了合作伙伴如 Facebook 和 Trip Advisor 上产生的大量数据，不过，这也说明了用户无需借外部获取数据。It』s been designed as a stand-alone service that can work with any of the Dynamics 365 CRM components—sales, customer service or field service—and can also work with any external CRM tool with open APIs. This last point is particularly telling because it』s giving customers who might not be using Dynamics 365 (but are using other Microsoft tools like Outlook) access to this feature.一方面，单机服务能够与 Dynamics365 CRM 的组成部件进行很好地兼容，包括销售、客服或者现场服务；另一方面，还能与任何一个带有开放 API 接口的外部 CRM 工具进行兼容。此外，单机服务还能为并未使用 Dynamics365，而是微软其他工具如 Outlook 的客户，提供该项服务的渠道。The second piece is called Relationship Insights, which as the name suggests gives sales people information about the status of their customer relationships at any given moment. It』s built on the on the Cortana Intelligence Suite, which Microsoft introduced in 2015 and uses tools like sentiment analysis to check on the likelihood of the deal closing and the next best action to take.二是关系洞察（Relationship Insights），为销售人员即时提供客户关系信息。该服务基于人工智能助手小娜的平台进行提供。这个智能助手于去年在全球推出，通过情感分析检测交易结束的可能性，并判断下一步最佳实践方案。For now, know that Microsoft has consolidated its artificial intelligence tools into a single, coherent division and just about every vendor—not just those selling CRM—is trying to build some level of intelligence into its products. Dynamics 365 is just the latest manifestation.总的来说，微软已将人工智能工具嵌入一个单独连贯的区域，而且不只是 CRM 领域的供应商，基本上每个供应商都在试图将某种程度的智能技术嵌入到其产品中。"}
