{"content2":"在北京颐和园附近的一座仿古四合院中。深藏着一家由一群极客组成的科技公司——格灵深瞳。两位创始人何搏飞和赵勇似乎是来自两个全然不同世界的人。前者毕业于斯坦福大学商学院，曾先后创建了两家美国公司中国区的团队和业务。是个彻头彻尾的“商人”。而赵勇。这个从谷歌研究院中走出的创业者，则是一个完全然全的“极客”。什么是计算机视觉？“我们在一起，全然是徐小平撮合的。”一见到新浪科技。何搏飞就回想起与赵勇第一次见面的场景。当时我正在寻找创业方向。徐小平给我介绍了非常多人。有些是理念不合，有些是方向不认同，迟迟没有找到合适的搭档，直到见到了赵勇。“当时是在北京北四环一个老旧的小区里，楼道满是小广告，在一处三室一厅的民宅里。赵勇已经带着团队干了几个月。”何搏飞回顾说，当时本来是想聊一会，给徐老师交个差。可是没想到最后从下午2点聊了夜里12个小时。“赵勇向我介绍技术的起源、发展和应用，我很很兴奋，作为一个商管理背景的人，我的兴奋来源于，看到了一个方向——人工智能技术可能会像互联网给人类带来改变。成为下一个给人类世界带来重大变革的技术。”他说。赵勇以前供职于谷歌研究院。他參与的谷歌眼镜项目。开创了可穿戴设备的热潮。赵勇的主要研究方向就是计算机视觉，而计算机视觉研究的终极目标就是希望计算机拥有无限接近人的感知能力。“当时的主流是用普通的光学镜头，加上软件算法，可是这样的画面事实上是二维的。人脑这么聪明都须要三维获取，更可况计算机呢。当时仅仅有包含赵勇在内的少数一些人坚信计算机须要三位获取。带着这个理想，赵勇開始回国创业。从事三维计算机视觉方面的研究。”何搏飞介绍说。尴尬的安防现状只是，唯独技术还远远不够。在攻克了计算机视觉的基础问题后。怎样将之真正投入应用取得商业成功，而不是只停留于研究层面。摆在了何搏飞的眼前。在众多领域中，何搏飞选择了安防。“安防领域有几个优点。首先是市场够大，一年销售收入4000亿收入；其次是这个领域存在重大问题。可以被我们的技术完美的解决，所以我们看来看去，安防监控是一个完美的切入点。”计算机视觉经常被比作让计算机长了眼镜，可以看懂这个世界。可是。不管是电脑还是手机，最多仅仅有2个摄像头，并且打开的时间很有限。全世界摄像头最多、最密集的领域就是安防监控，并且是不间断24小时执行。“如今我们国家有几十亿个安防监控摄像头，可是有两个根本性的问题始终没有得到解决，就是看不见和找不到。”何搏飞举例说，在北京某大型银行的监控中心有一块巨大的屏幕，全北京2万多个摄像头依次展现，一次可以同一时候展示100部摄像机，每90秒轮换一次。假设危急真的发生了，通过这种监控手段真的能被发现吗？不久前。在东莞，一女子因银行卡被吞徒手拆毁ATM机，事件发生10多分钟，从多个角度被拍摄。最后还是被围观群众报警才终于发现，监控系统仅仅起到了记录的作用。在何搏飞看来，监控的最佳状态是在事情有发生苗头的时候制止。退而求其次，才是记录罪证。只是即使是做为记录。找寻起来也很麻烦，由于视频资料仅仅有一个时间维度。有时候为了寻找一个瞬间，须要看几个或者几十个小时的录像资料。“当危急事件真正发生的时候，有监控。被拍到，可是监控室没看到。还有一方面，随着摄像头呈现几何级数的增长，在监控中心须要配合的监看的人力也随之高速增长。这就是中国安防监控领域尴尬的现状。”何搏飞说。安防监控进入智能时代为了解决问题。格林深瞳所做的事情就是在传统图像式的监控之上，让计算机可以直接记录画面中的运动轨迹，从而看懂人类的行为。何搏飞介绍说，格林深瞳监控系统所用的摄像头拥有三个镜头，一是与普通安防摄像头一样的RGB摄像头。另外两个事实上各自是激光发射器和接收器，可以每30分之中的一个秒发射36万束激光，实时的扫描三维空间，这与微软XBOX游戏机中Kinect感应器的原理十分相似。与Kinect不同。Kinect最大仅仅能感知两个人运动，而格林深瞳可以精确的对多人进行跟踪。何搏飞向新浪科技展示了格林深瞳的识别能力，在一个房间内，有15个人以上进行无规则行走，每一个人的行走轨迹都能被精确识别和记录。基于这些技术，格林深瞳的监控系统能够发现人群的突然聚集和散开，还能够追踪到单人的突然奔跑、剧烈动作等，在事件发生瞬间向监控人员报警。另外。系统还能识别跌到、呼救等动作，及时通知相关人员。“从学术来讲，我们能够做到多人的运动轨迹和速度进行精确的跟踪和推断。实际应用中，根据对人的轨迹和速度进行精确的跟踪和推断。拥挤、阻挡、穿插等动作都能够被监測到。”何搏飞说。何搏飞表示。安防领域去年的销售收入约为4000亿元，并且超过30%复合增长率。这个市场甚至比智能手机更大、增速更快。在美国。摄像头与人口的比例是1:10。伦敦已经达到了1:1，而中国的北京、上海这个比例还不过1:50。因此，他预測未来几年这个领域还将继续爆炸式的增长。下一个浪潮：人工智能除了安防监控，何搏飞表示，格林深瞳正在汽车自己主动驾驶、智能机器人方面做前瞻性研究。“除了安防监控，我们还正在研发很多意思的事情。明年年底之前。我们将在汽车自己主动驾驶领域突破。”何搏飞介绍说，眼下自己主动驾驶方面最率先的谷歌採用的技术是通过三维传感器不断扫描周围情况，从而实现自己主动驾驶。“可是谷歌採用的三维传感器价格高达12万美元，车本身也只是才一两万美元。要投入市场恐怕还须要非常长时间。而我们将採用的技术是让人类的司机教会计算机怎样开车。”何搏飞说。他进一步解释说，计算机仅仅能机械式的运算，比方路上有个人就立即停下。可是人类的司机就会不同。他知道这个人会自己躲开走，所以他开车不会减速。因此非常大程度上，自己主动驾驶必须依靠人类的智慧去调教计算机。“短期看。我希望格灵深瞳可以成为计算机视觉领域最率先的公司，可是从长期看，人工智能将掀起新一轮革命性的变化，这样的变化不亚于电的发明，或者互联网的发明。因此从长期看，格林申的学生必须是人工智能公司。”何飞说行程。版权声明：本文博主原创文章。博客，未经同意不得转载。"}
