{"content2":"2018工程院院士一、机械与运载工程学部(123人)陈学东  邓宗全  丁荣军  董春鹏  樊会涛  冯培德  冯煜芳  甘晓华  高金吉  关杰  郭东明  何琳  侯晓  黄庆学  黄先祥  蒋庄德  金东寒  李椿萱  李德群  李骏  李魁武  李培根  李钊  林忠钦  刘人怀  刘怡昕  刘永才  卢秉恒  路甬祥  马伟明  邱志明  孙聪  孙逢春  谭建荣  唐长红  田红旗(女)  王华明  王玉明  王振国  吴光辉  吴有生  夏长亮  杨德森  杨凤田  杨华勇  杨绍卿  尹泽勇  尤政  张军  张彦仲  钟志华  周济  周志成  朱能鸿  朱英富二、信息与电子工程学部(124人)序号姓名出生年2018年龄领域序号姓名出生年2018年龄领域1柴天佑194772控制，东北大学21桂卫华195068过程控制，武汉，长沙2陈纯195563计算机应用22何友信息融合、雷达3陈杰196553人工智能，同济，北京理工23姜会林光学机械4陈鲸194079通信与信息系统24李德仁测量遥感5陈良惠光电25李德毅194474控制、人工智能，北京6陈志杰空中交通管理系统技术，军队航空26李国杰194375计算机体系结构、并行算法、人工智能、计算机网络、信息技术，中科院北京7陈左宁(女)高性能计算机，系统软件27李天初1945光学，贵阳人，中国计量院8戴浩1945军队指挥信息系统28李同保光学9戴琼海196454控制，东北大学29廖湘科计算机系统软件与通用操作系统10邓中翰大规模集成电路，芯片30刘玠194375冶金控制系统，辽宁鞍山11丁文华195662传播技术系统，传媒大学，中央电视台31刘永坚航空电子对抗12段宝岩195563机械电子，西安电子科大32刘韵洁通信网络13樊邦奎无人侦查，信号处理33刘泽金激光14范滇元激光34陆军预警机信息系统15方滨兴网络安全35卢锡城高性能计算机16方家熊光传感36吕跃广光电17费爱国数据链，信息系统37倪光南计算机，联想集团18封锡盛194177水下机器人，沈阳38宁滨195959控制系统、轨道交通控制，北京交大19高文195662计算机智能算法与系统研究，在高效视频编解码算法与标准化、图像检索技术、视频分析技术、人脸识别技术、手语识别技术等方。北京大学39潘云鹤194672同济建筑，计算机图形、人工智能、CAD和工业设计，和李耘的智能设计相仿，浙大20龚惠兴光电40沈昌祥海军信息系统研制41孙家广194672制造系统信息化，计算机图形学、计算机辅助设计、软件系统建模、分析，国家信息化部，北京61张广军测试计量42孙优贤194078造纸、生物化工控制、在线优化、故障诊断、容错控制，浙大62张尧学计算机网络43谭久彬精密测量仪器63张钟华计量仪器仪表44王恩东计算机结构，浪潮计算机64赵沁平1948计算机软件与虚拟现实45王沙飞信号处理与信息安全65郑南宁1952人工智能、计算机视觉与模式识别46王天然194375智能机器人，机器人与工业自动化，沈阳66庄松林1940光电47韦钰(女)生物电子学，分子电子学48吴澄194078控制，复杂生产制造过程实时智能控制与优化49邬贺铨数字光纤通信50邬江兴通信、计算机网络51吴建平计算机网络52吴曼青雷达53吴伟仁遥感、测控、深空探测54吾守尔•斯拉木信息处理、网络安全55徐扬生195860机器人与智能控制，香港中文大学56许祖彦固态激光器57杨小牛信号处理58于全光纤通信、军队通信60余少华光纤通信、网络通信三、化工、冶金与材料工程学部(107人)钱锋九、工程管理学部(33人)曹耀峰  柴洪峰  陈晓红(女)  丁烈云  范国滨  胡文瑞  黄维和  金智新  凌文  刘德培  刘合  刘玠  刘人怀  卢春房  栾恩杰  邵安林  孙永福  王安  王基铭  王金南  王陇德  王玉普  向巧(女)  杨善林  赵晓哲  郑静晨  郑南宁  周建平2018科学院院士信息技术科学部（94人）包为民（1960，58岁，军队总装备，制导与控制）保铮  陈定昌  陈桂林  陈国良陈翰馥（1937，81岁，中科院，随机系统的能观性、不用初值的状态估计，最优随机奇异控制）陈俊亮  陈星弼  陈星旦  褚君浩戴汝为（1934左右，84岁，中科院，钱学森学生，自动控制、系统科学、思维科学、模式识别、人工智能）董韫美房建成（1965，53岁，北京航空航天，导航、制导与控制，姿态控制）干福熹  龚旗煌  顾瑛管晓宏(1955，63岁，四川泸州人，西安交大，电力系统，混沌系统，网络化系统)郭光灿郭雷（1961，57岁，中科院，随机自适应跟踪、极点配置与LQG控制）郝跃  何积丰  侯朝焕  侯洵怀进鹏（1962，56岁，山东人，北航，工业和信息化部，网络化软件技术与系统）黄宏嘉黄琳（1936，82岁，北大，统稳定性与控制理论，单输入系统极点配置定理，二次型最优控制）黄民强  黄如  黄维  简水生  姜杰  金亚秋  匡定波  雷啸霖李启虎（1939，79岁，中科院，水声信号处理和声纳）李树深  李未  李衍达  林惠民  刘国治  刘明  刘盛纲  刘颂豪  刘永坦  陆建华  陆汝钤  陆元九  吕建  毛军发梅宏（1963，55岁，贵州余庆人，北京理工，上海交大，计算机软件）彭堃墀  秦国刚  沈绪榜宋健（1931，67岁，工程院院长，最优控制系统理论）谭铁牛（1964，54岁，中科院自动化研究所，模式识别、图像处理和计算机视觉，人工智能学会）王家骐  王建宇   王立军  王启明王巍  王圩  王阳元  王永良  王育竹  王越  王占国  王之江吴朝晖（1966，52岁，浙大校长，复杂服务计算支撑平台，产生了重大经济与社会效益，脑机融合的混合智能）吴德馨吴宏鑫（1939，79岁，空间技术研究院，航天和工业领域的自适应控制和智能控制理论与应用）吴培亨  吴一戎  夏建白徐宗本（1955，63岁，西安交大副校长，智能信息处理、机器学习、数据建模）许宁生  薛永祺  杨德仁  杨芙清  杨学军  姚建铨  姚期智  尹浩张钹（1935，83岁，清华，控制理论，人工智能问题求解的商空间理论，解决不同粒度空间的问题描述、它们之间的相互转换以及复杂性分析）张景中张嗣瀛（1925，93岁，东北大学，控制理论，运动稳定性及最优控制）郑建华（1956，62岁，解放军保密委员会，复杂信息系统分析和相关基础理论，对该领域的序列论、函数论、算法设计与分析）郑耀宗  郑有炓  郑志明  周炳琨  周巢尘  周兴铭  周志鑫  朱中梁技术科学部（137人）蔡其巩   曹楚南   曹春晓   常青   陈维江   陈云敏   陈祖煜   成会明   程耿东程时杰（1954，64岁，华中科技大学，电力系统自适应控制，稳定性控制）丁汉  都有为   段文晖   范守善   方岱宁   高德利   高镇同   葛昌纯   顾秉林   顾诵芬   顾逸东   郭烈锦   郭万林   过增元   韩杰才   韩祯祥   何满潮   何雅玲胡海岩（1956，62岁，北京理工，振动控制系统的非线性动力学建模、稳定性与分岔分析）胡文瑞   胡聿贤   黄克智   姜中宏   金红光   金展鹏   赖远明   李济生   李述汤   李依依   李应红   林皋   刘宝镛   刘昌胜   刘广均   刘维民   刘竹生   柳百新   卢柯卢强（1936，82岁，清华，电力系统最优控制理论）路甬祥   雒建斌   闵桂荣   南策文   倪晋仁欧阳明高（1958，60岁，清华大学，湖北天门人，节能与新能源汽车动力系统，发动机电控高压柴油喷射）欧阳予   潘际銮   彭一刚   齐康   邱大洪   邱勇   任露泉   芮筱亭   申长雨   沈保根   沈志云   宋家树   宋振骐   孙家栋   孙钧唐   叔贤   陶文铨   滕锦光   田永君   汪耕   汪卫华   王补宣   王崇愚   王大中   王淀佐   王光谦   王立鼎   王希季   王锡凡   王曦   王自强   魏炳波   魏悦广   温诗铸   闻邦椿   吴承康   吴良镛   吴硕贤   伍小平   邢球痕   熊有伦   徐建中   徐性初   宣益民   薛其坤   闫楚良   严陆光   杨孟飞   杨叔子   杨伟   杨卫   杨槱   姚熹  叶恒强  叶培建   于起峰   余梦伦   俞大鹏   俞鸿儒   翟婉明   张楚汉   张清杰   张统一   张兴钤   张佑启   张泽赵   淳生   郑平   郑时龄   郑哲敏   钟万勰   周国治   周孝信   周远   朱荻   朱静   朱森元   朱位秋   祝世宁   庄逢辰   邹世昌   邹志刚©周东华和浙大孙优贤、褚健关系浙大培养的博士后中有四人（褚健、李平、陈思平、周东华）先后获“中国优秀博士后奖”"}
