{"content2":"人工智能从谷歌的阿尔法围棋（AlphaGo）赢了韩国围棋冠军李世石之后，开始火了。到了2017年5月，AlphaGo在赢了世界第一的柯洁之后，全世界都在讨论人工智能可能会给人类带来的影响。有人悲观地认为机器人会取代人类，也有人乐观地认为人类可以通过人工智能过上更幸福的生活。事实上人工智能已经在不断地改变人类的生活，比如我们经常使用的Cortana，或者是车牌人脸自动识别，乃至自动聊天客服机器人，都是人工智能的领域。人工智能当前的发展，主要分成下面几个子领域，包括视觉影像的自动处理，语音的自动处理，自然语言处理，知识管理等等。在每个领域都可以极大地提高处理能力，也让很多传统的职业消失。1， 视觉影像视觉是人类获取信息最大的渠道，也是人工智能最主要的研究方向，这些年包括人脸识别，车牌识别，场景识别，文字识别等等，都是这个领域中最重要的内容。从场景的角度来说，我们可以通过人脸识别来进行身份验证，通缉犯的抓捕，门禁系统管理甚至人的情感识别。这些信息的快速获得和处理，能够取代很多传统的工作，比如银行柜员，保安，一些警察的工作等等。在国内，大量的车牌自动识别系统已经部署在不同的停车场，加上移动支付的全面普及，停车场收费这个工作岗位也基本上要消失了。文字识别也是被广泛地应用在了翻译领域，以前我们旅游的时候要翻字典，现在可以直接用手机摄像头对着不明白的文字，自动翻译成想要的语言。当前计算机视觉处理的能力已经超过了普通人，除去计算机处理速度不谈，在分辨物体细微差别和存在干扰的图像中，计算机图像处理的错误率也已经低于5%，超过人眼和大脑的处理能力。2.语音当前在语音领域的最大应用就是速记和同声传译，另外还有说话人识别的功能。以前我们有专业的速记来记录现场的会议纪要，说话的内容等等。高级别的会议还需要专业的翻译人员提供现场的同声传译，不过人工智能如果发展到一定程度，会把这两部分的工作完全取代掉，毕竟人不是机器，需要休息，还会有出错的情况，而机器则完全不会出错。语音有一个另外的功能就是智能音响的唤醒词。Amazon，微软，谷歌以及国内的阿里，京东都先后推出了智能音箱，通过一个唤醒词，比如Hi Siri, Alex, Dingdong Dingdong来激活音响，并通过语音识别和人直接进行交互，比如询问天气，新闻，控制家电等等。这种弱人工智能的应用，会在最近的几年快速地进入千家万户。3.语言语言类的人工智能主要是解决机器对自然语言的理解，比如理解语言的观点，倾向性和主题等等。语言理解的应用主要集中在智能聊天机器人，自动摘要等。比如当前我们很多银行，电子商务购物网站的客服，其实都是由自动聊天机器人充当的。很多报社，新闻网站的新闻，其实也是通过自动摘要机器人直接写出来的。另外很多案件的案例查找，类似案例的判例查找，都是通过语言理解的机器人来自动实现。造成的后果就是很多初级的客服人员，初级的报社编辑甚至初级律师的失业。4. 知识人工智能在知识领域的进展是真正颠覆人类的部分，比如在一开头我们提到的AlphaGo，在下棋的时候下出了一些传统棋谱中完全没有出现的招式，最后赢得胜利。自动聊天机器人逐步发展出各种种族歧视，Facebook的聊天机器人还发展出一些人类不能理解的语言。凡此种种，都让悲观主义者觉得人工智能不可控。不过当前我们也不必杞人忧天，杯弓蛇影。人工智能的发展还远远达不到能够颠覆人类的地步，知识领域的人工智能也实现特定领域的分析。在医疗领域，人工智能可以通过分析大量的数据研究病人的MRI图像，对病人的情况进行诊断。在金融领域，人工智能的智能决策可以决定对一只股票是买入还是卖出，从而获得收益。在生物科学，医药领域，人工智能的智能学习算法能够帮助科研人员选择研究的方向。在社交领域，对各种社交媒体的文本和相关内容进行情感分析，能够了解一群人对某一些事情的倾向性。在这些领域中，人工智能已经实实在在地开始改变人类的发展方向。快速实现自己的人工智能讲了那么多，其实当前人工智能的能力还集中在弱人工智能的阶段，即解决简单的智能问题，计算机实现的智能还完全无法和人类相比。随着云计算的出现，大量的人工智能问题其实可以非常简单地通过云计算平台解决。比如我们刚才提到的视觉图像处理，在微软Microsoft Azure平台上，可以直接用分析图像的API获得每个人脸的位置，性别，表情等等信息。调用起来也非常简单，直接调用https://[location].api.cognitive.microsoft.com/vision/v1.0/analyze[?visualFeatures][&details][&language] 通过使用Http Post以及一些相应的参数，包括图像的分类，是否要识别人脸，是否识别成人或种族内容，以及识别名人。调用完这个API以后，如果成功，我们会获得200的返回，同时加上一段Json格式的字符串，里面描述了所有的相应内容，包括人脸的位置，颜色，是否为成人内容等等。具体的内容可以参考https://azure.microsoft.com/zh-cn/services/cognitive-services/computer-vision/再举个例子，如果我们想做翻译软件，以前是非常复杂的，需要处理各种数据。当有了云计算以后，我们就可以直接使用云计算提供的翻译API实现自己想要的内容。通过微软的翻译服务https://docs.microsofttranslator.com/text-translate.html#!/default/get_Translate 我们可以通过Get方法调用https://api.microsofttranslator.com/V2/Http.svc/Translate，同时提供源语言和目标语言获得专业的翻译结果。微软提供的人工智能API服务当前，微软Azure平台提供5大类30小类人工智能的API，包括影响，语音，语言，知识和搜索五大类。影响里的算法可以帮助自动审查内容，通过返回人脸、图像和情绪等智能见解构建更人性化的应用。包括计算机影像 API，人脸 API，内容审查器，情感 API，视频 API，自定义影像服务以及视频索引器。语音算法包括处理应用程序中的口述语言，例如翻译工具语音 API，说话人识别 API，必应语音 API和自定义语音服务。语言API包括了处理自然语言、评估观点和主题，并了解如何识别用户需求的功能，包括语言理解智能服务，文本分析 API，必应拼写检查 API，翻译工具文本 API，Web 语言模型 API和语言分析 API。而知识的人工智能领域则可以完成规划复杂的信息和数据，以解决智能推荐和语义搜索等任务，包括建议 API，学术知识 API，知识探索服务，QnA Maker API，实体链接智能服务 API和自定义决策服务，最后搜索则是调用了大量必应搜索的API，比如必应自动推荐 API，必应图像搜索 API，必应新闻搜索 API，必应视频搜索 API，必应 Web 搜索 API，必应自定义搜索，必应实体搜索 API。值得一提的是，微软的Azure云服务平台还有一个基于人工智能的云计算实验室项目，对于一些对领先技术有兴趣的读者，可以尝试这些不同的应用并进行反馈。主要有：• 布拉格项目 基于手势的控制• 约翰内斯堡项目 物流路线• 阿布达比项目 距离矩阵• Project Nanjing 等时线计算• 库斯科项目 与维基百科条目相关的活动• 伍伦贡项目 位置见解比如布拉格项目就可以通过Kinect的摄像头和不同手势来控制对象的变化和行为。我们可以用短短的几行代码，就可以自定义手势并且实现相应的功能，比如下面这段代码就可以实现识别手势旋转和让对象旋转的功能。我们可以访问https://azure.microsoft.com/zh-cn/services/cognitive-services/ 获得所有完整的的信息。结语我们并无法预期何时机器可以超过人类，不过机器的智能发展速度要远远快于人类进化的速度。随着奇点的到来，人类在很多智力上会大大落后于机器。云计算就是人工智能的发动机。作为开发者和技术人员，可以通过云的能力，把人工智能集成到自己的应用中去，帮助人类利用好人工智能的能力，让我们的生活越来越美好。"}
