{"content2":"人工智能赋予了哪些以“未来之眼”？\n5月11日，由张江高科技园区管委会主办的张江发布“人工智能，慧聚张江”系列活动之“未来之眼”专场在创智空间成功举办。本次活动聚焦人工智能计算机视觉领域，邀请业内知名企业亮风台、阅面科技、图漾科技、禾赛科技、纵目科技和叠境科技，大咖新秀齐聚一堂，纵论人工智能新“视”力。\n众所周知，人类 80%以上的信息都是来源于视觉，而机器对视觉的依赖则更大，达到了 90%以上。计算机视觉作为人工智能行业关键的细分领域，正在快速发展。今年3月，英特尔斥资150 亿美元收购以色列计算机视觉公司Mobileye，在AI领域引起广泛关注，“未来之眼”的时代是否已经到来？\n何为“未来之眼”？人工智能赋予人类的AR/VR即是“未来之眼”，人工智能赋予汽车的无人驾驶/自动驾驶即是“未来之眼”，人工智能赋予机器的视觉即是“未来之眼”。\nVR/AR——人工智能赋予人类的“未来之眼”\n亮风台联合创始人 凌海滨\n亮风台是一家专注于AR领域的企业，致力于帮助人类增强对现实的感知，公司在AR领域深耕多年后在软硬件方面均取得可喜成果，软件产品已经覆盖到7亿用户，其自主研发的AR智能眼镜HiAR Glasses获得有“设计界奥斯卡”之称的德国红点奖。\n在张江，亮风台是一家不折不扣的网红公司，不管是之前和腾讯QQ合作里约奥运火炬传递活动，还是4月份和支付宝达成上线AR入口的战略合作，都引起了一阵媒体的轰动。这次活动，亮风台联合创始人、首席科学家凌海滨教授给我们带来了“AR之路，未来已来”的主题演讲，给我们带了不小震动。他指出，下一代的计算机平台一定是让用户突破屏幕，touch到虚拟之物，形成人与物的自然交互。而这就是亮风台一直在实践和努力的方向。\n如果说亮风台的AR技术增强了人类对现实世界的虚拟体验，但眼睛在看世界的时候，离不开光亮，只有透过光，才能更真实的感受世界，而这，正是叠境科技正在做的事情——通往虚拟现实的光场之路。\n叠境数字科技科学家 高盛华\n叠境科技建立了一整套以光场采集、捕捉、显示为核心的VR/AR解决方案，将全球最顶尖的光场技术引入虚拟现实领域，给人们带来最真实、自然的虚拟体验，大大解决了虚拟现实体验差的问题，也给虚拟现实带来了巨大的变革。\n叠境科技科学家高盛华出席本次活动并做主题分享：“Giving V/AR Eyes and Brain”。他说，\n叠境利用光场技术，直接在三维空间里拍下战马照片，将拍到的多张照片先进行图形渲染，然后再通过计算机视觉建立战马模型，最终在虚拟现实中，呈现出一个立体有色彩的唐三彩战马，提高人类眼睛的真实观感。\n值得一提的是，VR直播风起云涌的今年，在伊利新品“酪艺”的推介会上，“宁泽涛”+“VR直播”这对高颜值和高科技CP组合依托叠境科技独有的360 3D VR直播解决方案，使直播真实可感，在天猫直播平台引起了不小轰动。这次合作令叠境科技在VR直播界一战成名。\n自动驾驶/无人驾驶——人工智能赋予汽车车的“未来之眼”\n自动驾驶/无人驾驶作为人工智能的重点发展方向，它的核心痛点在于环境识别和激光雷达传感器。在全球各大车企和芯片企业都在激烈角逐时，中国企业已经取得出了傲人的战绩，它们利用各自的技术优势，能够给汽车装上一双“慧眼”。\n纵目科技创始人 唐锐\n纵目科技着力解决用户在低速场景和最后100米驾驶过程中的痛点，公司研发的环视ADAS（高级驾驶辅助系统）系统，通过设计一个庞大的数据系统，对路况进行采集和标注，实现全景泊车、信息报警、车道偏移、盲区监测、行人检测、障碍物识别等功能。\n纵目科技创始人唐锐在“适应中国市场的纵目自动驾驶之路”的主题演讲中指出，公司选择从环视ADAS（高级驾驶辅助系统）切入自动驾驶领域，未来会增强ADAS技术对环境的感知和道路地图构建与定位，解决用户最后100米、500米、1000米的停车问题以及帮助车主实现在停车场下车，汽车能自主寻找到车位停车与自动接人的功能。\n禾赛科技CEO 李一帆\n自动驾驶的终极目标是无人驾驶。禾赛科技则专注研发无人车的“眼睛”——激光雷达。熟悉汽车行业的人都知道，激光雷达传感器成本高，货源紧张，是无人车大战中名副其实的兵家必争之地。禾赛科技最新发布的用于自动驾驶的40线混合固态激光雷达Pandar40，改变了自动驾驶激光雷达行业被国际巨头垄断而且需要半年以上交货周期的现状，因此受到国内外无人车行业的密切关注。公司昨日宣布获得了1.1亿元人民币的A轮融资，这是我国本土激光雷达所获得的单笔最大金额融资。\n同时，禾赛科技的创始人李一帆也是一位不折不扣的网红CEO，它的主题演讲 “激光雷达—无人车的‘眼睛’”也受到现场观众的热烈欢呼。他指出，禾赛科技研发的激光雷达，通过多线扫描能够投射到道路上任何物体，然后将数据反馈给激光传感器。汽车可以规避周围任何人、车辆与其它障碍物，最终实现无人驾驶。\n机器视觉——人工智能赋予机器的“未来之眼”\n机器视觉是人工智能正在快速发展的一个分支，简单来说，机器视觉就是用机器代替人眼来做测量和判断，但其功能范围不仅包括人眼对信息的接收，同时还延伸至大脑对信息的处理与判断。\n图漾科技创始人费浙平\n图漾科技创始人费浙平在活动中发表“3D视觉的兴起”主题演讲，他说：黑夜给了我黑色的眼睛，我却用它研究机器的眼睛。图漾科技研发的深度摄像头，基于XYZ坐标，要给机器装一双3D的眼睛。\n目前，深度摄像头不仅应用在机器人、安防、无人机、工业等领域，实现室内机器人走路不撞墙、监控无死角、无人机导航避障、检测包裹大小和仓库空间等场景，在未来还将应用到VR/AR行业，与真实环境完美融合，实现脸部识别、手势识别和3D头像生成等新功能，从而引发VR内容应用革命。\n视觉有三个层次，与生俱来、后天习得和专业学习。从算法到视觉模块，阅面科技要开启本能化的机器视界。\n阅面科技创始人赵京雷\n阅面科技创始人赵京雷在“开启机器新视界”的主题演讲中表示，阅面科技为用户提供以智能算法为核心的嵌入式人工智能平台，通过一体化解决方案解决智能机器人脸识别、手势识别以及视觉追踪等的视觉识别问题，使开发者更加便捷地通过该平台接入人机交互的技术。目前，阅面科技已和一些比较有代表性的服务性机器人企业展开深度合作，在智能家居、智能车载和智能手机领域均有客户合作。\n人工智能企业扎根上海，张江优势何在？\n不仅有精彩的演讲，还有热烈的讨论。围绕着AI行业的发展，6位嘉宾唇枪舌剑，好不热闹。当嘉宾主持高盛华博士提问“人工智能企业扎根上海，张江有何优势”时，各位嘉宾各抒己见，又有共识。在人工智能领域，张江有丰厚的高校资源和相当人才的积累，特别是在人工智能亟需的芯片领域，张江有完善的产业链条和丰富的人才梯队，这构成了张江后发制人的一个潜在优势，假以时日，张江一定能够成为人工智能产业高地。\n值得一提的是，本次活动的协办方上海科技大学虚拟现实和视觉计算中心即将于7月2日在上海科技大学举办一场国际AI行业盛会。届时，创新工场、360、今日头条、商汤科技、地平线机器人等诸多国内知名企业将齐聚一堂，共同探讨AI行业的发展。\n原文发布时间：2017-05-12 13:37\n本文作者：张江\n本文来自云栖社区合作伙伴镁客网，了解相关信息可以关注镁客网。"}
