{"content2":"在当下的人工智能浪潮之中，中国和美国作为牌桌上两位手握最多筹码的玩家，彼此之间有许多相似，也有许多不同。尤其在人工智能技术从学术到产业再到商业的这一步上，美国的高校起到了更强大的背书作用。\n李飞飞、LeCun这些名字的影响力离不开他们的学术背景，科学家们在实验室项目和企业上的建树也会加强高校自身的影响力。可不管从世界范围，还是中国本土来看，即使中国的计算机视觉、自然语言处理技术已经在一些竞赛上名列前茅，中国高校却没能“沾上光”，提到人工智能的主导者，人们直觉中还想到的是百度这类企业，或是李开复这类资本界明星，而不是哪一所高校的实验室。虽然现在很多学校都在抓紧开设人工智能、机器学习相关专业，可从现状来看，比起学术驱动，中国人工智能更接近于资本驱动和大企业驱动。\n斯坦福为什么会成为斯坦福？\n那么为什么一提到人工智能，我们就会想到斯坦福、MIT、伯克利这些美国高校呢？\n第一点是办学制度上的根本差异。斯坦福这类老牌私立高校学费高昂，校中的学生不光脑子好，而且还有钱，其中很多人还是已经占据社会优质资源的Old Money。综合其他部分原因，在斯坦福这类私立高校中创业氛围和学术氛围都可以更加浓厚和纯粹，所以才会有“斯坦福一所学校撑起整个硅谷”的说法。这些学校中也出来了很多明星企业家和投资人，像来自斯坦福的Peter Thiel等。\n也就是说在人工智能浪潮出现之前，美国就有很多高校和企业、VC联系十分紧密了，当人工智能受到关注后，更方便了他们把来自高校的研究成果贩卖给企业。\n第二点则是，我们不得不承认在整体办学水平和学术能力上，美国高校还是高出中国不少的。这里的能力不仅仅指的是论文和实验室研究成果，也包括一些社会各界都可以应用的开源项目。比如李飞飞的ImageNet和最近斯坦福公布的医疗图像大数据Medical ImageNet。这些开源项目可以清晰的告诉企业和社会，高校在做什么和能做到什么。\n强大的学术能力以及和社会、企业间的紧密联系，让这些高校中的实验室、教授和研究成果更受关注，最后这些高校的名字甚至变成了一种认证标志，印上了这个标志，人们就会相信企业会有足够和持续的技术能力供给。\n科技博客和“荣誉园地”\n除了以上几点之外，中国人工智能产业还存在一个最大的问题，就是高校方面缺乏对技术成果的基本宣传意识。\n以下是伯克利人工智能研究的官方博客：\n可以看到博客中的大部分内容是对伯克利人工智能方面研究最新成果的介绍，读者可以通过简单的语言了解到伯克利的种种新发现和新尝试，如果感兴趣的话，还能通过链接跳转看完整篇论文。\n而以下则是中科大计算机技术学院主页上有关科研信息的部分：\n先不说整个内容更新频率和页面设计的美观程度，我们可以清晰的看到中科大在科研宣传方面还停留在“XX专家来访”、“我校师生获得XX荣誉”等等方面。不知道是因为校方认为奖项是比学术成果更值得宣传的东西，还是认为没人看得懂学术介绍。但结果就是，象牙塔越盖越严，人们可以模糊的理解到高校在学术上已经达到了很高的水平，但不知道他们的研究成果已经可以解决什么问题。所谓的产学结合也只能靠高薪聘请相关专业的教授博士，到企业内部再进行。\n即使不在国际上比较，从学科上来看人工智能的技术宣传手法也相当落后。《我在故宫修文物》、《国家宝藏》等等节目都在用新的传播形式向普罗大众介绍考古、历史方面的知识，人工智能却只能靠企业推出的机器人在问答节目中刷存在感。\n总之中国高校几乎不会去主动向外介绍自己的学术研究成果，而当外界主动向他们寻找学术研究成果时，也会困难重重。\n走穴的教授或许才是中国AI的守护者\n想解决这种现状无非依靠几种办法：第一是加强校企合作，通过产业方面的深入合作让企业率先了解高校的学术成果，再通过企业的宣传口径传达出去；第二是校方自己开辟学术展示窗口，不管是像伯克利那样简简单单的推出一个记录性质的博客，还是像《国家宝藏》那样贴近大众的节目，都会是不错的选择；第三是由政府介入，帮助高校走进企业和孵化器，进行研究成果变现。在法国、以色列等国家都有类似政策，政府或者为高校的研究成果买单，或者帮助教授、博士走入创业企业。\n不过由于种种不可抗力影响，目前看来只有通过校企合作来提高高校学术成果知名度是最靠谱的。在众多高校中，中科大算是走到了学术驱动的前列，走出了科大讯飞和寒武纪两家堪称现象级的AI企业。同时清华、浙大等高校因为地缘优势，未来也更有可能和企业进行密切的合作。可即使是这样，中国高校在人工智能行业中的存在感还是远远不够。\n或许文人风骨已经深深烙印在了中国人的心中，我们总把学术二字和“清贫”、“俭朴”等等关键词联系在一起，仿佛教授们涉足了商业，就会玷污了学术的纯洁性。要是有哪个教授上了几个电视节目，或多几个地方开开讲座，就会被酸溜溜的冠上“走穴”二字。这何尝不是一种偏见呢？\n我倒是希望，中国能多几个四处走穴的教授，真真切切的告诉大家中国AI不仅仅意味着高薪和大笔融资，也真实的发生在实验室中，并且在一点点的进步着，足以支撑整个行业在未来五年、十年甚至三十年发展。中国AI已经有了太多鼓风人，我们需要的或许是从象牙塔中走出来的守护者。"}
