{"content2":"一、计算机视觉Divid Marr将计算机视觉系统的开发问题归纳为3个要素：（1）数学理论考虑数学计算层面的目标及可以引入的合理约束条件。（2）描述和算法重点解决计算机视觉中的输入输出的数据格式问题，并设计合理的算法实现其系统功能。（3）硬件的合理使用使用符合算法要求的硬件并考虑该硬件对所需要的算法和描述的反作用。计算机视觉系统框架1.1 图像数据处理层对图像像素或者频域进行相应处理，比如图像获取、传输、压缩、降噪、装换、存储、增强和复原等。1.3图像识别获取层图像识别是指利用计算机对图像进行处理、分析和理解，以识别不同模式的目标和对象的技术，主要包括图像匹配和机器学习。图像匹配的研究内容大致集中在三个方面：特征空间；相似性度量；搜索策略机器学习：是一门人工智能的科学，该领域的主要研究的是人工智能，特别是如何在经验学习中改善具体算法的性能。研究如何使用计算机模拟或实现人类的学习活动。二、模式识别广义上来说，模式是供模仿用的完美无缺的标本，通常，把通过对具体的个别事物进行观察所得的具有时间和空间分布的信息称之为模式；而把模式所属的类别或同一类中模式的总体称之为模式类。模式识别是对表征事物或现象的各种形式的（数值的、文字的和逻辑关系的）信息进行处理和分析，以对事物或现象进行描述、辨认、分类和解释的过程，是信息科学和人工智能的重要组成部分。模式识别主要集中在两个方面，一是研究生物（包括人）是如何感知对象的，二是在给定的任务下，如何用计算机实现模式识别的理论和方法。人工智能是专门研究用机器人模拟人的动作、感觉和思维过程与规律的一门科学，而模式识别则是利用计算机专门对物理量及其变化过程进行描述与分类，通常用来对图像、文字、相片以及声音等信息进行处理、分类和识别。模式识别系统模式识别方法：1.统计模式识别2.结构模式识别3.模糊模式识别4.人工神经网络模式识别5.模板匹配模式识别6.支持向量机的模式识别三、人工智能美国斯坦福大学著名的人工智能研究中心尼尔逊教授这样定义人工智能“人工智能是关于知识的学科---怎样表示知识以及怎样获取知识并使用知识的学科”，另一名著名的美国MIT的winston教授认为“人工智能就是研究如何使计算机去做过去只有人才能做的智能工作”。人工智能的研究与应用：问题求解专家系统机器学习神经网络模式识别人工生命未完待续。。。。。。。。。。。。。。。。。。。。参考文献[1]许志杰,王晶,刘颖,范九伦. 计算机视觉核心技术现状与展望[J]. 西安邮电学院学报,2012,06:1-8.[2]王道累,陈军,吴懋亮. 计算机视觉原理分析及其应用[J]. 上海电力学院学报,2016,03:283-287.[3]范会敏,王浩. 模式识别方法概述[J]. 电子设计工程,2012,19:48-51.计算机视觉补充：计算机视觉与机器视觉计算机视觉是一门研究如何使机器“看”的科学，更进一步的说，就是是指用摄影机和电脑代替人眼对目标进行识别、跟踪和测量等机器视觉，并进一步做图形处理，使电脑处理成为更适合人眼观察或传送给仪器检测的图像。计算机视觉也可以看作是研究如何使人工系统从图像或多维数据中“感知”的科学。它的最终研究目标就是使计算机能象人那样通过视觉观察和理解世界，具有自主适应环境的能力。机器视觉就是用机器代替人眼来做测量和判断。机器视觉系统是通过机器视觉产品(即图像摄取装置，分CMOS和CCD两种)将被摄取目标转换成图像信号，传送给专用的图像处理系统，得到被摄目标的形态信息，根据像素分布和亮度、颜色等信息，转变成数字化信号;图像系统对这些信号进行各种运算来抽取目标的特征，进而根据判别的结果来控制现场的设备动作。从学科分类上，二者都被认为是ArtificialIntelligence下属科目，不过计算机视觉偏软件，通过算法对图像进行识别分析，而机器视觉软硬件都包括(采集设备，光源，镜头，控制，机构，算法等)，指的是系统，更偏实际应用。简单的说，我们可以认为计算机视觉是研究“让机器怎么看”的科学，而机器视觉是研究“看了之后怎么用”的科学。随着硬件、算法及大数据的不断发展，整个人工智能领域面临前所未有的规模增长，也促使了国外的许多创业公司被大公司收购。5月，美国亚马逊公司收购了一支欧洲顶级机器视觉团队用于无人机领域研究。无独有偶，英特尔收购了俄罗斯计算机视觉公司Itseez，用于无人驾驶领域。ARM宣布以3.5亿美元收购英国嵌入式计算机视觉技术公司Apical。此前，Snapchat收购计算机视觉公司Seene;Pinterest收购视觉创业公司VisualGraph;Twitter收购基于深度学习的计算机视觉创业公司Madbits。同时图像识别的能力越来越强，错误率越来越低，国内也陆续爆发了大批优秀的计算机视觉(ComputerVision)创业公司。1、旷视科技：让机器看懂世界北京旷视科技有限公司成立于2012年11月，公司专注于人脸识别技术和相关产品应用研究，面向开发者提供服务，能提供一整套人脸检测、人脸识别、人脸分析以及人脸3D技术的视觉技术服务，主要通过提供云端API、离线SDK、以及面向用户的自主研发产品形式，将人脸识别技术广泛应用到互联网及移动应用场景中。Face++通过和众多互联网公司合作，并通过“脱敏”技术掌握到了500万张人脸图片数据库，在互联网图片人脸识别LFW的准确率达到99.6%，合作伙伴包括阿里、360等一批大型的图片、社交、设备类企业。2、云从科技：源自计算机视觉之父的人脸识别技术广州云从信息科技有限公司(简称云从科技)是一家专注于计算机视觉与人工智能的高科技企业，核心技术源于四院院士、计算机视觉之父——ThomasS.Huang黄煦涛教授。核心团队曾于2007年到2011年6次斩获智能识别世界冠军，得到上市公司佳都科技与香港杰翱资本的战略投资。公司主要技术团队来自中国科学院重庆分院，是中科院研发实力最雄厚的人脸识别团队，并作为中科院战略性先导科技专项的唯一人脸识别团队，代表参与了新疆喀什等地安防布控。3、格林深瞳：让计算机看懂世界格灵深瞳是一家将计算机视觉和深度学习技术应用于商业领域的科技公司，自主研发的深瞳技术在人和车的检测、跟踪与识别方面居于世界领先水平。公司借助海量数据，让计算机像人一样看懂这个世界，实时获取自然世界正在发生的一切，打造自然世界的搜索引擎。"}
