{"content2":"获取到的 知识点1SpringBatch-记一次批处理优化过程：复合读，非常干的干货个人博客搜集自己每天的知识点。了解。并慢慢的研究最新的热点新闻知识点2  AI 大数据算法深度学习框架——CaffeCaffe是基于表达体系结构和可扩展代码的深度学习框架，被推崇的原因是其处理速度。人工智能的智能化需要通过大数据和机器算法来实现，不可避免的要分析海量数据。而Caffe可以在一天之内处理六千多万个图像，并且只需要一个NVIDIA K40 GPU来处理。语音识别工具——CNTKCNTK由Computational Network Toolkit的缩写而来，是由微软开源的人工智能工具，主要用于语音识别，并且在机器翻译、图像识别、图像字幕、语言理解、文本处理和语言建模上都能够带来帮助。CNTK的特点是无论机器上有单个CPU还是单个GPU，或者有多个GPU，或者在有多个GPU的多个机器上都能够很好的运行。深度学习库——Deeplearning4jDeeplearning4j是JVM开源的深度学习库，可以配置深度神经网络，既可以在分布式环境中运行，并且可以集成在Hadoop 和 Apache Spark 中。Deeplearning4j的特点是能够和Java、Scala和其他JVM语言兼容。分布式机器学习工具——DMTKDMTK是Distributed Machine Learning Toolkit的缩写，同样是微软开源的人工智能工具，用户大数据的应用程序。DMTK的的作用是能够加快对人工智能系统的训练，主要有DMTK框架、LightLDA主题模型算法和分布式字嵌入算法三个组件组成。DMTK对人工智能系统的训练速度非常快，曾经微软用100万个主题和1000万个单词的词汇表训练一个主题模型，在文档中收集了1000亿个符号。智能分析工具——H20H20有很多的公司客户，比如思科、PayPal、泛美等等，H20主要用户预测建模、风险欺诈分析、保险分析、广告技术、医疗保健和客户情报分析等。针对企业服务的版本需要付费，同时也有标准版，被集成在Apache Spark 中。机器学习框架——MahoutMahout是一个开源的机器学习框架，主要有三个特性，其一是构建可以扩展算法的编程环境，第二是像H20一样预制算法工具，第三是一个矢量数学实验环境，被叫做Samsara。现在Mahout被Adobe、英特尔、领英、Twitter、雅虎等很多公司使用。机器学习库——MLlib提到MLlib就不得不提Apache Spark，Apache Spark因为速度快被誉为最流行的大数据处理工具，而MLlib是Spark的可扩展机器学习库。MLlib包括很多机器学习算法，像分类、决策树、功能转换、回归、生存分析、集群、主题建模、推荐、频繁项集、ML 管道架构、统计、分布式线性代数等等。MLlib的特点是集成了Hadoop 并可以与 NumPy 和 R 进行交互操作。分层暂时记忆——NuPICNuPIC 是一个基于分层暂时记忆Hierarchical Temporal Memory，也就是HTM理论的开源人工智能项目。HTM的目标是创造一个在许多认知任务上接近或者比人类的认知能力表现更好的机器，想要创建一个计算机系统来模仿人类大脑皮层活动。神经网络算法编程库——OpenNNOpenNN是一个c++编程库，作用是实现神经网络算法。OpenNN的特点包括深度的架构和很高效的性能。在OpenNN的网站上有很多神经网络的文档，比如解释深情网络基本知识的入门教程，是一个具有高级理解力的人工智能工具。常识推理引擎——OpenCycOpenCyc由Cycorp开发，提供了对Cyc知识库的访问和常识推理引擎。OpenCyc有大约24万个条目，大约200万个三元组合大约7万个owl，OpenCyc是一个类似于链接到外部语义库的命名空间。OpenCyc主要应用在富领域模型、语义数据集成、文本理解、特殊领域的专家系统和游戏AI中。机器学习应用程序框架——Oryx 2Oryx 2构建在Apache Spark 和 Kafka 的基础上，是专门针对大规模机器学习的应用程序开发框架。Oryx 2的架构是一个独特的三层 λ 架构，主要应用是可以创建新的应用程序，还有一些预先构建的程序用于常见的大数据任务。预测引擎——PredictionIOPredictionIO可以用在创建有机器学习功能的预测引擎，用于部署实时动态查询的Web服务。高等数学运算——SystemMLSystemML提供了一个高度可伸缩的平台，能够实现高等数学运算，现在是Apache的一个大数据项目。SystemML的算法用R或者类似但并不是python的语法写成，可以在Spark和Hadoop上运行，现在已经应用在跟踪客户、规划机场交通等方面。数值计算库——TensorFlowTensorFlow由谷歌开源，是一个能够使用数据流图进行数据计算的库，有很好的灵活性、可移植性、自动微分贡呢，还支持Python和c++语言，可以运行在有单或者多个CPU和GPU的系统甚至是移动设备上。科学计算框架——TorchTorch的特点是灵活度高和速度快，可以用户机器学习、计算机视觉、信号处理、并行处理、音视频及图像等方面。人工智能领域仍然处于探索和创新领域，对于人工智能工程师来说，除了要考虑技术实现方式，更重要的其实是人工智能的应用思路。在第六届TOP100软件案例研究峰会的榜单中，有很多人工智能的相关话题入围。比如美国普渡大学将风控技术应用于个人信贷领域，微软将增强学习应用于商业模型，NFCU银行利用AI进行资产管理方式的转型，宜人贷将人工智能应用于反欺诈，东软将物联网智能分析用于设备维护等等案例。第六届TOP100软件案例研究峰会于11月9日-12日在北京国家会议中心举办，可通过TOP100头条号或官方网站领域现场免费体验票，通过这些人工智能已落地的实践经验，对人工智能的应用带来启示。"}
