{"content2":"计算机视觉领域研究资源及期刊、会议介绍依照下面目录整理：[1]研究群体(国际国内)、专家主页[2]前沿国际国内期刊与会议[3]搜索资源[4]GPL软件资源一、研究群体作机器视觉和图像处理方面的研究工作，最重要的两个问题：其一是要把握住国际上最前沿的内容；其二是所作工作要具备很高的实用背景。解决第一个问题的办法就是找出这个方向公认最高成就的几个超级专家(看看他们都在作什么)和最权威的出版物(阅读上面最新的文献)，解决第二个问题的办法是你最好能够找到一个实际应用的项目，边做边写文章。 做好这几点的途径之一就是利用网络资源，利用权威网站和专家们的个人主页。依照下面目录整理：[1]研究群体(国际国内)[2]专家主页[3]前沿国际国内期刊与会议[4]搜索资源[5]GPL软件资源一、研究群体用来搜索国际知名计算机视觉研究组(CV Groups)：国际计算机视觉研究组清单http://peipa.essex.ac.uk/info/groups.html美国计算机视觉研究组清单 http://peipa.essex.ac.uk/info/groups.html#USAhttp://www-2.cs.cmu.edu/~cil/vision.html或 http://www.cs.cmu.edu/~cil/vision.html这是卡奈基梅隆大学的计算机视觉研究组的主页，上面提供很全的资料，从发表文章的下载到演示程序、测试图像、常用链接、相关软硬件，甚至还有一个搜索引擎。著名的有人物Tomasi， Kanade等。卡内基梅隆大学双目实验室http://vision.middlebury.edu/stereo/卡内基梅隆研究组http://www.cs.cmu.edu/~cil/v-groups.html还有几个实验室：Calibrated Imaging Laboratory 图像Digital Mapping Laboratory 映射Interactive Systems Laboratory 互动Vision and Autonomous Systems Center视觉自适应http://www.via.cornell.edu/康奈尔大学的计算机视觉和图像分析研究组，好像是电子和计算机工程系的。侧重医学方面的研究，但是在上面有相当不错资源，关键是它正在建设中，能够跟踪一些信息。Cornell University——Robotics and Vision grouphttp://www-cs-students.stanford.edu/ 斯坦福大学计算机系主页1. http://white.stanford.edu/2. http://vision.stanford.edu/3. http://ai.stanford.edu/美国斯坦福大学人工智能机器人实验室The Stanford AI Lab (SAIL) is the intellectual home for researchers in the Stanford Computer Science Department whose primary research focus is Artificial Intelligence. The lab is located in the Gates...Vision and Imaging Science and Technologyhttp://www.fmrib.ox.ac.uk/analysis/主要研究：Brain Extraction Tool， Nonlinear noise reduction， Linear Image Registration， Automated Segmentation， Structural brain change analysis， motion correction， etc.http://www.cse.msu.edu/prip/—密歇根州立大学计算机和电子工程系的模式识别--图像处理研究组，它的FTP上有许多的文章(NEW)。美国密歇根州大学认知模型和图像处理实验室The Pattern Recognition and Image Processing (PRIP) Lab faculty and students investigate the use of machines to recognize patterns or objects. Methods are developed to sense objects， to discover which...http://www.cse.msu.edu/rgroups/prip/http://pandora.inf.uni-jena.de/p/e/index.html德国的一个数字图像处理研究小组，在其上面能找到一些不错的链接资源。柏林大学 http://www.cv.tu-berlin.de/德国波恩大学视觉和认识模型小组Computer Vision Group located within the Division III of the Computer Science Department in the University of Bonn in Germany. This server offers information on topics concerning our computer vision http://www-dbv.informatik.uni-bonn.de/http://www-staff.it.uts.edu.au/~sean/CVCC.dir/home.htmlCVIP(used to be CVCC for Computer Vision and Cluster Computing) is a research group focusing on cluster-based computer vision within the Spiral Architecture.http://cfia.gmu.edu/The mission of the Center for Image Analysis is to foster multi-disciplinary research in image， multimedia and related technologies by establishing links between academic institutes， industry and government agencies， and to transfer key technologies to help industry build next generation commercial and military imaging and multimedia systems.英国的Bristol大学的Digital Media Group在高级图形图像方面不错。主要就是涉及到场景中光线计算的问题，比如用全局光照或是各种局部光照对高动态图的处理，还有近似真实的模拟现实环境 (照片级别的)，还有用几张照片来建立3D模型(人头之类的)。另外也有对古代建筑模型复原。http://www.cs.bristol.ac.uk/Research/Digitalmedia/而且根据Times全英计算机排名在第3， 也算比较顶尖的研究了http://www.cmis.csiro.au/IAP/zimage.htm这是一个侧重图像分析的站点，一般。但是提供一个Image Analysis环境---ZIMAGE and SZIMAGE。麻省理工视觉实验室MIT http://groups.csail.mit.edu/vision/welcome/AI Laboratory Computer Vision groupCenter for Biological and Computational LearningMedia Laboratory， Vision and Modeling GroupPerceptual Science groupUC Berkeley http://0-vision.berkeley.edu.ilstest.lib.neu.edu/vsp/index.htmlhttp://www.cs.berkeley.edu.ilste ... n/vision_group.html加州大学伯克利分校视觉实验室David A. Forsyth：http://www.cs.berkeley.edu/~daf/UCLA(加州大学洛杉矶分校) http://vision.ucla.edu/ 视觉实验室英国牛津的A.Zisserman：http://www.robots.ox.ac.uk/~az/ 机器人实验室美国南加州大学智能机器人和智能系统研究所University of Southern California， Los AngelesIRIS is an interdepartmental unit of USC's School of Engineering with ties to USC's Information Sciences Institute (ISI). Members include faculty， graduate students， and research staff associated with...http://iris.usc.edu/ Computer Vision 实验室美国南加州大学计算机视觉实验室介绍：Computer Vision Laboratory at the University of Southern California is one of the major centers of computer vision research for thirty years. they conduct research in a number of basic and applied are...http://iris.usc.edu/USC-Computer-Vision.html英国约克大学高级计算机结构神经网络小组The Advanced Computer Architecture Group has had a thriving research programme in neural networks for over 10 years. The 15 researchers， led by Jim Austin， focus their work in the theory and applicati...http://www.cs.york.ac.uk/arch/neural/瑞士戴尔莫尔感知人工智能研究所IDIAP is a research institute established in Martigny in the Swiss Alps since 1991. Active in the areas of multimodal interaction and multimedia information management， the institute is also the leade...http://www.idiap.ch/英国萨里大学视觉，语言和信号处理中心The Centre for Vision， Speech and Signal Processing (CVSSP) is more than 60 members strong， comprising 12 academic staff， 18 research fellows and more than 44 research students. The activities of the ...http://www.ee.surrey.ac.uk/Research/VSSP/美国阿默斯特马萨诸塞州立大学计算机视觉实验室The Computer Vision Laboratory was established in the Computer Science Department at the University of Massachusetts in 1974 with the goal of investigating the scientific principles underlying the con...http://vis-www.cs.umass.eduUniversity of Massachusetts——Computer Vision Laboratory for Perceptual Robotics美国芝加哥伊利诺伊斯大学贝克曼研究中心智能机器人和计算机视觉实验室Includes the following groups: Professor Seth Hutchinson's Research Group Professor David Kriegman's Research Group Professor Jean Ponce's Research Group Professor Narendra Ahuja's Research Gro...http://www-cvr.ai.uiuc.edu/Computer Vision and Robotics LaboratoryVision Interfaces and Systems Laboratory (VISLab)英国伯明翰大学计算机科学学校视觉研究小组The vision group at the School of Computer Science (a RAE 5 rated department) performs research into a wide variety of computer vision and image understanding areas. Much of this work is performed in ...http://www.cs.bham.ac.uk/research/vision/微软研究院机器学习与理解研究小组 / 计算机视觉小组The research group focuses on the development of more advanced and intelligent computer systems through the exploitation of statistical methods in machine learning and computer vision. The site lists ...http://research.microsoft.com/mlp/http://research.microsoft.com/en-us/groups/vision/微软公司的文献：http://research.microsoft.com/research/pubs微软亚洲研究院：http://research.microsoft.com/asia/，值得关注Harry Shum， Jian Sun， Steven Lin， Long Quan(兼职HKUST)etc.瑞典隆德大学数学系视觉组：http://www.maths.lth.se/matematiklth/personal/andersp/感觉国外搞视觉的好多是数学系出身，大约做计算机视觉对数学要求很高吧。澳大利亚国立大学：http://users.rsise.anu.edu.au/~hartley/美国北卡大学：http://www.cs.unc.edu/~marc/法国INRIA：http://www-sop.inria.fr/odyssee/team/ 由Olivier.Faugeras领衔的牛人众多。比利时鲁汶大学的L.Van Gool： www.esat.kuleuven.ac.be/psi/visics/据说在这个只有中国一个小镇大小的地方的鲁汶大学在欧洲排行top10，名列世界top100，还出了几个诺贝尔奖，视觉研究也很强.美国明德http://vision.middlebury.edu/stereo/以下含有非顶尖美国学校研究组，没有链接("}
