{"content2":"一文读懂AI简史：当年各国烧钱许下的愿，有些至今仍未实现\n导读：近日，马云、马化腾、李彦宏等互联网大佬纷纷亮相2018世界人工智能大会，并登台演讲。关于人工智能的现状与未来，他们提出了各自的观点，也引发网友热议。有人认为大佬们的分享干货满满，也有人有不同观点，认为我们并没有真正搞懂人工智能，更无法预测未来。\n如果回溯历史，你会发现，人工智能一直是国内外计算机、互联网大佬们喜欢的话题。他们的观点和预言，有些已成为今天的生活常态，有些却依然没有实现。本文就带你回顾人工智能发展过程中重要的历史阶段，以及大佬们那些精彩的言论。\n作者：钱纲\n本文摘编自《硅谷简史：通往人工智能之路》，如需转载请联系我们\n在我们回顾人工智能的历史之前，先来看看流行的人工智能的定义。目前，最被认可的人工智能定义为：能像人一样理性地思考和理性地行动的机器。行动被广义地理解为采取行动、制定行动的决策，并非肢体动作。\n人工智能分强弱两类。强人工智能为能推理（Reasoning）和解决问题（Problem solving）的智能机器，是有知觉、有自我意识的机器。强人工智能分两类：类人人工智能，即能像人一样思考和推理的机器；非类人人工智能，即具有和人不同的知觉和意识的机器，其推理方式和人类不同。持弱人工智能观点的人认为不可能制造出能真正地推理和解决问题的智能机器，那些看起来像智能的人工智能，既不是真正的智能，也不具有自主意识。\n人工智能的核心问题是使机器和软件具有与人类似的知识、学习、推理等能力。具体地说，就是让人工智能在一些以推理和分析为主的工作中达到或超过人类的水准和效率。目前，计算机硬件水平已经具有过去无法想象的能力了，为人工智能的实现铺平了道路。其实，在数学问题的证明上，在棋类竞赛上，甚至在股票投资上，人工智能都已经超过了人类。\n目前用来研究人工智能的主要手段及实现人工智能的机器是计算机, 人工智能的历史和计算机科学与技术史联系在一起。不过，人工智能还涉及信息论、控制论、自动化、仿生学、生物学、心理学、数理逻辑、语言学、医学和哲学等多门学科。\n01 早期的人工智能\n最早的人工智能是在先民的神话传说中。无论是古希腊还是我们中国古代都有把智能赋予机械装置的故事。1863年，塞缪尔·巴特勒（Samuel Butler）的论文《机器中的达尔文》探讨了机械装置器通过自然选择进化出智能的可能性。\n人工智能有一个基本假设，即人类可以用机械模拟人类的思考过程。这是一种形式化推理。在古代，亚里士多德的形式逻辑和欧几里得《几何原本》是形式化推理的典范。\n17世纪时，欧洲哲学家、数学家莱布尼茨和笛卡儿尝试过将思考形式转化为数学。莱布尼兹提出过一种用于推理的普适语言，它使推理成为计算，于是，哲学家之间的争论，就能用逻辑来判断其真伪。这些早期的哲学家已经知道，形式化推理依赖于形式语言系统。\n20世纪初，数理逻辑取得了长足的进步。希尔伯特提出了一个基础性问题：“能否将所有的数学推理形式化？”很快这个问题就被哥德尔的不完备定理解决了，他的答案是：任何形式语言系统都是不完备的。哥德尔也指出了：任何形式的数学推理都能在一些限制条件下简化成机械化步骤。\n1936年，24岁的英国数学家阿兰·图灵在他的论文中，提出了著名的图灵机模型，一个完整的形式语言系统。1945年，他发表了一系列论文论述了电子数字计算机的设计思想。\n随着计算机技术的提高，人们开始有了实现人工智能的技术手段。最早期的人工智能是用电子网络模拟人类的神经元，这一网络的激励电平只有“1”和“0”两种状态，没有中间状态。维纳的控制论很好地描述了电子网络的控制和稳定性。克劳德·香农提出的信息论则描述了如何用数字信号来实现逻辑功能。图灵的计算机理论证明二进制的数字信号足以描述任何形式的计算。这一切为人工智能打下了坚实的基础。\n最早提出神经元网络的学者是沃尔特·皮茨（Walter Pitts）和沃伦·麦卡洛克（Warren McCulloch），他们分析了理想的人工神经元网络，并给出了利用它们进行简单逻辑运算的机制。人工智能理论的奠基人之一的马文·明斯基（Marvin Minsky）当时只有24岁，是他们的学生。1951年明斯基与迪安·埃德蒙兹（Dean Edmonds）造出了第一台神经元网络机SNARC。\n1950年，图灵发表了一篇划时代论文《计算机器与智能》论文指出制造具有真正智能的机器是可能的。同时，图灵给出了智能的确切定义，即能够通过图灵测试的智能机器。图灵测试是这样的：如果一台机器与人类对话时，能不被辨别出其机器身份，那么该机器就具有智能。图灵的工作为人工智能奠定了坚实的基础。\n1951年，克里斯托夫·斯特雷奇（Christopher Strachey）写出了第一个跳棋（checkers）程序；很快就有人写出了国际象棋程序。20世纪50年代中期的国际象棋程序已经具有业余爱好者的水平了。游戏中的人工智能一直是评价人工智能进展的一类标准。\n20世纪50年代中期，科学家们开始用机器进行符号操作了。1955年，艾伦·纽厄尔（Allen Newell）和赫伯特·西蒙（Hervert Simon）开发了逻辑理论家（Logic Theorist）程序。该程序证明了《数学原理》中前52个定理中的38个，该程序的一些证明方法，比原著还好。\n1956年，第一次关于人工智能的学术会在达特茅斯学院召开，会议由明斯基、约翰·麦卡锡（John McCarthy）、香农等人发起，麦卡锡在会议上提出了人工智能一词。与会者有雷·所罗门诺夫（Ray Solomonoff）、奥利弗·塞尔弗里奇（Oliver Selfridge）、阿瑟·塞缪尔（Arthur Samuel）、纽厄尔和西蒙等人，他们后来在人工智能研究中做出了重要贡献。这次会议是人工智能被确立为一门学科的标志。\n人工智能之父和LISP语言发明人麦卡锡在达特茅斯会议上第一次为人工智能下了定义：“人工智能就是要让机器的行为看起来就像是人所表现出的智能行为一样。”麦卡锡的人工智能定义尽管很流行，但不全面。\n02 第一次高潮\n达特茅斯会议后的几年是人工智能飞速发展的时代。这一阶段，人们开发出了一些智能程序：解代数应用题，证明几何定理，学习和使用英语。当时，绝大多数人都无法相信机器能够解决这些智能问题。开发出这些程序的学者们相信，在未来的20年内，将出现具有完全智能的机器。国防部高级研究计划署为这些项目拨出了大笔科研经费。\n这些早期的人工智能程序中最有影响的是，搜索式推理、纽厄尔和西蒙的通用解题程序和赫伯特·格伦特尔（Herbert Gelernter）的几何定理证明程序等。\n人工智能的一个重要目标是使计算机能够通过自然语言和人类进行交流。早期的成功范例是丹尼尔·博布罗（Daniel Bobrow）的程序STUDENT，它还能解高中代数应用题。\n很快，有人就开发出了一个会说英语的聊天程序。与它聊天的用户有的会认为自己是在和人类在交谈。实际上该程序并不了解自己在说什么。它是按固定套路和语法在作答。\n1958年，纽厄尔和西蒙指出：“10年之内，数字计算机将成为国际象棋世界冠军。”“10年之内，数字计算机将发现并证明一个重要的数学定理。”\n1965年，西蒙称：“20年内，机器将能完成人能做到的一切工作。”\n当时的美国政府为人工智能提供的研究经费几乎是无条件的。麻省理工、卡内基梅隆大学、斯坦福大学和英国的爱丁堡大学是当时人工智能的研究中心。\n03 艰难的20世纪70年代\n20世纪70年代初，人工智能遭遇了瓶颈。当时最好的人工智能程序也只能解决一些最简单的问题，在很多人的眼里人工智能只是“玩具”而已。\n1976年，汉斯·莫拉维克（Hans Moravec）提出了著名的莫拉维克悖论：那些对于人类来说比较困难的问题，像证明定理这类问题对计算机程序而言相对容易；而一些对人类来说极其简单的任务，如人脸识别，却很难由计算机程序来实现。在莫拉维克悖论面前，当时的人工智能专家们一筹莫展。\n计算机的运算能力也是人工智能的瓶颈。当时的计算机内存和速度都不足以解决任何实际的人工智能问题。莫拉维克指出，计算机的能力离人工智能的要求还差上百万倍。\n1972年理查德·卡普（Richard Karp）证明了一个令人沮丧的结论，许多问题的计算时间与输入规模的幂成正比。除了最简单的情况，解决的时间接近无限长。也就是说人工智能恐怕永远也不会有实用价值。\n由于缺乏实质性进展，政府对人工智能的研究逐渐停止了资助。1974年，人工智能项目已经很难找到政府资助了。\n另外，来自其他领域的专家们也开始反对人工智能了。有哲学家称，哥德尔不完备定理证明了形式系统（例如计算机程序）无法判断某些陈述的真理性，而人类可以；还有些人认为人类推理实际上仅涉及少量的“符号处理”，而大多是具体的、直觉的、下意识的；还有人指出，程序并不理解它使用的符号，即意向性问题，如果符号对于机器没有意义，那机器就不是在思考。\n人工智能专家们不太把来自其他领域的批评当回事，但计算复杂性和“让程序具有常识”这些问题则是他们必须认真面对的。\n1976年约瑟夫·维森鲍姆（Joseph Weizeubaum）出版了专著《计算机的力量与人类的推理》（Computer Power and Human Reason），书中表示人工智能的滥用可能损害人类生命的价值。\n早在1958年，麦卡锡就提出了将逻辑学引入人工智能的构想。1963年，J.艾伦·鲁滨逊（J.Alan Robinson）发现了在计算机上实现推理的算法：归结（resolution）与合一（unification）算法。20世纪60年代末，麦卡锡发现用这一想法来直接实现逻辑推理的计算复杂度极高：即使证明很简单的定理也需要天文数字的步骤。20世纪70年代，罗伯特·科瓦尔斯基（Robert Kowalsky）、阿兰·科摩罗（Alain Colmerauer）和菲利普·鲁塞尔（Phillipe Roussel）在爱丁堡大学开发出了逻辑编程语言Prolog。\n04 繁荣的20世纪80年代\n20世纪80年代，人工智能中的专家系统程序开始被企业采纳。很快，知识处理就成了人工智能的主流。专家系统是一个能够依据一组从专门知识中推演出的逻辑规则在某一特定领域回答或解决问题的程序。最早的专家系统程序是由爱德华·费根鲍姆（Edward Feigenbaum）小组开发出来的。1965年的DENDRAL专家系统能根据分光计读数分辨混合物；1972年的MYCIN能够诊断血液传染病。\n专家系统是在很小的知识领域内的应用，避免了常识问题；因其简单又能容易地实现或修改，于是有了广泛的应用。但是，人们从专家系统中看到了这类程序的实用性。人工智能终于变得实用了。\n1980年，卡内基梅隆大学为数字设备公司设计了专家系统XCON，获得巨大成功。XCON每年为公司省下了4000万美元。于是，全世界的公司都开始研发和应用专家系统。到1985年，人工智能得到了各大企业超过10亿美元的投资。于是，为专家系统提供支持的产业应运而生，硬件公司有Symbolics、LISP Machines等，软件公司以IntelliCorp、Aion为主。\n专家系统的能力基于其存储的专业知识。20世纪70年代的经验告诉人们，智能行为与知识处理有着密切关系。知识库系统和知识工程是20世纪80年代人工智能研究的主要方向。\n1981年，日本经济产业省拨款8.5亿美元资助第五代计算机的研发。目标是造出能够与人对话，翻译语言，解释图像，并像人一样推理的计算机。他们选用Prolog作为该项目的主要编程语言。\n其他国家也纷纷响应。英国发起了耗资3.5亿英镑的Alvey工程。美国企业协会组织了微电子与计算机技术集团（Microelectronics and Computer Technology Corporation，MCC），向人工智能和信息技术的大规模项目提供资助。DARPA组织了战略计算促进会（Strategic Computing Initiative），开始向人工智能大量投资。\n1982年，物理学家霍普菲尔德（Hopfield）证明了一种新型的神经网络能用一种全新的方式学习和处理信息。同时，罗姆尔海特（Rumelhart）推广了一种神经网络训练方法。这些发现使神经网络在20世纪90年代获得了商业上的成功，它们被广泛地应用于光字符识别和语音识别软件。\n05 再次跌入低谷\n1987年，人工智能硬件市场需求突然下跌，而个人计算机的性能不断提升，其性能已经超过了Symbolics和其他厂家生产的昂贵的LISP机。人工智能硬件厂商失去了存在的理由，一个价值5亿美元的产业顷刻间土崩瓦解。\n一些曾经大获成功的专家系统的维护费居高不下。它们难以升级，难以使用，成了以前已经暴露的各种各样的问题的牺牲品。专家系统的实用性仅仅局限于某些特定情景。\n20世纪80年代晚期，战略计算促进会大幅削减对人工智能的资助。DARPA的新领导认为人工智能不是“下一个浪潮”，拨款将倾向于一些看起来容易出成果的项目。\n“第五代计算机工程”一直到1991年也没有实现。其中一些目标，比如“与人类展开交谈”，直到2010年也没有实现。\n06 再度繁荣\n20世纪80年代后期，一些学者提出了一种全新的人工智能方案。他们认为，为了获得真正的智能，机器必须能够感知、移动、生存，并与这个世界交互。他们认为这些感知运动技能对于常识等高层次技能至关重要，相反抽象推理则是人类最不重要、最无趣的技能。他们提倡“自底向上”地创造智能。\n20世纪90年代，人工智能终于实现了它最初的一些目标。它被成功地用在许多技术产业中。这些成就主要归功于计算机性能的提升。\n1997年5月11日，深蓝战胜了国际象棋世界冠军卡斯帕罗夫（Kasparov）。\n2005年，斯坦福大学开发的一台机器人在一条沙漠小径上成功地自动行驶了131英里，赢得了DARPA挑战大赛头奖。\n2009年，蓝脑计划成功地模拟了部分鼠脑。\n2011年，IBM的沃森参加《危险边缘》节目，在最后一集中打败了人类选手。\n但是，这些成就不是因为范式上的革命。它们只是工程技术的复杂应用。人们广泛地认识到，许多人工智能需要解决的问题已成为数学和运筹学领域的课题了。数学语言的共享使人工智能与其他学科在更高层次上进行了合作，其研究结果则更易于评估和证明。今天，人工智能已成为一门非常严格的科学分支。\n今天，计算机的计算能力已经提高到了前所未有的地步。在理论上，人工智能发展几乎是没有限制的，因此它必将像今天的互联网一样深远地影响我们的日常生活和价值观。\n关于作者：钱纲，现就职于美国德州仪器公司，从事半导体工艺及半导体器件的开发与研究工作。科学网人气作者，其作品在线获得超过千万人次的浏览量。钱纲的作品以涉及历史、科技的杂文、随笔为主。主要作品有美国历史及人物纪事《美国往事》，硅谷历史《硅谷简史》等。\n本文摘编自《硅谷简史：通往人工智能之路》，经出版方授权发布。\nhttps://mp.weixin.qq.com/s/PnhwSKV7_6C2xPjwIt6cKQ"}
