{"content2":"2016年，Alpha Go战胜韩国围棋选手李世乭再次引爆了全球对于人工智能的讨论和关注。计算机视觉作为人工智能技术的基础，受到深度学习的成功影响在近几年内取得了突破性的进展，巨头纷纷布局，市场也吸引了越来越多的人才创业参与其中。计算机视觉正在成为人工智能最火热的细分领域之一。\n本报告将针对计算机视觉技术发展的关键节点、市场现状及应用场景进行分析和研究。\n一、技术发展及市场现状分析\n1.人工智能是一场从终极概念到分级落地的技术演变\n2.人工智能所依赖的基础设施已经就位，但当前仍属于早期阶段\n人工智能正在像婴儿一样成长，机器不再只是通过特定的编程完成任务，而是可以通过不断地学习来掌握本领，这主要依赖高效的模型算法进行大量的数据训练，其背后需要具有高性能计算能力的软硬件作为支撑。\n数据量：2000年至今互联网及移动互联网的高速发展使得数据实现了量的积累，据IDC预测，2020年全球的大数据总量将为40ZB，其中有七成将会以图片和视频的形式进行存储，这为人工智能的发展提供了丰厚的土壤。\n深度学习算法：多伦多大学教授Geoffrey Hinton（致力于神经网络和深度学习研究）的学生在业内知名的图像识别比赛ImageNet中利用深度学习的算法将识别错误率一举降低了10%，甚至超过了谷歌，深度学习进而名声大噪。2015年，微软亚洲研究院视觉计算组在该项比赛中夺冠，将系统错误率降低至3.57%，已经超过了人眼。\n高性能计算：GPU响应速度快、对能源需求低，可以平行处理大量琐碎信息，并在高速状态下分析海量数据，有效满足人工智能发展的需求。\n基础设施成本：云计算的普及和GPU的广泛使用，极大提升了运算效率，也在一定程度上降低了运营成本。IDC报告显示，数据基础设施成本正在迅速下降，从2010年的每单位9美元下降到了2015年的0.2美元。\n3. 当前国内人工智能领域产业格局尚未成熟，上中下游均蕴含着不俗的创业空间，但进入门槛较高\n目前国内人工智能领域的产业发展还较为青涩，核心基础设施层面较为依赖国外市场，但也因市场变革期而存在大量弯道超车的机会，出现了地平线机器人、Cista、图灵机器人等创业型公司；\n技术服务层面多以创业公司为主，且有能力与大厂商一同探索推进AI技术的研究升级，其中以深度学习、计算机视觉、自然语言处理等最为火热，这是倒逼基础设施升级与拓展行业应用场景的关键环节（本报告将重点关注计算机视觉技术的发展与影响）；\n行业应用层则多点开花，既有致力于无人驾驶、无人机等创新产品研发的企业，也有将人工智能技术与传统行业结合，影响行业变革（诸如安全、医疗、金融等）的企业。\n4.计算机视觉是机器认知世界的基础，也是最主要的人工智能技术之一。\n人类认识了解世界的信息中91%来自视觉，同样计算机视觉成为机器认知世界的基础，终极目的是使得计算机能够像人一样“看懂世界”。目前计算机视觉主要应用在人脸识别、图像识别方面（包括静态、动态两类信息）。\n5. 计算机识别准确度和识别类型多寡是影响计算机视觉技术应用发展的基础因素\n提升计算机识别的准确度以及扩大计算机的识别范围一直是学术界和工业界努力的方向，并热衷于参加国际主流的计算机视觉比赛以此来验证研究成果。至今，斯坦福大学视觉实验室ImageNet通过众包的方式收集了1千多万张图片，共计2万多个标签类别，成为全球最大的图像识别数据库，其举办的ILSVRC也成为最受关注的大赛。\n2012年，ImageNet ILSVRC比赛中，冠军团队使用深度学习算法将识别错误率一举降低了10%，成为影响人工智能进程的里程碑事件，深度学习从此进入了广泛应用期。2015年，冠军团队的最新测试结果显示已经超过人类。\n6. 受技术发展影响，计算机视觉正在带动全球新一轮的市场热潮\n7．国内计算机视觉创业热度递增且深入行业，但处于早期阶段\n8. 国外巨头自研和收购双管齐下布局国外巨头自研和收购双管齐下布局，将视觉技术广泛应用于自身产品升级，并基于自身基因打造技术服务平台和新品类持续提升影响力。\n9. 国内巨头百度相对激进，阿里巴巴、腾讯基于自身产品进行功能试水综上可以看出，创业公司以多点垂直化企业服务为切入点，国内外巨头则一方面利用资源优势积极进行底层架构建设，并将技术广泛应用到已有的产品升级中，另一方面利用资金优势大量收购优秀的技术和数据创业公司，迅速弥补技术短板、数据短板和人才短板。Analysys易观认为，国内技术主要沿袭国外，但创业环境和应用场景更为宽松，市场空间不容小觑。\n二、技术应用场景及典型厂商分析\n1. 计算机视觉技术已应用于传统行业和前沿创新，安全/娱乐/营销成最抢先落地的商业化领域\n计算机视觉技术已经步入应用早期阶段，不仅渗透到传统领域的升级过程中，还作为最重要的基础人工智能技术参与到前沿创新的研究中。计算机对静态内容的识别应用主要体现在搜索变革和照片管理等基础服务层面，意在提升产品体验；伴随内容形式的变迁（文字→图片→视频），动态内容识别的需求愈加旺盛，安全、娱乐、营销成为最先落地的商业化领域。\nAnalysys易观认为，这三类领域均有一定的产业痛点，且均是视频内容产出的重地，数据体量巨大，适合利用深度学习的方式予以改进。与此同时，行业潜在的商业变现空间也是吸引创业者参与的重要原因。另一方面，当前计算机视觉主要应用于二维信息的识别，研究者们还在积极探索计算机对三维空间的感知能力，以提高识别深度。\n2. 计算机视觉的应用从软硬件两个层面优化安防人员的作业效率和深度\n安防是环境最为复杂的应用领域，通常的应用场景以识别犯罪嫌疑人、目标车辆（含套牌车/假牌车）以及真实环境中的异常为主。\n传统安防产品主要功能在于录像收录，只能为安防人员在事后取证的环节提供可能的线索，且需要人工进行反复地逐帧排查，耗时耗力；智能安防则是将视频内容结构化处理，通过大数据分析平台进行智能识别搜索，大大简化了工作难度，提高工作效率。\nAnalysys易观认为，计算机视觉的应用从行业痛点出发，以软硬件的方式大大优化了安防人员的作业效率与参考深度，是顺应行业升级的利好。不过，在实际应用过程中，对公安、交警、金融等常见安防需求方而言，更强的视觉识别效果往往意味着更多基础成本（存储、带宽等）的投入，安防厂商的未来将不只以技术高低作为唯一衡量标准，产品的实用性能与性价比的平衡才是进行突围、实现量产的根本，因此市场除了有巨大的应用空间外，还会引发一定的底层创新。\n3. 计算机视觉的应用有效迎合直播平台的前端用户体验和后端监管要求\n直播平台的爆红丰富了网民的娱乐生活方式，产生的海量内容也为平台的监管造成了巨大的压力，传统人工审核效果不稳定，基于深度学习的图像识别平台可以有效缓解这一痛点，同时也可对前端的内容运营进行优化，提高用户体验和活跃度。\nAnalysys易观认为，直播平台为计算机视觉创造了新的应用场景，伴随行业的发展，除刚需之外，平台定制化、差异化的需求也会为计算机视觉应用提供更多的增量空间。另外，与直播的UGC性质类似，其他的应用场景还有长短视频平台、社交平台、云存储平台、CDN以及社区平台。\n4.计算机视觉的应用促进视频环境中广告主和用户间交互闭环的落地\n挖掘视频中广告位及视频电商购物一直是视频平台作为中间方探索营销创收的新方式，此前以人工贴标、投放的方式实现，因效率低下仅作为小范围试水。\nAnalysys易观认为，计算机视觉将加速这一探索的进程，除技术成熟度之外，用户体验和用户习惯（从PC端向移动端迁移）也是对应用程度比较重要的影响因素，需要合理设计及长期培育。\n5.计算机视觉还将逐步拓展服务和工商业等多重应用场景\n6.计算机视觉作为基础人工智能技术，与其他技术融合共同推动创新型行业应用的发展7. 典型厂商分析——格灵深瞳\n8.典型厂商分析——商汤科技\n9. 典型厂商分析——图普科技\n10. 典型厂商分析——衣+商\n丁选"}
