{"content2":"【CSDN现场报道】12月7日-9日，由全球最大中文IT社区CSDN承办的“2017中国大数据技术大会”（BigData Technology Conference 2017，简称BDTC 2017）在北京新云南皇冠假日酒店隆重举行。本次大会以“大数据与智能为主题，聚焦最纯粹的技术干货分享，和最接地气的深度行业案例实践，汇聚国内外顶尖技术专家，共论最新的大数据技术实践与发展趋势。\nBDTC大会进入第三天，本次大会首次设置的机器学习和深度学习论坛隆重登场。\n解密手机人脸解锁\n旷视科技(Face++) 高级产品总监敖翔首先演讲，他的演讲题目是《解密手机人脸解锁》，敖翔表示，在智能手机诞生至今的10年间，我们见证了 ”手机解锁“ 从密码、图形锁、指纹到人脸的进化过程。而在这次演讲中，敖翔首先介绍了人脸识别的发展历程，人脸识别的过程：找人脸-活体判断-人脸对比，然后探讨了有关 ”人脸解锁“ 的几个热点问题：人脸与多种生物识别方式的对比分析；手机上人脸识别的技术原理和演变历史；手机人脸解锁如何解决安全性问题，特别是在防“活体攻击”上的面临的挑战：换脸、翻拍、假脸等攻击；敖翔介绍了支付级活体识别技术：3D识别、材质识别和红外识别，敖翔最后总结道，手机刷脸技术的成熟，将极大推进人脸识别在线上线下各场景的普及。\n基于GPU的性能建模与分布式深度学习框架评价\n香港浸会大学计算机科学系副教授褚晓文第二个演讲，他带来了题为《基于GPU的性能建模与分布式深度学习框架评价》的演讲，褚晓文表示深度学习框架已广泛部署在计算能力强大但价格昂贵的GPU服务器和集群上，这是因为目前GPU的算力可以满足深度学习对于计算的越来越高的要求，而计算是深度学习的关键。但GPU虽然计算能力很强，但内存的延迟和带宽瓶颈大大拖慢了计算的效率。因此在设计计算框架时，通常采用多线程、内存Hierarchy、HBM等方式。褚晓文介绍了一个分析性能的Roofline Model，并介绍了如何通过算法提升计算框架性能的方法，然后，褚晓文介绍了如何选择深度学习的硬件和软件平台以及如何优化这些深度学习的框架，并比较了目前最先进的几个分布式深度学习框架，即Caffe、CNTK，MXNet、Torch和TensorFlow在不同的硬件平台，包括单GPU，多GPU和GPU集群的表现。然后介绍了三个流行的卷积神经算法：即矩阵计算、基于傅立叶变换的算法和Winograd-base Convolution。最后，褚晓文介绍了他们的深度学习计算框架性能评价研究。并认为，在GPU的性能飞速发展的情况下，IO的优化、通讯时间的缩短对提升计算框架的性能非常关键。\n人工智能领域数据处理解决方案\n百度数据众包服务资深产品经理程敏第三个登场，她为与会嘉宾讲解了《人工智能领域数据处理解决方案》，程敏在演讲中说，大数据背景下，人工智能飞速发展，对数据处理的需求越发强烈，而数据为人工智能技术的实现和人工智能应用的落地提供了基础的后台保障。那么，如何获取和加工数据，人工智能基础数据就变成了目前的两大难题。接着，程敏介绍了百度众包如何通过方案、产品、技术，将非结构化的数据处理成机器可识别的有价值的数据，满足数据服务“质”“量”“速度”要求。\n“CBA”（Cloud，Bigdata,AI）探索和实践\nUCloud 互联网事业部 数据产品研发总监王冬冬上午最后一个登场，他带来的主题演讲是《“CBA”（Cloud，Bigdata,AI）探索和实践》，王冬冬介绍说，UCloud于今年年初提出了“CBA”（Cloud，Bigdata，AI）三位一体发展战略，并发布了UAI（人工智能）系列产品，包含超高性价比GPU、UAI-Service、UAI-Train和安全屋等AI产品。王冬冬首先介绍了UCloud在云计算方面的1机8卡的GPU云主机，接着介绍了UCloud在大数据方面的实践，讲解了企业安全使用数据的平台-安全屋。最后，王冬冬介绍了AI产品，UAI Train，并讲解了UCloud在相关领域的应用实践。\n机器学习算法平台实践\n下午，论坛继续进行，阿里巴巴资深技术专家杨旭在下午第一个出场演讲，演讲题目是《机器学习算法平台实践》，杨旭首先介绍了阿里巴巴机器学习平台PAI，并简单的介绍了PAI的架构，并介绍了阿里云内部的一些实践。杨旭表示，近几年，机器学习平台获得了飞速发展，积累了大量高效的机器学习算法组件，基于这些组件可以快速实现业务流程，解决具体问题。丰富的算法功能可以在线使用，不需要购买硬件，不需要安装配置各种环境；数据和计算资源一直处在“在线”状态，不必担心数据太大或计算资源不足的问题。 机器学习算法平台降低了用户使用机器学习、深度学习的门槛，将各个算法作为组件，即使不了解其后面的理论知识，杨旭随后例举了几个机器学习算法平台应用的实例，用户可以根据这些实例尝试新方法。\nAI + 大数据，为场景重新赋能\n旷视科技(Face++) 数据平台总监张驰紧接着登场，他的主题演讲是《AI + 大数据，为场景重新赋能》，张驰首先介绍了大数据的前世今生，张弛表示，2000多年前，先秦依据星象观察预测天气变化； 800多年前，刘伯温遍读古书，上知天文，下知地理，算无遗策； 如今的我们，数据无处不在，在方方面面融入进我们的生活，漫长的大数据发展史，不变的是数据的本质和价值，变化的是我们对数据的理解与应用。 而AI使数据无处不在，AI为数据赋能，AI使我们对数据的认识更深了，机器所见即是数据；而AI+大数据+场景将会为各传统行业赋能，张驰以众多实例对此进行了验证。但在此过程中如何保证数据的准确性、如何处理数据的关联融合、运营手段带来的机器学习噪声、AI与大数据融合仍然需要人力标注等都是AI与数据赋能的挑战。张弛最后对大数据的未来进行了展望，他表示，如何用AI手段完成数据的融合是一个较大的挑战，而如果能够有一天做到机器所见即是数据，将会让机器学习有更进一步的发展。\nAI识颜-机器学习在医美行业的落地\n更美社区及基础架构 负责人薛鹏飞则分享了《AI识颜-机器学习在医美行业的落地》，他在演讲中主要叙述了更美APP基于医美专家标记的大量图片数据，应用机器学习的方法，为用户提供鼻子，眉毛，眼睛等五官和脸型的分类识别功能。并基\n于此提供实时的双眼皮整形模拟效果功能，为想变美的用户带来全新的体验，提前感知变美后的效果，给产品日活，使用时长等关键数据指标带来的增长效果。薛鹏飞介绍了AI读脸功能的整体构架，技术方案，概述机器学习实现过程和应用的开源机器学习框架。在开发此功能过程中遇到的训练集生成问题，训练数据准确标记问题，应用机器学习过程中特征向量选取，模型方案设计过程中遇到的问题以及对应解决方案的探讨和研究，并对机器学习在更美其它社区产品中的应用和展望做了介绍。\nDeeplearning.Scala-开源深度学习框架思考与实践\nThoughtWorks中国区智能服务业务总经理史凯和ThoughtWorks CIES团队首席咨询师杨博则带来了《Deeplearning.Scala-开源深度学习框架思考与实践》的演讲，史凯表示，人工智能的开发以前更多的是学术界的研究，而对于程序员来说，如何把学术的东西带到工程中去是一个挑战。史凯表示，最早的数字化转型是流程驱动，而现在是数据驱动。而企业的数据战略则决定了企业是否能够更好的构建自己的业务，企业需要跨领域的数据，看似没有关联的数据来更好的构建自己的业务。而人工智能、机器学习在其中将起到非常重要的左右。而未来更好的帮助开发人员开发自己的人工智能，机器学习应用，ThoughtWorks开发了深度学习框架DeepLearning.scala。而杨博则具体就这个深度学习框架进行了详细的介绍，杨博对比了该框架和其他深度学习框架，并介绍了scala的架构以及其在实践中的应用。\n人工智能产业趋势和投融资分析\n最后一位登场的是工信部赛迪顾问人工智能产业研究中心，副总经理向阳，他带来了《人工智能产业趋势和投融资分析》，向阳表示，随着机器学习的快速发展，人工智能产业在历经60年的起伏之后，如今已经在全球范围形成新一轮的抢位发展态势，发达国家纷纷吹响探索大脑奥秘的号角。中国的人工智能产业在全球浪潮推动下，也在快速发展。赛迪顾问针对人工智能产业的大浪潮，提出了人工智能产业概念界定，并对产业链进行了深度剖析。对全球和中国人工智能市场规模和结构进行了判断，并详细梳理了全国各省市在人工智能领域的利好政策和具体举措。结合产业发展态势和技术热点演进，分析了各个细分领域的价值热点。\n更多精彩内容，请关注直播专题2017中国大数据技术大会（BDTC），新浪微博@CSDN，观看大会图文直播，请扫描二维码关注CSDN资讯微信公众号。"}
