{"content2":"计算机视觉前沿技术探索\n摘要：计算机视觉与最前沿技术如何结合？\n计算机视觉软件正在改变行业，使用户的生活变得不仅更容易，而且更有趣。作为一个有潜力的领域，计算机视觉已经获得了大量的投资。北美计算机视觉软件市场的总投资额为1.2亿美元，而中国市场则飙升至39亿美元。让我们来看看一些最有前途和更有趣的技术，因为这些技术可以让计算机视觉软件开发市场增长的更快。\n一、深度学习的进步\n深度学习因其在提供准确结果方面而广受欢迎。\n传统的机器学习算法尽管很复杂，但其核心仍然非常简单。他们的训练需要大量的专业领域的知识和数据（这是昂贵的），在训练发生错误时需要进行人为干预，而且，他们只擅长于他们接受过训练的任务。\n另一方面，深度学习算法通过将任务映射为概念层次结构的神经元网络了解手头的任务。每个复杂的概念都由一系列更简单的概念组合定义，而所有这些算法都可以自己完成。在计算机视觉的背景下，图像分类需要首先识别亮区和暗区，然后在移向全画面识别之前对线进行分类，然后进行形状分类。\n当你为他们提供更多数据时，深度学习算法也会表现得更好，这是典型的机器学习算法做不到的。对于计算机视觉，深度学习是一个好的方向。它不仅允许在深度学习算法的训练中使用更多的图片和视频，而且还减轻了许多与注释和标记数据相关的工作。\n零售业一直是实施计算机视觉软件的先驱。2017年，ASOS在为他们的应用添加了一个按照照片搜索的选项，之后许多零售商都跟进了。有些人甚至更进一步，并使用计算机视觉软件将在线和离线体验更紧密地结合在一起。\n一家名为Lolli＆Pops的美食糖果零售商使用面部识别来识别经常走进商店的购物者。因此，商店的员工可以通过提供个性化的产品推荐和千人千面的折扣来个性化购物体验。\n特殊待遇可以提升品牌忠诚度，并将偶尔的购物者转变为经常性购物者。\n二、边缘计算的兴起\n连接到互联网和云的机器能够从整个网络收集的数据中学习并相应地进行调整，从而优化系统的性能。但是，并不能保证机器能够始终连接到互联网和云，这就是边缘计算的用武之地。\n边缘计算是指附接到物理机器的技术，例如燃气轮机，喷气发动机或MRI扫描仪。它允许在收集数据的地方处理和分析数据，而不是在云中或数据中心。\n边缘计算不能取代云。它只是允许机器在需要时单独处理新的数据。换句话说，边缘的机器可以根据自己的经验学习和调整，而不依赖于更大的网络。\n边缘计算解决了网络可访问性和延迟的问题。在边缘计算的发展下，设备可以放置在网络连接不良或不存在的区域，此外，边缘计算还可以抵消用于数据共享的云计算的使用和维护的一些成本。\n对于计算机视觉软件，这意味着可以实时更好地响应，并且只将相关数据发送到云中进行进一步分析，此功能对自动驾驶汽车特别有用。\n为了安全运行，车辆将需要收集和分析与其周围环境，方向和天气状况有关的大量数据，更不用说与路上的其他车辆通信，所有这些都没有延迟。如果通过云中心化的解决方案来分析数据可能很危险，因为延迟可能导致事故。\n三、点云（point cloud）对象识别\n最近在对象识别和对象跟踪中更频繁使用的技术是点云。简而言之，点云是在三维坐标系内定义的数据点的集合。\n该技术通常在空间（例如房间或容器）内使用，其中每个对象的位置和形状由坐标列表（X，Y和Z）表示，坐标列表称为“点云”。\n该技术准确地表示了物体在空间中的位置，并且可以精确地跟踪任何移动。点云的应用是无止境的。以下是一些行业的例子以及他们从这项技术中获得的好处：\n记录：资产监测，跟踪施工现场，故意破坏检测；\n分类：城市规划，审计工具，便于分析，绘制必要的公用事业工作\n变更检测：资产管理，货物跟踪，自然灾害管理。\n预测性维护：持续监控资产和基础设施，以预测何时需要维修。\n四、融合现实：VR和AR增强\n今天，任何VR或AR系统都会创建一个沉浸式3D环境，但它与用户所处的真实环境几乎没有关系。大多数AR设备可以执行简单的环境扫描（例如，Google ARCore可以检测平面和光线条件的变化），VR系统可以通过头部跟踪，控制器等检测用户的运动，但他们的功能也就这样了。\n计算机视觉软件正在推动VR和AR进入下一阶段的开发，有些人称之为Merged Reality（MR）。\n借助外部摄像头和传感器映射环境，以及眼动跟踪解决方案和陀螺仪来定位用户，VR和AR系统能够：\n感知环境并引导用户远离墙壁，物品或其他用户等障碍物。\n检测用户的眼睛和身体运动并相应地采用VR环境。\n提供室内环境，公共场所，地下等的指引。\nLowe's五金店已在他们的商店中使用它，每个购物者都可以借用AR设备来制作他们的购物清单，并获得商店中每件商品的指示。AR设备可以实时使用楼层平面图，库存信息和环境映射以给出准确的指示。\n我们也可以通过实时3D面部识别功能更新虚拟艺术家应用程序，让客户可以看到不同的化妆产品在他们的脸上和不同光线条件下的外观。\n五、语义实例分割\n为了理解语义实例分割是什么，让我们首先将这个概念分为两 部分：语义分割和实例分割。\n实例分割在像素级别识别对象轮廓，而语义分割仅将像素分组到特定对象组。让我们使用气球图像来说明与其他技术相比的两种技术：\n分类：此图像中有一个气球；\n语义分割：这些都是气球像素；\n物体检测：此图像中有7个气球，我们开始考虑重叠的对象；\n实例分割：这些位置有7个气球，这些是属于每个气球的像素；\n如果放在一起，语义实例分割方法将成为一个强大的工具。该工具不仅可以检测属于图片中对象的所有像素，还可以确定哪些像素属于哪个对象以及对象所在的图片中的位置。\n语义实例分割是土地覆盖分类的有用工具，具有各种应用。通过卫星图像进行的土地制图可以用于政府机构监测森林砍伐（特别是非法），城市化交通等。\n许多建筑师事务所也将这些数据用于城市规划和建筑开发，有些人甚至更进一步将其与AR设备相结合，以了解他们的设计在现实生活中的样子。\n作者：城市中迷途小书童\n链接：https://www.jianshu.com/p/8efe575c999c\n來源：简书\n简书著作权归作者所有，任何形式的转载都请联系作者获得授权并注明出处。"}
