{"content2":"一、微软认知服务API1、年龄、性别检测2、物体分类、识别3、识别名人全新的名人识别模块可以识别20万来自全球各地涉及商界、政界、体育界以及娱乐界的名人。4、读取图片中的文字光学字符识别（OCR）可检测图片中的文字信息，并将提取出来的文字信息转化成为机器可读的字符串。通过分析图像来检测嵌入式文本，生成字符串并提供搜索功能。可以让直接拍摄文本的图片，无需手动转录文字，从而节省时间和精力。5、情绪识别+视频图片情绪识别可检测到的情感有愤怒、轻蔑、厌恶、恐惧、快乐、无表情、悲伤以及惊讶。这些情感具有特定的面部表情，被认为是可进行跨文化和普适交流的。6、人脸技术人脸识别、人脸关键点定位、人脸验证技术（核对两张脸是否属于同一个人。并给出置信度评分。 ）、人脸辨识、相似人脸搜索、人脸分组7、视频中的图像技术抖动的视频自动进行平滑和稳定处理、使用具有高精度的人脸位置检测和跟踪功能来分析视频，可在一个视频中最多检测 64 张人脸、测在静态背景的视频中发生运动的时间。此服务将分析检测到帧运动的输入视频并输出元数据，还可定义运动发生时所在的精确坐标、自动创建运动缩略图摘要，让人们快速预览你的视频..二、国内图像处理1、face++旷视（人脸识别）人脸识别、证件识别、图像识别2、格灵深瞳（图像识别）格灵深瞳是一家专注于计算机视觉以及人工智能的科技公司，投资人给这个团队的未来市场估值达几千亿。CTO赵勇是Google Glass团队核心成员之一。据说他们的成员都在来自海内外一级名校的学霸，要加入他们比进哈佛大学还要困难。2014年6月获得红杉资本的A轮投资。3、图普科技（图像识别）国内最大的图像识别云服务平台，每日处理数亿的图片及视频内容。创始人李明强是微信创始团队成员之一，曾带领团队打造出QQ邮箱。业界最专业的智能图片鉴黄师。2014年8月获A轮融资。4、Linkface 脸云科技（人脸识别）FDDB人脸检测公开测试世界第一，300-W Benchmark 准确率世界第一, LFW人脸识别准确率已达99.5%以上，即将推出中国银联和京东钱包的“人脸识别”。使用“高斯脸”算法首次击败了人眼识别率的陆超超也加入了Linkface。获得A轮融资，2015年底被SenseTime并购。5、腾讯优图（人脸识别）腾讯旗下专门研究机器学习、智能识别的团队，在另一项人脸识别测试LFW排名第一。相比与创业公司，腾讯优图有着得天独厚的大数据、研发投入、平台等多种优势。6、SenseTime 商汤科技（图像识别）在人脸识别测试LFW中准确率超过Facebook和Google。目前已开始对外提供精准的人脸识别技术，以及集成了人脸识别、危险品识别、行为检测、车辆检测等的安防监控系统。2014年11月获得IDG千万美元A轮融资。7、衣+（图像识别）衣+是计算机视觉搜索引擎，创造人和中意商品的连接。在ImageNet2015计算机视觉竞赛上获得五项世界第一 。团队成员来自于斯坦福、剑桥、IBM、Intel、阿里巴巴、百度等。创始人张默曾就职微软和IBM，任IBM开源联盟负责人、主机Linux中国区技术负责人，还做过平面模特。获1000万美元A轮融资。8、码隆科技（图像识别）主要产品StyleAI，一款通过服饰照片快速了解明星模特们或者其他用户如何搭配类似服饰的应用。团队成员来自微软、百度、腾讯等名企。入选微软创投加速器，已获得1200万元天使轮投资。9、依图科技依图：与您一起构建计算机视觉的未来大数据智慧平台10、tu Simple图森我们提供最佳的自动驾驶解决方案11、飞搜打造最好的在线人脸识别引擎，提供了人脸校验、人脸属性分析、目标场景识别、名人识别、色情识别、食品分析http://www.faceall.cn/12、faceFinger 脸指一直致力于为社会各界提供以人脸、指掌纹等生物特征识别技术为核心的安全防范解决方案。http://www.facefinger.cn:8000/dashboard/demos/index13、颜鉴人脸检测、人脸比对http://colorreco.com/faceCompare最精准的人脸识别、五官定位算法，不论是检出率、错检率、误检率、检测速度、支持旋转角度等标准均处于全球领先水平。.14、Netposa 东方网力科技股份有限公司以视频解码、智能分析、智能检索、云计算等技术为核心，为公安用户提供一整套贴合业务流程的视频侦查装备和管理平台。.15、网易易盾——广告图片识别http://dun.163.com/trial/image/ad.16、车伯乐拍照识车依靠车辆语义分割和机器识别，分析比对图片信息与数据库信息，从而识别出照片中的车辆信息。目前车伯乐的拍照识车准确率已经超过96%。.17、百度研究院http://apistore.baidu.com/.18、荟萃-荟集人力之萃http://huicui.me/?from=singlemessage&isappinstalled=0图片识别可智能识别图片内容、属性、分类、是否涉黄等，支持单图多图多种形式。语音转化可替您将文字转成语音、文字转成方言（真人语音），识别语音、歌曲等。视频识别可以为您完成视频内容收集，字幕识别，视频内容鉴定等内容。视频创作为您拍摄或收集某一主题的视频，以小视频形式上传。网页展示任务可自定义任意网页在用户端展示时间，如新品推广、广告观看等类型。自定义任务抢票？秒杀？联系上下文？只要你脑洞够大，任意H5网页类任务皆可接入。19.深图智服http://www.deepir.com/tech智能鉴别色情、反动、暴力、恐怖、血腥、违规等图片与视频。商标，人脸，检测数百种不同商标，电商以图搜图语义分割，衣物，室外20、Linkfluence社交舆情，营销报告https://linkfluence.com/zh-hans/...三、国外图像处理公司1、Enlitic 医疗诊断Enlitic于2014年8月在三藩市成立，采用深度学习和图像分析帮助医生做出诊断并标记出医学图像中的异常，从而让医疗更加精确和更有效率。例如，Enlitic可以分析X光、核磁共振成像或CT扫描得到的医学图像，然后找出数据中的趋势或单个图像中的异常情况。公司创始人Jeremy Howard（同时也是一名黑客和数据科学家）认为，数据科学是项非常性感的职业。但是，数据科学家现在做的大部分工作却是产品推荐或者广告投放等。他觉得这不够性感。为了给数据科学找到更好的应用，让深度学习做些更有意义的事情，他将注意力放在了医疗方面。他的基本思考是，创造一个类似星际迷航三录仪一样的系统（不过可能无法便携），搜集有关特定病人的数据——从医疗图片、实验室检测结果到医生的便笺——让深度学习分析这些数据，做出诊断并给出治疗建议。这并非让机器替代医生，而是为其提供让诊断更加便利的工具。公司还将与诊所、医院以及其他医疗单位合作，分析算法，进一步精炼公司的技术。2、Affectiva 面部表情分析Affectiva的技术采用先进的计算机视觉算法来捕捉和识别视觉刺激所激发的情感反应。Affectiva的旗舰产品Affdex简单易用；只要一个摄像头，任何地方都可以，也不需要安装软件。另外Affdex也很简洁低调，没有凌乱的布线或电极。3、Deepomatic 计算机视觉Deepomatic正在打造一个能够将媒体图片中任何想要的产品与电子商务网站中同样或类似的产品链接起来的按钮。内容发行者可以将他们的图像经过算法的扫描，检测和识别出其中让人心动的产品（如：时尚产品）。通过将自动理解产品属性和图案颜色的比较相结合，Deepomatic将这些图像和电子商务网站上同样或类似的产品链接在一起。Deepomatic便由此可以和内容所有者分享这个新增的收入来源。4、Clarifai 图像和视频识别2013年，Clarifai的第一个图像识别系统在识别图像中的物体的ImageNet比赛中进入了前五强。自那以后，Clarifai的深度学习系统不断进化，提高了识别的速度、词典的大小和内存的占用，同时应用范围也超出了图像识别，可以从各种形式的数据中提取知识。Clarifai的技术中枢是高性能深度学习API，在这之上Clarifai正在构建新一代智能应用。这让Clarifai能够通过以全新的创新的方式向所有人提供高技术解决方案应对日常问题。公司创始人Matthew Zeiler，纽约大学计算机科学PHD，曾和深度学习领域两个最牛人物一——Geoff Hinton和Yann LeCun一起工作过五年。他发现真正困难的地方是建立学习模式——处理所有视觉数据的关键算法——能够快速处理各种不同图片。Zeiler很清楚，「训练这些模型与其说是科学工作，不如说是种艺术」，「需要很多年的经验。」这正好是Clarifai的切入点。Zieler的想法是，只要用户将照片上传到Clarifai软件，这个软件就会分析出照片里的内容并提供与此类似的更多照片。与传统基于文本的图片搜索截然不同的是，这是真的以视觉为基础的搜索。可以免费获得其API使用：5、Descartes Labs 图像识别、卫星与农业基于深度学习和先进的遥感算法，Descartes Labs正在教导计算机如何看世界以及世界如何随时间改变。他们的第一个应用是使用大量卫星图像（包括可见光段和不可见光段），更好了解全球农作物生产。6、MetaMind 自然语言处理和图像识别MetaMind想让人人都能使用深度学习。该公司正在打造一个用于自然语言处理、图像理解和知识基础的分析的人工智能平台。该公司提供了用于医疗成像、食物识别和解决方案定制的产品。MetaMind希望提供包括自然语言处理在哪的更为广泛多样的工具。 深度学习有望帮助机器真正理解用户说的话，而这种技术的关键特点之一就是能够自我训练，这也是许多人相信它能有助于自然语言处理的根据所在。而这正是另一个MetaMind工具正在开发的领域，当你输入连个句子，这个工具能够告诉你两个句子的相似程度。这种技术能够被商家用来自动回复客户问题。Socher说，用户的询问方式多种多样，尽管绝大多数时候，意思差不都多。这个工具也能用来分析一些社交网络（比如推特）上用户对公司的评价。MetaMind目前从事深度学习咨询的业务，也会提供自己的深度学习服务和软件。借由运行MetaMind的数以百计装备成千上万图像处理器的学习机器，这一在线服务省去了客户建立自己系统的麻烦和成本。但是，如果客户想要运营自己的深度学习系统，MetaMind会为它提供软件和专业服务，如果确有必要的话。7、HyperVerge 计算机视觉与图像识别引擎HyperVerge使用深度学习算法处理云中消费者的图片和视频。HyperVerge开发的用于图像处理的已获专利的专有图像技术模型包括：面部检测、面部识别、场景识别、差照片检测、重复照片检测、照片分类、相册总结、面部美化和照片美化。8、Tractable 计算机视觉Tractable正在开发专有的机器学习算法，重点是用于计算机视觉的深度学习。该公司的重点是让未标记的数据和监督学习一起工作。应用领域包括保险索赔、工业检测、远程监控等.9、服装推荐Indico演示网址：https://indico.io/demos/clothing-matching推荐系统正在日益凸显它的价值。随着商品数目的增加，瞄准那些可能愿意购买某种产品的特定消费人群变得格外重要。在这一类应用的开发中，深度学习同样也能帮助到我们！我不是个时尚爱好者，但是我知道人们会“浪费”很多时间在选择穿什么样的衣服上。如果我们能拥有一个知道我们的喜好并且能够向我们推荐完美的穿着的智能机器人该有多好！幸运的是，在深度学习的帮助下，这成为了可能。Indico 的官方文章（https://indico.io/blog/fashion-matching-tutorial/）已经对它做了非常详细的描述。现在让我们弄清楚你要如何在你的终端上构建这个推荐系统。.10、使用深度学习（Algorithmia API）为照片着色六招教你用Python构建好玩的深度学习应用自动着色一直是计算机视觉社区中的热门话题。从一张黑白图片获得一张彩色照片似乎是件超现实的事。想象一个4岁的孩子拿着蜡笔全神贯注于涂鸦本的场景，我们是否能教会人工智能同样去做这件事情呢？.11、AWS的人脸表情识别https://aws.amazon.com/cn/rekognition/?nc2=h_a1检测图像中的对象、场景和面孔。您还可以搜索和比较面孔。借助 Rekognition 的 API，您可以快速为应用程序添加基于深度学习的复杂视觉搜索和图像分类功能。12、Hashley — 为你的照片自动生成诙谐的标签或评论http://hash.ai/13、Hotness.ai — 基于照片来分析你的性感程度http://hotness.ai/14、Bitesnap — 基于照片的食物识别 AI，可用于控制热量摄入https://getbitesnap.com/Entrupy — 自动识别衣服与配饰的真假https://www.entrupy.com/15、Fify — 帮你买衣服http://fify.ai/16、GoFind —用照片来为你在线搜衣服http://gofind.ai/17、Mode.ai — 帮你在线找衣服http://mode.ai/18、AI Weekly — 每周的人工智能与机器学习新闻、资源汇总http://aiweekly.co19、Approximately Correct —人工智能与机器学习博客http://approximatelycorrect.com/20、Axiomzen — AI 行业通讯半月刊http://ai.axiomzen.co/21、Concerning.ai — AI 评论https://concerning.ai22、Fast.ai —致力于普及深度学习http://www.fast.ai/23、Machinelearning.ai — 专注于机器学习、人工智能新闻http://machinelearning.ai24、Machine Learning Weekly — 一份手工的机器学习、深度学习周报http://mlweekly.com25、PRAI —人工智能、机器学习、深度学习的一个论坛https://pr.ai/index.php26、Rekognition：为社交图片应用提供面部和场景的识别和优化。Rekognition API 可以利用眼睛、嘴、鼻子和面部的特征实现情绪识别和性别检测，可以用来确定性别、年龄和情绪。链接：http://www.programmableweb.com/api/rekognition参考文献：1、机器之心：业界｜最值得关注的18家深度学习创业公司2、知乎，国内有哪些人工智能领域的创业团队或创业公司？版权声明：本文为博主原创文章，转载请注明来源“素质云博客”，谢谢合作！！微信公众号：素质云笔记 https://blog.csdn.net/sinat_26917383/article/details/54864341"}
