{"content2":"Statsbot数据科学家Daniil Korbut写过一篇《Machine Learning Algorithms: Which One to Choose for Your Problem》，简明扼要地介绍了一些比较流行的机器学习算法的典型应用场景，下面摘录其中部分内容（由原作者授权论智翻译）：\n线性回归和线性分类器\n这些可能是机器学习中最简单的算法。你有对象（矩阵A）的特征x1，… xn，以及相应的标签（向量B）。你的目标是根据某些损失函数（例如，用于回归问题的MSE或MAE）找到这些特征的最优权重w1，… wn和偏置值。在MSE的情况下，有一个来自最小二乘法的数学公式：\n在实践中，使用梯度下降来优化更容易，在算力上也更高效。尽管这个算法很简单，但是当你有数以千计的特征时（例如文本分析中的词袋或者n元语法），它的效果相当不错。更复杂的算法面临过拟合众多特征和数据集大小受限的问题，而线性回归在这方面表现不错。\n图片来源：newsdog.today\n为了防止过拟合，我们经常使用lasso和ridge之类的规整化技术。这个想法是，将权重模总和与权重平方总和分别与我们的损失函数相加。你可以阅读一下文章结尾推荐的关于这两个算法的精彩教程。\n逻辑回归\n别因为逻辑回归的名称中带有“回归”一词而将它与回归方法相混淆了，逻辑回归实际上是分类算法。逻辑回归进行二元分类，所以标签输出是二进制的。给定输入特征向量，定义为输出为的条件概率。系数是模型想要学习的权重。\n由于该算法计算归属每个类别的概率，因此应该考虑概率与0或1的偏离程度，并像在线性回归中一样对所有对象进行平均。这样，损失函数是交叉熵的平均值：\n不要恐慌，我来让上面的公式容易理解一点。表示正确答案（0或1），表示预测答案。如果等于0，总和内的第一个加数等于0，根据对数的性质，我们预测的越接近0，第二个加数就越小。y等于1的情况同理。\n逻辑回归哪里强？它接受线性组合的特征，并对其应用非线性函数（sigmoid），所以它是一个非常非常小的神经网络实例！\n决策树\n另一个流行和易于理解的算法是决策树。决策树的图形帮助你看到你在思考什么，决策树的引擎要求一个系统的、记录在案的思考过程。\n这个算法的想法很简单。在每个节点上，我们选择所有特征和所有可能的分割点之中的最佳分割。每个分割都基于极大化某个泛函进行选择。在分类树中我们使用交叉熵和基尼指数。在回归树中，我们最小化该区域中的点的目标值的预测变量与给定赋值的平方误差的总和。\n是否接受新工作的决策树（来源：cway-quantlab）\n我们在每个节点上递归地进行这一流程，直到满足停止条件时结束。停止条件可以是叶节点的最小数量，也可以是树高。 单独的决策树极少使用，但是与其他算法一起，可以构成非常高效的算法，例如随机森林或梯度树提升（Gradient Tree Boosting）。\nK 均值\n有时你对标签一无所知，你的目标是根据对象的特征来分配标签。这被称为聚类任务。\n假设你想把所有的数据对象分成k个聚类。你需要从数据中选择随机的k个点，并将它们命名为聚类的中心。其他对象的聚类由最近的聚类中心确定。然后，重复转变聚类中心直到收敛。\n这是最明晰的聚类技术，但它仍有一些缺点。首先，你应该知道我们尚不知道的聚类的数量。其次，结果取决于在开始时随机选择的点，算法不保证我们达到泛函的全局最小值。\n推荐阅读中包括了一系列各有优劣的聚类方法。\n主成分分析（PCA）\n你是否曾在最后一晚或者最后几个小时准备艰难的考试？ 你没有机会记住所有的信息，但是你想要在可用的时间内最大限度地记住信息，例如，首先学习多场考试中都会用到的定理，等等。\n主成分分析基于同样的想法。该算法提供了降维。有时你有范围很广的特征，而且很可能彼此高度相关，并且模型很容易会过拟合大量的数据。那么，你可以应用PCA。\n你应该计算某些向量的投影，以最大化数据的方差，并尽可能少地损失信息。令人惊讶的是，这些向量正是数据集特征的相关矩阵的特征向量。\n图片来源：Analytics Vidhya\n现在，算法的思路已经很清楚了：\n计算特征列的相关矩阵，找出该矩阵的特征向量。\n接受这些多维向量，并计算它们上的所有特征的投影。\n新特征是投影的坐标，其数量取决于计算投影的特征向量的计数。\n神经网络\n讨论逻辑回归时，我已经提到了神经网络。有很多不同架构的神经网络，它们在特定的任务中价值很高。更常见的情况，神经网络是一系列的层和组件，其间是线性连接，接着会用到非线性。\n卷积深度神经网络在处理图像方面展现出很好的效果。非线性表现为卷积层和池化层，能够捕捉图像的特征。\n图片来源：smash\n处理文本和序列，较好的选择是循环神经网络。 RNN包含LSTM或GRU模块，并且可以使用我们预先知道维度的数据。也许，RNN最著名的应用之一就是机器翻译。\n总结\n线性回归和线性分类器。 尽管看起来简单，但是它们很善于处理大量特征（更高级的算法在这种情况下面临过拟合问题）。\n逻辑回归是最简单的非线性分类器。它基于参数的线性组合和非线性函数（sigmoid），并适用于二元分类。\n决策树经常与人们的决策过程类似，因此易于解释。但它们通常用于诸如随机森林或梯度提升之类的组合中。\nK 均值是一个更原始，但非常容易理解的算法，可以完美地成为许多问题的基准。\nPCA是一个优秀的选择，在最小化信息损失的前提下，降低特征空间的维度。\n神经网络是机器学习算法的一个新时代，可以应用于许多任务，但是神经网络的训练需要巨大的计算复杂度。\n推荐阅读\nOverview of clustering methods [1]\nA Complete Tutorial on Ridge and Lasso Regression in Python [2]\nYouTube channel about AI for beginners with great tutorials and examples [3]\nhttp://scikit-learn.org/stable/modules/clustering.html#overview-of-clustering-methods\nhttps://www.analyticsvidhya.com/blog/2016/01/complete-tutorial-ridge-lasso-regression-python/\nhttps://www.youtube.com/channel/UCWN3xxRkmTPmbKwht9FuE5A\n人工智能赛博物理操作系统\nAI-CPS OS\n“人工智能赛博物理操作系统”（新一代技术+商业操作系统“AI-CPS OS”：云计算+大数据+物联网+区块链+人工智能）分支用来的今天，企业领导者必须了解如何将“技术”全面渗入整个公司、产品等“商业”场景中，利用AI-CPS OS形成数字化+智能化力量，实现行业的重新布局、企业的重新构建和自我的焕然新生。\nAI-CPS OS的真正价值并不来自构成技术或功能，而是要以一种传递独特竞争优势的方式将自动化+信息化、智造+产品+服务和数据+分析一体化，这种整合方式能够释放新的业务和运营模式。如果不能实现跨功能的更大规模融合，没有颠覆现状的意愿，这些将不可能实现。\n领导者无法依靠某种单一战略方法来应对多维度的数字化变革。面对新一代技术+商业操作系统AI-CPS OS颠覆性的数字化+智能化力量，领导者必须在行业、企业与个人这三个层面都保持领先地位：\n重新行业布局：你的世界观要怎样改变才算足够？你必须对行业典范进行怎样的反思？\n重新构建企业：你的企业需要做出什么样的变化？你准备如何重新定义你的公司？\n重新打造自己：你需要成为怎样的人？要重塑自己并在数字化+智能化时代保有领先地位，你必须如何去做？\nAI-CPS OS是数字化智能化创新平台，设计思路是将大数据、物联网、区块链和人工智能等无缝整合在云端，可以帮助企业将创新成果融入自身业务体系，实现各个前沿技术在云端的优势协同。AI-CPS OS形成的数字化+智能化力量与行业、企业及个人三个层面的交叉，形成了领导力模式，使数字化融入到领导者所在企业与领导方式的核心位置：\n精细：这种力量能够使人在更加真实、细致的层面观察与感知现实世界和数字化世界正在发生的一切，进而理解和更加精细地进行产品个性化控制、微观业务场景事件和结果控制。\n智能：模型随着时间（数据）的变化而变化，整个系统就具备了智能（自学习）的能力。\n高效：企业需要建立实时或者准实时的数据采集传输、模型预测和响应决策能力，这样智能就从批量性、阶段性的行为变成一个可以实时触达的行为。\n不确定性：数字化变更颠覆和改变了领导者曾经仰仗的思维方式、结构和实践经验，其结果就是形成了复合不确定性这种颠覆性力量。主要的不确定性蕴含于三个领域：技术、文化、制度。\n边界模糊：数字世界与现实世界的不断融合成CPS不仅让人们所知行业的核心产品、经济学定理和可能性都产生了变化，还模糊了不同行业间的界限。这种效应正在向生态系统、企业、客户、产品快速蔓延。\nAI-CPS OS形成的数字化+智能化力量通过三个方式激发经济增长：\n创造虚拟劳动力，承担需要适应性和敏捷性的复杂任务，即“智能自动化”，以区别于传统的自动化解决方案；\n对现有劳动力和实物资产进行有利的补充和提升，提高资本效率；\n人工智能的普及，将推动多行业的相关创新，开辟崭新的经济增长空间。\n给决策制定者和商业领袖的建议：\n超越自动化，开启新创新模式：利用具有自主学习和自我控制能力的动态机器智能，为企业创造新商机；\n迎接新一代信息技术，迎接人工智能：无缝整合人类智慧与机器智能，重新\n评估未来的知识和技能类型；\n制定道德规范：切实为人工智能生态系统制定道德准则，并在智能机器的开\n发过程中确定更加明晰的标准和最佳实践；\n重视再分配效应：对人工智能可能带来的冲击做好准备，制定战略帮助面临\n较高失业风险的人群；\n开发数字化+智能化企业所需新能力：员工团队需要积极掌握判断、沟通及想象力和创造力等人类所特有的重要能力。对于中国企业来说，创造兼具包容性和多样性的文化也非常重要。\n子曰：“君子和而不同，小人同而不和。”  《论语·子路》云计算、大数据、物联网、区块链和 人工智能，像君子一般融合，一起体现科技就是生产力。\n如果说上一次哥伦布地理大发现，拓展的是人类的物理空间。那么这一次地理大发现，拓展的就是人们的数字空间。在数学空间，建立新的商业文明，从而发现新的创富模式，为人类社会带来新的财富空间。云计算，大数据、物联网和区块链，是进入这个数字空间的船，而人工智能就是那船上的帆，哥伦布之帆！\n新一代技术+商业的人工智能赛博物理操作系统AI-CPS OS作为新一轮产业变革的核心驱动力，将进一步释放历次科技革命和产业变革积蓄的巨大能量，并创造新的强大引擎。重构生产、分配、交换、消费等经济活动各环节，形成从宏观到微观各领域的智能化新需求，催生新技术、新产品、新产业、新业态、新模式。引发经济结构重大变革，深刻改变人类生产生活方式和思维模式，实现社会生产力的整体跃升。\n产业智能官  AI-CPS\n用“人工智能赛博物理操作系统”（新一代技术+商业操作系统“AI-CPS OS”：云计算+大数据+物联网+区块链+人工智能），在场景中构建状态感知-实时分析-自主决策-精准执行-学习提升的认知计算和机器智能；实现产业转型升级、DT驱动业务、价值创新创造的产业互联生态链。\n长按上方二维码关注微信公众号： AI-CPS，更多信息回复：\n新技术：“云计算”、“大数据”、“物联网”、“区块链”、“人工智能”；新产业：“智能制造”、“智能金融”、“智能零售”、“智能驾驶”、“智能城市”；新模式：“财富空间”、“工业互联网”、“数据科学家”、“赛博物理系统CPS”、“供应链金融”。\n本文系“产业智能官”（公众号ID：AI-CPS）收集整理，转载请注明出处！\n版权声明：由产业智能官（公众号ID：AI-CPS）推荐的文章，除非确实无法确认，我们都会注明作者和来源。部分文章推送时未能与原作者取得联系。若涉及版权问题，烦请原作者联系我们，与您共同协商解决。联系、投稿邮箱：erp_vip@hotmail.com"}
