{"content2":"编者注： 更多人工智能业务方面重要的发展请关注2018年4月10-13日人工智能北京大会。\n人工智能的奇妙之处在于，它能让机器像人类一样拥有理解能力，完成智能任务。而它的难解之处在于，如何让人工智能拥有理解力，甚至让机器可以像人一样思考。让人工智能“听懂人话”，是近几年数据科学家们一直在做的努力，也收获了很多欣喜：\n为用户提供实时应答服务；\n为用户提供精确的搜索、推荐等个性化服务；\n辅助医生对患者进行综合诊疗；\n在无人驾驶、新闻传媒、在线娱乐、金融、教育等领域还将有许多令人期待的美好应用前景。\n可这些离人工智能像人的“小目标”还远着呢！尽管机器学习、深度学习、神经网络的发展推动自然语言技术的进步，但想要让机器学会理解，首先需要攻克人工智能的核心领域——自然语言处理技术（NLP）。关于它的技术痛点，应用难题，你都会在AI Conference 2018北京站 “自然语言处理与语音技术”板块中茅塞顿开。\n这里汇集了传媒/新闻、机器翻译、电信和教育行业的应用案例，先进的模型与算法,这里有我们耳熟能详的小冰，还有百度、微软、Intel、谷歌这些人工智能巨头，分享他们这些年在人工智能上翻过的山，趟过的河。\n在进入NLP的世界探究其奥秘之前，我迫不及待的要分享给你一些很有价值的内部消息：\n1. 你将会成为少数深入了解微软小冰的一员\n方向：与人工智能交互\n主题：小冰从人类与AI之间的对话中学到的经验教训\n主讲人：周力（微软中国）\n语音识别是人机交互的入口，经过四年的探索，小冰已经成为科技史上最大规模的人工智能情感计算框架系统。她当过歌手、诗人、主持人、评论员、客服，与中国、日本和美国超过1亿用户进行互动，从中学习人类特有的情感。小冰的每一次演进都让我们对机器能做什么产生了非常多的联想，这次又是什么呢？\n4月12日，微软小冰首席架构师周力博士将亲自带着小冰来到AI Conference 2018北京站，与大家分享在过去四年中研究微软小冰的感悟。希望在不久的将来，人类的生活会因为与人工智能的直接交流，变得更加美好。\n❖\n2. 使用Intel AI技术的NLP企业案例让你醍醐灌顶\n方向：模型与方法\n主题：深度学习时代的数据科学和自然语言处理\n主讲人：Yinyin Liu（Intel Nervana）\n2016年起，Intel逐渐将自己的战略重心转移到了数据科学和人工智能领域，向业界提供 AI 解决方案。最近几年主要的AI推动力是由深度学习产生的，NLP利用深度学习最新算法发展例如文档理解之类的应用，使公司能够筛查海量文本，分类并找到相关信息。\nIntel人工智能产品事业部数据科学主任Yinyin Liu将会与你讨论深度学习最新发展如何影响处理文本、语言及基于对话应用，并启发了利用数据的新方向。另外，还毫不吝啬的为大家分享一些使用Intel® AI技术的NLP企业案例。\n❖\n3. NLP落地金融了\n方向：模型与方法\n主题：使用AI来分析财务新闻的影响\n主讲人：ZhefuShi (密苏里大学)\nAI的领域在不断地进展之中，越来越多的公司认识到NLP对于金融行业分析的重要作用。在金融领域，AI技术对分析金融新闻的影响是有帮助的，将非结构化数据结构化处理，从中探寻影响市场变动的线索。比如通过历史金融新闻预测价格趋势，评估市场风险；为监管人员提供企业监管、市场监管、舆情监控；应用知识图谱和图谱计算技术来进行风险管理、供应链金融管理和投融资管理等。\n但自然语言处理技术，目前是人工智能进行场景落地时的一大难点重点。密苏里大学的Zhefu Shi博士带着自己的知识宝库与你分享如何使用AI来分析财务新闻的影响，如何提取金融实体信息并将其用于分析业务影响，敬请关注。\n❖\n4. 提升深度学习的表现有技巧\n方向：企业人工智能, 实施人工智能, 模型与方法\n主题：深度学习在文本挖掘中的应用\n主讲人：Emmanuel Ameisen (Insight DataScience), Jeremy Karnowski (Insight Data Science)\n深度学习在自然语言处理中的应用非常广泛，可以说横扫自然语言处理的各个应用，从底层的分词、语言模型、句法分析等到高层的语义理解、对话管理、知识问答等方面都几乎都有深度学习的模型，并且取得了不错的效果。多数公司已经开始利用文本数据支持部分业务运营，但也遇到了一系列挑战，其中包括如何验证和解释模型性能，以及模型复杂性如何影响部署它们的简便性。\nEmmanuel Ameisen和Jeremy Karnowski通过对google，Facebook，Amazon，Twitter，Salesforce，Airbnb等超过75个团队的对话进行分析，得到了很有价值的研究成果。分享他们如何从传统的机器学习算法转变成更有表现力的深度学习模型，如卷积神经网络和回归神经网络。这些新技术使公司能够改进许多关键业务操作，您将学习不同模型在不同项目中的应用，并了解如何选择最适合您项目的模型。\nGartner认为，未来10年，人工智能将成为最具破坏性级别的技术，主要是因为卓越的计算能力、漫无边际的数据集、深度神经网络领域的超乎寻常的进步。与其停留观望不如赶快行动，跟着大咖学习人工智能领域NLP的新知识，借鉴他们在人工智能布局的新思路。\n自然语言处理技术与语音技术\n15个议题   6大方向\n企业人工智能、模型与方法\n实施人工智能、人工智能交互\n……\n4月10-13日，AI Conference 2018北京站已经准备好了，你呢？"}
