{"content2":"1.计算机视觉\n是指计算机从图像中识别出物体、场景和活动的能力。计算机视觉技术运用由图像处理操作及其他技术所组成的序列来将图像分析任务分解为便于管理的小块任务。比如，一些技术能够从图像中检测到物体的边缘及纹理。分类技术可被用作确定识别到的特征是否能够代表系统已知的一类物体。\n计算机视觉有着广泛应用。其中包括，医疗成像分析被用来提高疾病的预测、诊断和治疗；人脸识别被Facebook用来自动识别照片里的人物；在安防及监控领域被用来指认嫌疑人；在购物方面，消费者现在可以用智能手机拍摄下产品以获得更多购买选择。\n机器视觉作为一个相关学科，泛指在工业自动化领域的视觉应用。在这些应用里，计算机在高度受限的工厂环境里识别诸如生产零件一类的物体，因此相对于寻求在非受限环境里操作的计算机视觉来说目标更为简单。计算机视觉是一个正在进行中的研究，而机器视觉则是“已经解决的问题”，是系统工程方面的课题而非研究层面的课题。因为应用范围的持续扩大，计算机视觉领域的初创公司自2011年起已经吸引了数亿美元的风投资本。\n2.机器学习\n指的是计算机系统无需遵照显式的程序指令而只是依靠暴露在数据中来提升自身性能的能力。其核心在于，机器学习是从数据中自动发现模式，模式一旦被发现便可用于做预测。比如，给予机器学习系统一个关于交易时间、商家、地点、价格及交易是否正当等信用卡交易信息的数据库，系统就会学习到可用来预测信用卡欺诈的模式。处理的交易数据越多，预测就会越好。\n机器学习的应用范围非常广泛，针对那些产生庞大数据的活动，它几乎拥有改进一切性能的潜力。除了欺诈甄别之外，这些活动还包括销售预测、库存管理、石油和天然气勘探、以及公共卫生。机器学习技术在其他的认知技术领域也扮演着重要角色，比如计算机视觉，它能在海量图像中通过不断训练和改进视觉模型来提高其识别对象的能力。现如今，机器学习已经成为认知技术中最炙手可热的研究领域之一，在2011-2014年中这段时间内就已吸引了近十亿美元的风险投资。谷歌也在2014年斥资4亿美金收购Deepmind这家研究机器学习技术的公司。\n3.自然语言处理\n是指计算机拥有的人类般文本处理的能力，比如，从文本中提取意义，甚至从那些可读的、风格自然、语法正确的文本中自主解读出含义。一个自然语言处理系统并不了解人类处理文本的方式，但是它却可以用非常复杂与成熟的手段巧妙处理文本，例如自动识别一份文档中所有被提及的人与地点；识别文档的核心议题；或者在一堆仅人类可读的合同中，将各种条款与条件提取出来并制作成表。以上这些任务通过传统的文本处理软件根本不可能完成，后者仅能针对简单的文本匹配与模式进行操作。请思考一个老生常谈的例子，它可以体现自然语言处理面临的一个挑战。在句子“光阴似箭（Timeflieslikeanarrow）”中每一个单词的意义看起来都很清晰，直到系统遇到这样的句子“果蝇喜欢香蕉（Fruitflieslikeabanana）”，用“水果（fruit）”替代了“时间（time）”，并用“香蕉（banana）”替代“箭（arrow）”，就改变了“飞逝／飞着的（like）”与“像／喜欢（like）”这两个单词的意思。\n自然语言处理，像计算机视觉技术一样，将各种有助于实现目标的多种技术进行了融合。建立语言模型来预测语言表达的概率分布，举例来说，就是某一串给定字符或单词表达某一特定语义的最大可能性。选定的特征可以和文中的某些元素结合来识别一段文字，通过识别这些元素可以把某类文字同其他文字区别开来，比如垃圾邮件同正常邮件。以机器学习为驱动的分类方法将成为筛选的标准，用来决定一封邮件是否属于垃圾邮件。\n因为语境对于理解“timeflies（时光飞逝）”和“fruitflies（果蝇）”的区别是如此重要，所以自然语言处理技术的实际应用领域相对较窄，这些领域包括分析顾客对某项特定产品和服务的反馈、自动发现民事诉讼或政府调查中的某些含义、以及自动书写诸如企业营收和体育运动的公式化范文等。\n4.机器人技术\n将机器视觉、自动规划等认知技术整合至极小却高性能的传感器、致动器、以及设计巧妙的硬件中，这就催生了新一代的机器人，它有能力与人类一起工作，能在各种未知环境中灵活处理不同的任务。例如无人机，还有可以在车间为人类分担工作的“cobots”，还包括那些从玩具到家务助手的消费类产品。\n5.语音识别技术\n主要是关注自动且准确的转录人类的语音。该技术必须面对一些与自然语言处理类似的问题，在不同口音的处理、背景噪音、区分同音异形异义词(“buy”和“by”听起来是一样的)方面存在一些困难，同时还需要具有跟上正常语速的工作速度。语音识别系统使用一些与自然语言处理系统相同的技术，再辅以其他技术，比如描述声音和其出现在特定序列和语言中概率的声学模型等。语音识别的主要应用包括医疗听写、语音书写、电脑系统声控、电话客服等。比如Domino’sPizza最近推出了一个允许用户通过语音下单的移动APP。\n上面提到的认知技术进步飞快并吸引了大量投资，其他相对成熟的认知技术仍然是企业软件系统的重要组成部分。这些日渐成熟的认知技术包括决策最优化——自动完成对复杂决策或者在资源有限的前提下做出最佳权衡；规划和调度——使设计一系列行动流程来满足目标和观察约束；规则导向系统——为专家系统提供基础的技术，使用知识和规则的数据库来自动完成从信息中进行推论的处理过程。\n人工智能、大数据、云计算和物联网的未来发展值得重视，均为前沿产业，多智时代专注于人工智能和大数据的入门和科谱，在此为你推荐几篇优质好文：\n未来人工智能技术，主要包含哪几种？\nhttp://www.duozhishidai.com/article-4938-1.html\n一文掌握人工智能各大分支技术，最全技术图谱！\nhttp://www.duozhishidai.com/article-2290-1.html\n人工智能来势凶猛，人工智能最热门的技术趋势是什么？\nhttp://www.duozhishidai.com/article-923-1.html\n多智时代-\n人工智能\n和\n大数据\n学习入门网站|人工智能、大数据、\n物联网\n、\n云计算\n的学习交流网站"}
