{"content2":"隔壁有个妹纸喷我 ，好高兴....给她回复了下\n哎呀，没想到是个妹纸，其实我就随便那么一说，没合计妹纸还专门写个檄文声讨我，受宠若惊\n其实你的评论一看就比较专业，所以我就去你博客大概扫了一眼，发现个大问题，感觉就是一基层技术人员，所以就没当回事...\n包括你写的这个三月的学习思路，基本还是按码农那个路子来的，一上来就要撸起袖子敲代码。\n机器学习我肯定是门都没入啦，但要说如何从码农做到架构师做到技术总监，这方面我觉得肯定比你有经验。\n我想我俩的水平肯定都不是搞学术，而是搞应用级技术本质上并没有比传统信息系统技术栈复杂多少，长多少，我可以说在传统信息系统中弦哥这样的老程序员掌握的编程思想、编程哲学、架构设计、解决方案选型这方面肯定要甩你几条街的。这些难题同样会在机器学习应用级技术领域出现，也决定了你能走多远。\n我想你还年轻，你没见过也不会去想一个程序员的瓶颈，我年纪大点，也带了很多年团队，见过很多在这个瓶颈上痛苦徘徊迷茫的程序员，原因是啥？就是因为你的这种学习思路和方法。\n当然年轻人不服就干的精神是非常非常可贵的，支持你这个系列，一起学习，另外也别给自己太大压力哟。\n今天我们的学习目标是，搞清楚hand-crafted rules实现人工智能的方式及其缺陷，以及如何识别江湖骗子。\n上篇我们讲到在machine learning之前基本都是靠hand-crafted rules去实现所谓人工智能。这部分太简单，一般教科书都是以“我们都知道...”一笔带过，这无疑给不知道的同学带来一记重拳！这篇我们通过两个例子去讲。\n弦哥养了个狗子叫二丫，刚领回家的一段时间，只要二狗子撒尿，我就会喊“尿！”，像精神病似的喊了一个月，二狗子建立起了简单的逆向条件反射。\nif(有人喊尿)\n就蹲下撒尿\n一天去遛狗，对面迎来两个妹纸，弦哥大吼一声：“尿！”，二狗子立马蹲下就尿。其中的那个萌妹子：“哇！好聪明的狗狗！”（*萌妹子以为二狗子能听懂指令，感觉狗子具备智能。），另外一个妹纸是机器学习专业的，不以为然，学着弦哥的样子也吼了一声：“尿！”，二狗子立马又蹲下，然而由于刚尿完，所以只能做着蹲的姿势并没有尿，场面比较尴尬...（*如果是小孩就会真正理解尿这个指令的含义，这时候他会说：”daddy，我没有尿！“，而不会把裤子脱了。），这时候机器学习专业妹纸又得意的吼了一声：”不准尿！“，倒霉的二狗子又蹲下了，姿势显得更加猥琐，不解的看着我们...（*所谓的一些智能声控灯也有这个问题，你喊：”不要关灯！“，他也会把灯给你关了。）。我原本打算继续给萌妹子表演狗子拉屎、狗子拜年、狗子打滚、狗子做加法，让妹纸觉得狗子具备小孩的智商，（*这些都可以通过简单的if语句实现，组合起来会让机器看起来更具备智能。）但由于有行家在，只能悻悻的牵着笨狗子走了，搭讪失败！\n图为弦哥家只会hand-crafted rules的笨狗子\n小结：hand-crafted rules实现的人工智能，其本质就是通过许多if判断语句去实现，然而并不能完成比较复杂的任务，由于需要编写大量的if语句，工作量非常大不说还会经常出现一些可笑的错误，早期的一些所谓智能聊天机器人，基本都是用这种技术。\n第二个例子，弦哥在东北混，对喊麦十分在行，如果我说，能编写一个叫“社会你弦哥”的智能说唱喊麦机器人，你随便说个五言绝句，“社会你弦哥”就能喊麦唱出来，你信不信？。伪代码如下：\n将输入的一首五言诗分成4句；\n在每句的第二个字后面随机加上“我、他、那、这”的其中任意一个字；\n最后按“咚次哒次”的节奏加重音读出来；\n我们运行下这段程序试试，老师来音乐！大家的手举起来嗨~\n锄禾我日当午！\n汗滴他禾下土！\n谁知这盘中餐！\n粒粒他艰辛苦！\n再来一个， 接着嗨~\n离离那原上草！\n一岁他一枯荣！\n野火我烧不尽！\n春风这吹又生！\n据说有媒体采访一位专业的音乐评论家，让他谈谈对“MC天佑”喊麦的看法，他只说了一句“请尊重我的专业...\"。\n小结：基本的hand-crafted rules加上一些其他专业领域的基础知识，就被很多人用来忽悠是人工智能。\n这个结论不是我说的，一个国内业界小有名气的朋友私下告诉弦哥，目前人工智能领域市场估值很高，很多创业公司为了骗投资人和政府支持，搞的所谓人工智能产品就是这些东西。\n国外也一样，业界知名大牛尼古拉斯·赵四(*没听清名字)在facebook上发过一副漫画，说的也是这个事。\n图片来源：台大电机系李宏毅教授机器学习讲义截图\n谈个我并不是要说明IT圈比娱乐圈还乱，也不是不尊重业内的老师，毕竟我也搞过什么大数据主动服务之类的玩意，大家都混口饭吃不容易。只是想再次勉励同学们，人工智能没有想象的那么难，不要被业内动辄清华北大斯坦福的title吓到，王健林都说了清华北大不如胆子大，哈哈。比如deep learning已经属于应用级技术，有很多开源项目支撑，可以不太准确的说paper级别的理论咱们也用不到，且在商业应用领域意义也不大。\n当然这个系列会越来越难，遇到困难的时候，同学们要有信心、耐心和坚持！"}
