{"content2":"机器学习、深度学习以及人工智能正在快速演进\n机器学习、深度学习和人工智能（ML、DL和AI）是彼此相关的概念，他们正在改变不知多少行业，改变其自身管理模式，同时改变做出决策的方式。\n显然，ML、DL和AI对于各行各业都非常重要，却也十分复杂，同时非常迅速发展着。\n人工智能（Artificial Intelligence，AI）\nAI用来形容涉及高级计算智能的最宽泛的说法。1956年，在达特茅斯人工智能大会上，该技术被描述为：“原则上，学习的每一个方面或任何其他智能特征都可以精确描述，并且一台机器可以模拟它。”\nAI可以指代很多东西，比如下棋的计算机程序，或者像亚马逊的Alexa那样可以理解并应答的语音识别系统。\nAI可以大致分为三个种类：狭义AI，通用人工智能（AGI）以及超智能AI。\nIBM的Deep Blue（深蓝）在1996年的比赛中击败了国际象棋大师加里·卡斯帕罗夫，2016年谷歌DeepMind的AlphaGo击败了韩国围棋九段李世石，这些都是狭义AI在某个特定的任务下比较成熟的例子。\nAI与通用人工智能（AGI）不同，AGI是能够达到人类水平的AI，它可以执行一系列任务。\n超智能AI则更先进一步。正如牛津大学哲学家Nick Bostrom所描述的——这是一种智慧，比每个领域最牛的人类智慧都要聪明，包括科学创造力、一般智慧和社交技能。换句话说，超智能AI时代是当机器人超越了人类的时代。\n机器学习（Machine Learning，ML）\n机器学习是AI的一个子集。机器学习的核心原则是机器如何获取数据以及“学习”本身。对于企业来讲，ML系统目前是AI套件中最有前途的使用工具。ML系统可以快速应用来自大型数据集的知识和训练，它们在面部识别、语音识别、对象识别、翻译和许多其他任务方面表现卓越。与手动编码完成各种任务、具有特定指令的软件程序不同，ML允许系统学习自己识别模式并进行预测。\n虽然深蓝和DeepMind都属于AI，但是深蓝是基于规则的，它有赖于编程——所以它并不属于机器学习的一种形式。\n那么，你的企业是否有兴趣将机器学习融入战略规划中呢？亚马逊、百度、谷歌、IBM、微软等企业已经提供了不同的商业化机器学习平台。\n深度学习（Deep Learning，DL）\n深度学习是机器学习的一个子集。它使用一些机器学习技术解决现实世界的问题，通过开发神经网络，模拟人类的决策。深度学习有时非常昂贵，因为它需要大量的数据集来训练自己。 这是因为，大量的参数需要被学习算法所理解，这才能够初步确定大量的假正值。比如说，我们可以利用深度学习算法来“学习”猫的样子，它需要非常庞大的数据集的图像来训练，以了解非常细微的细节，区分是一只猫，还是猎豹，还是美洲豹，或者是狐狸。\n在深度学习领域，最著名的标志性事件是2016年3月DeepMind的AlphaGo，以5比4的成绩击败了围棋世界冠军李世石。 根据Google的说法，该深度学习系统的工作方式是结合了“蒙特卡罗树搜索”与“深度神经网络”，该神经网络通过从人类专家游戏训练，以及从自我游戏的强化学习中实现监督式学习。\n深度学习也有广泛的商业用途。它可以分析大量的数据，比如数百万张图像，并识别某些特性。基于文本的搜索、欺诈检测、垃圾邮件检测、手写识别、图像搜索、语音识别、街景视图检测和翻译等，都是可以通过深度学习执行的任务。在Google，深度学习网络已经取代了许多“手动操作的基于规则的系统”。\n机器学习的三大趋势\n总而言之，人工智能是一个通用术语，它可以指计算机下棋程序，也可以指亚马逊的Alexa语音识别系统等等。\n跟踪这些工具将如何发展非常重要。实际上，机器学习已然出现了三大趋势。\n第一个趋势是无监督学习的出现。训练ML / DL工具的主要方法是监督式的。这种方法需要使用大量的标记数据。新的趋势是无监督式学习，它的最大的好处是无监督学习不需要庞大的数据集。\n第二个趋势是生成式对抗网络（GAN）的发展。为了理解GAN，我们有必要了解判别式模型。判别式模型使用标记的历史数据进行训练，并使用累计的知识来推断，而生成模型则更少依赖已存储的知识，生成式模型根据“训练过程中获得的见解”综合或提出观点。\n第三个趋势是增强学习（RL）。增强学习是通过实验和探索的方式学习的。它与监督学习的不同之处在于，它不是从“世界如何工作”或“良好的训练数据”等先入为主的概念开始的。\n当然，我们很难通过一篇文章熟稔这些概念，但是重要的是，这些尖端的技术正在不断增长和变化。\n实际上，从这些想法的诞生，到在商业、军事、政府等领域真正应用，转化的时间还很短。今年2月中旬，福布斯杂志举了两个将AI用于商业的例子——Equifax和SAS。前者开发深度学习工具，以提高信用评分，后者向其数据挖掘工具添加新的深度学习功能，并提供深度学习API。\n------------------------------\n本人微信公众帐号： 心禅道（xinchandao）\n本人微信公众帐号：双色球预测合买（ssqyuce）"}
