{"content2":"9月10是一年一度的教师节，中国科学院大学选择了这一天为新设立的人工智能技术学院正式揭牌。首批研究生正式注册为中国科学院大学人工智能技术学院学生。\n今年的5月28日，中国科学院大学对外发文成立人工智能技术学院，这也是国内人工智能领域首个开展教学和科研工作的新型学院。短短的几个月时间，中国科学院大学建立了学院管理组织和规章制度，开展了课程体系与课程设置方案的设定，完成了开展教学、科研师资力量的配置等工作。\n据AI科技评论了解到，此次出席揭牌仪式的是国科学院院长、国科大名誉校长白春礼院士，中国科学院副院长、国科大党委书记张杰院士，中国科学院副院长、国科大校长丁仲礼院士，中科院自动化所智能感知与计算研究中心主任、人工智能学院学术委员会主任谭铁牛院士，以及中科院自动化所所长、国科大人工智能学院院长徐波。大会仪式主持人为国科大党委常务副书记、副校长董军社。\n中科院白春礼院长（右二）、张杰副院长（右一）、丁仲礼副院长（左一）、自动化所徐波所长（左二）共同揭牌\n此外还有中国科学院办公厅副主任黄从利，中国科学院前沿科学与教育局副局长王颖，自动化所副所长、人工智能学院副院长、教学委员会主任刘成林共同出席活动，学院共建单位相关部门负责人、部分导师代表以及2017级全体新生参加了会议。\n白春礼院长等院领导集体与人工智能学院老师、首届新生合影\n徐波所长主持人工智能学院首届新生开学典礼\n徐波所长在随后举行的人工智能学院首届新生开学典礼上，感谢中科院领导及各相关部门对学院建设的关心和大力支持，介绍了学院成立的相关背景与历程，并值此第33个教师节之际，祝福自动化所和人工智能学院全体教师节日快乐！\n中科院前沿科学与教育局副局长王颖致辞\n王颖副局长对人工智能学院成立表示祝贺，期望学院能够抓住人工智能领域学科发展的历史机遇，主动谋划、把握方向，把高端人才队伍建设作为重中之重，创新探索完善教育体系，打造人才培养新模式，培养具有前瞻科学思想、通晓技术创新的纵向贯通式的复合型科技人才。\n谭铁牛院士《人工智能的发展回顾与展望》专题报告\n原中科院副院长谭铁牛院士在学院新生开学典礼上做了《人工智能的发展回顾与展望》专题报告，为首届研究生讲授开学专业第一课。报告回顾了人工智能60多年来发展历程，展望人工智能领域的前沿问题和发展趋势，结合自身长期从事人工智能研究的深刻见解，引领大家探索前沿，客观分析，正确认识，拓展视野，启发同学们认真规划即将开启的学术生活，并寄望同学们珍惜恰逢其时的大好机遇，志存高远，刻苦学习，努力为加快建设创新型国家和世界科技强国、实现“两个一百年”奋斗目标和中华民族伟大复兴中国梦提供强大支撑。\n办学体制\n根据中国科学院大学“科教融合”的办学体制，人工智能学院由中科院自动化所承办，联合中科院计算所、软件所、声学所、沈阳自动化所、深圳先进院、数学与系统科学院、重庆绿色智能研究院等单位共同建设，旨在打造我国人工智能领域首个全面开展教学和科研工作的新型科教融合学院。\n刘成林副院长介绍学院教学与课程设计情况\n刘成林副院长代表学院教学委员会报告了学院教学与课程设计总体情况。他介绍说，人工智能学院课程体系结合该领域学科前沿和重大应用需求，涵盖了智能领域主要研究方向，体现基础理论、关键技术、重大应用相结合的特点。在设置上以控制科学与工程一级学科基础性知识为准设立核心课，以人工智能学科前沿领域系统理论和技术设置专业普及课，以前沿科学和技术设置专业研讨课。面向人工智能发展态势和人才现状，学院还将围绕产业态势，联合学术界、产业界开设前沿系列讲座、国际学术前沿暑期课程等。\n办学目标\n当前，人工智能发展进入新阶段，国务院发布了《新一代人工智能发展规划》，明确指出要建设人工智能学科，完善人工智能领域学科布局，鼓励高校、科研院所与企业等机构合作开展人工智能学科建设。\n丁仲礼校长指出：\n人工智能是引领中国未来的战略性技术，是新一轮产业变革的核心驱动力。人工智能的发展离不开人才的支撑。中科院作为我国在科学技术方面的最高学术机构和全国自然科学与高新技术的综合研究与发展中心，有责任和义务承担起培养人工智能人才的重大历史使命。\n具体的办学宗旨是：顺应时代发展，面向国际学科前沿与社会发展需求，聚焦人工智能领域核心科学和关键技术，汇聚国内人工智能领域的优质资源，以中国科学院大学为核心、研究所深度参与，建设国家级的智能科技教育平台，努力形成科研、教育、创业、产业深度融合，创新型人才培养与技术应用型人才培养互补，专业化培育与定制型培育结合的教育体系。\n乐投网评论：随着人工智能发展进入新阶段，国务院发布《新一代人工智能发展规划》之后，开设人工智能专业、培养越来越多的AI人才已是当前迫切所需。目前一些AI公司，为解决人才需求，已经开始在企业内部实行导师培养，像专注于计算机视觉领域的商汤科技，团队中就有18名教授，120多名博士，形成了导师带学生机制。但是还有很多企业没有这么多，这么好的人力资源，只能依靠学校输送人才。中国科学院大学开了个好头，相信不久会有越来越多高校开展类似专业。如果实施顺利的话，未来三至五年，AI人才紧缺的现状将会大大改善。"}
