{"content2":"1什么是计算机视觉\n计算机视觉（Computer Vision）是指用计算机实现人的视觉功能——对客观世界的三维场景的感知、识别和理解。\n这意味着计算机视觉技术的研究目标是使计算机具有通过二维图像认知三维环境信息的能力。因此不仅需要使机器能感知三维环境中物体的几何信息（形状、位置、姿态、运动等）而且能对它们进行描述、存储、识别与理解。可以认为，计算机视觉与研究人类或动物的视觉是不同的：它借助于几何、物理和学习技术来构筑模型，用统计的方法来处理数据。\n人工智能的完整闭环包括感知、认知、推理再反馈到感知的过程，其中视觉在我们的感知系统中占据大部分的感知过程。所以研究视觉是研究计算机的感知重要的一步。\n2发展的几个重要节点\n视觉研究的开端-Hubel和Wiesel关于大脑视皮层细脑感受野的论述\n感受野-（一个感觉神经元的感受野是指这个位置里适当的刺激能够引起该神经元反应的区域。感受野一词主要是指听觉系统、本体感觉系统和视觉系统中神经元的一些性质。）\n1959年，Hubel和Wiesel猫实验的故事，把微电极埋进猫的视皮质细胞，之后在屏幕上打出一些光影和图形。通过固定猫的头部来控制视网膜上的成像，并测试细胞对线条、直角、边缘线等图形的反应。Hubel和Wiesel告诉我们视觉识别应该从简单的形状开始。\n对于看到鱼和老鼠投像的猫来说，视觉处理的前期并不是对整体的鱼或者老鼠进行处理，视觉处理流程的第一步是对简单的形状的结构处理、边缘排列。只有当图片切换时的反应激烈。\n二维到三维- Roberts积木世界让计算机理解三维场景\n20世纪50年代主要分析二维图像，而Lary Roberts 1963年写的论文《block world》（积木世界），运用计算机程序，试图从图像中阐释出诸如立方体等多面体的这些边缘和形状。它根据线画图来理解由多面体构成的景物，并对物体形状物体的空间关系进行描述。\n学科的诞生\n计算机视觉真正的诞生时间是在1966年，MIT人工智能实验室成立了计算机视觉学科，标志着CV成为一门人工智能领域中的可研究的学科，同时历史的发展也证明了CV是人工智能领域中增长最快的一个学科。\n视觉理论：视觉是分层的\n20世纪80年代初，MIT人工智能实验室的David Marr出版了一本书《视觉》（全名《Vision： A Computational Investigation into the Human Representation and Processing of Visual Information》），他提出了一个观点：视觉是分层的。\n他认为视觉是个信息处理任务，应该从三个层次来研究和理解，即计算理论、算法、实现算法的机制或硬件。\n一、信息处理的计算理论，在这个层次研究的是对什么信息进行计算和为什么要进行这些计算。\n二、算法，在这个层次研究的是如何进行所要求的计算，即设计特定的算法\n三、实现算法的机制或硬件，在这个层次上研究完成某一特定算法的计算机构。\n例如根据 Fourier 分析理论，任意连续函数可用它的 Fourier 频谱来表示，因此 Fourier 变换是属于第一层的理论，而计算Fourier 变换的算法是属于第二个层次的，至于实现快速，Fourier算法的阵列处理机就属于第三层次。\n视觉理论使人们对视觉信息的研究有了明确的内容和较完整的基本体系，仍被看做是研究的主流；\n3计算机视觉是一门交叉学科\n计算机视觉技术是一种典型的交叉学科研究领域，包含了生物、心理，物理，工程，数学，计算机科学等领域，存在与其他许多学科或研究方向之间相互渗透、相互支撑的关系。在概念的理解中我们常常听到AI、图像处理、模式识别、机器视觉等词语，那么他们和计算机视觉之间是怎样的关系呢？\n（图片来自网络）\n计算机视觉与人工智能\n人工智能技术主要研究智能系统的设计和有关智能的计算理论与方法。 人工智能可被分为三个阶段感知 、认知和动作执行。计算机视觉常被视为A I的一分支 。\n计算机视觉与图像处理\n图像处理中，人是最终的解释者；计算机视觉中，计算机是图像的解释者。图像处理算法在机器视觉系统的早期阶段起着很大的作用，它们通常被用来增强特定信息并抑制噪声。计算机视觉系统必须有图像处理模块存在。\n（图片来自wikipedia）\n计算机视觉与模式识别\n模式识别是根据从图像中抽取的统计特性或结构信息，把图像分为设定的类别。图像模式的分类是计算机视觉中的一个重要问题。模式识别中的许多方法可以应用于计算机视觉中。\n计算机视觉与机器视觉\n计算机视觉技术的研究目标是使计算机具有通过一幅或多幅图像认知周围环境的能力（包括对客观世界三维环境的感知 、识别与理解）。 这意味着计算机不仅要模拟人眼的功能，而且更重要的是使计算机完成人眼所不能胜任的工作。而机器视觉则是建立在计算机视觉理论基础之上，偏重于计算机视觉技术的工程化，能够自动获取和分析特定的图像，以控制相应的行为。与计算机视觉所研究的视觉模式识别、视觉理解等内容不同，机器视觉技术重点在于感知环境中物体的形状、位置 、姿态 、运动等几何信息 。两者基本理论框架、底层理论、算法相似，只是研究的最终目的不同。所以实际中并不加以严格划分，对于工业应用常使用“机器视觉” ，而一般情况下则常用“计算机视觉“。（部分选自《基于 OpenCV 的计算机视觉技术实现》）\n4计算机视觉的关键任务\n1、物体识别，识别图像物体属于的类别。\n2、物体检测，用框去标出物体的位置，并给出物体的类别。\n3、分类+定位，分类问题就是给输入图像分配标签的任务，找到图像中某一目标物体在图像中的位置，即定位。\n4、图像分割，将数字图像细分为多个图像子区域（像素的集合，也被称作超像素）的过程。\n5值得关注的人工智能开放平台\nFace++人工智能开放平台包含了包括人脸识别、人体识别、证件识别、图像识别在内的CV能力的体现。承接了如手机、营销、教育、汽车等行业的落地解接方案。"}
