{"content2":"https://zhuanlan.zhihu.com/p/21677391\n0.利益无关\n正因为我没有利益相关，所以才能写出不偏颇的观点。知乎上搜索人工智能+审计，无数人在问：德勤引入人工智能，对行业趋势有什么影响。无数审计师也在回答，不可能替代，即使是最激进的回答，也包括一个短期内不可替代。我认为这是一种自大，或者说对强大又不可知事物的惶恐。另一方面，如果把问题延伸到程序员或者专业人工智能从业者上，他们的观点往往截然相反地表示，人工智能很快就能取代除了人与人沟通的一切工作。这也是一种狂妄，同样不可取。\n1. 概述\n人工智能作为一个正在快速崛起的领域，对很多行业直接或间接地产生了影响。机械制造、数据录入等行业的初级工种已经基本被计算机和机器人所取代，行业的就业岗位数量已经受到了冲击；另一方面，在医药分析、审计、法律等行业，人工智能也让从业者，尤其是初级从业者感受到了压力。针对审计是否能被人工智能取代这一问题，不同的人回答千差万别。大多数审计师的答案都是人工智能不可能替代审计师本身，即使是最激进的回答，也是一个短期内不可替代。另一方面，如果把问题延伸到程序员或者专业人工智能从业者上，他们往往截然相反地表示，人工智能很快就能取代除了人与人沟通的一切工作。一个行业绝不可能永远不变，也绝不是一蹴而就地改变的。本文通过分析人工智能的现状、技术和挑战以及审计行业特点及现在发展状况，就两者的结合情况和趋势进行论述。\n2. 人工智能的概念\n从Alpha Go战胜李世石名扬天下后，深度学习这个词跃然纸上，成为了学术研究的宠儿。从百度指数（）可以看出深度学习这个词在Alpha Go 第二次战胜李世石后达到了巅峰，此后一直平均值之上。一些行业外人士也把人工智能和深度学习画上等号，甚至认为人工智能就是学习得非常深的意思。其实大错特错。\n-深度学习的百度指数变化\n人工智能的意思是让计算机具有人脑的认知能力。这个概念在1940年左右被提出，主要是科学家希望用计算机模拟人类的认知体系。但是随着脑科学和计算机技术的发展，研究者发现人脑的复杂程度和认知过程的难度远远地超过人类的想象，就像一段程序无法验证自身的ERROR一样，人类发现通过自己编程来模拟大脑活动，甚至再造一个大脑简直是天方夜谭。这时，科学家想到一个简洁一些的办法：只通过给定输入和输出，不通过强制的硬逻辑让计算机认知，而是通过大量数据的输入，让计算机通过结果来理解过程和认知事物，这就是机器学习的雏形。\n深度学习则是机器学习的一种方法，目前普遍采用的机器学习方法包括支持向量机、人工神经网络等等，而深度学习则是多层神经网络的使用。深度学习的概念由Geoffrey Hinto研究团队于2006年提出，其基础是深度置信网络提出非监督贪婪逐层训练算法，为解决深层结构相关的优化难题带来希望。目前深度学习在图像识别、声音识别等领域有非常出色的表现。\n由此可见，人工智能、机器学习和深度学习是一个递进的关系，前一层成为后一层的底层建筑，而后一层是在前一层基础上对某个问题点的具体研究成果。\n2.德勤引入人工智能\n德勤在今年三月宣布将引入人工智能，其总裁乔恩·拉斐尔（Jon Raphael）也发文称人工智能将在未来大幅度提高审计的质量。这里的质量，乔恩·拉斐尔认为包含三个维度：速度、成本和效用。乔恩·拉斐尔在其《How Artificial Intelligence can Boost Audit Quality》一文中指出，德勤计划使用人工智能替代目前由人工主要负责的文件审查(document review)工作。这是一项耗费时间且耗费人力的工作。文件审查工作的内容主要是审计师通过审核公司合同和相关文本，提取出审计相关的数据，并且归纳成信息，与公司财务报告进行对比，形成审计报告（）。\n-审计信息流程\n乔恩·拉斐尔表示，德勤将主要使用人工智能中的使用自然语言处理技术(Natural Language Process)处理审计中需要理解的文档。自然语言处理技术是让计算机理解人类语言所表达的内容的技术。在自然语言处理技术中，大量使用了编译原理相关的技术，例如词法分析，句法分析等等，除此之外，在理解这个层面，则使用了语义理解，机器学习等技术。作为唯一由人类自身创造的符号，自然语言一直是机器学习界不断研究的方向。\n乔恩·拉斐尔还举了一个例子，文档审查时经常碰到的一个情况是自动调整条款(escalation clauses)。在不同的情况下，自动调整条款的调整内容、调整幅度在各种行业、企业和具体条目中是完全不同的。在传统上，对自动调整条款的理解高度依托审计师的经验判断。如果人工智能实现机器判断，那么可以极大降低审计师工作的复杂度。\n另外德勤将要引入人工智能的方向还包括：数字环境下的一站式决策辅助、大数据技术下分析财务报表和改变物料计数方式等。\n3. 现有人工智能技术的不足\n虽然德勤宣布引入人工智能在整个审计行业和计算机行业引起了不小的震动，但是从3月份到现在，德勤并没有发布更加具体的引入方式。除此之外，德勤的行为并没有让其他会计师事务所诸如普华永道、毕马威和安永的跟进。以上两点显示出了人工智能目前技术尚有不足。\n首先，是现有的算法技术和计算水平还不足以满足审计行业的要求。目前主要使用的深度学习算法训练模型训练耗时，并且模型的正确性检验复杂。\n另外，审计行业需要很多的先验知识，但人工智能，尤其是自然语言处理方面的先验知识的建立非常麻烦。举一个简单的例子：“猫趴在火炉旁边睡觉，因为它非常温暖。”此句中的“它”字，在语言学上称为代词多指。对于此句中的“它”，任何人都可以很轻松地理解“它”代指的是火炉。但是让计算机理解“它”的指代性是非常困难的，因为它需要了解到“火炉一般是温暖的”、“猫喜欢温暖”这些背景信息。这些背景信息就被称为先验知识。在审计行业中的先验知识非常繁杂且重要，这是目前的人工智能技术需要攻克的难关。\n3.未来的人工智能对审计行业的影响\n人们预言未来时，往往依据当前的科技变化率作为一个基准值，但是实际上科技的变化率是在增加的，我们在简短的一段时间内并不能观测到（）。\n-科技发展趋势曲线\n在知乎上的审计师的普遍观点是，人工智能在50年内将会取代初级审计师的工作。我对这种观点不敢同意。简而言之，整个审计行业出现不过100年，不论是审计方法、流程还是技术都已经发生翻天覆地的转变，而且这种转变在可见的未来会随着市场和科技的发展继续存在。如果不愿意承认未来的审计行业会有十分庞大的变化，或者认为行业革新会发生在不可见的未来遥远的从业者，很容易被未来所淘汰。我认为在未来10年内，审计行业会有一个巨大的改变，即人的作用从全产业链覆盖变成了最后一步的铺路人。具体原因如下：\n1. 加速回报定律（Law of Accelerating Returns）在可见的未来依然生效。\n未来学家克兹维尔(Kurzweil)认为从整个20世纪100年的人类科学技术进步，按照2000年的速度只要20年就能达成——换言之，21世纪初的平均发展速度是20世纪平均发展速度的5倍。他认为2000年开始只要花14年就能达成整个20世纪一百年的进步，而之后2014年开始只要花7年（2021年），就能达到又一个20世纪一百年的进步。几十年之后，我们每年都能达成好几次相当于整个20世纪的发展，再往后，说不定每个月都能达成一次。按照加速回报定律，克兹维尔认为人类在21世纪的进步将是20世纪的1000倍。我一直是加速回报定律的拥趸，因为这个定律以过去的很短一段时间为基准，是一个开放性的定律，并且在过去的很长一段时间都被证明是正确的。\n摩尔定律就是一个典型的加速回报定律的例子。虽然摩尔定律从诞生伊始就一直被认为将会失效，然而其一直走过了30年的时光，让人类的计算能力从简单的数值计算进化到了复杂的人工智能算法。我们有理由相信摩尔定律在可见的未来仍然有效。\n人工智能从1960年诞生，经历了20世纪40年的发展都没有获得足够应用，然而在21世纪的前15年却开始大放异彩，登上一次又一次报纸新闻的头条。究其原因，是因为加速回报定律在起作用。新科技初始的发展进步非常缓慢，一旦突破一个瓶颈期，人们可以观测到它的进步后，就会越来越快地发展，直到在某些方面取代人类。\n2. 人工智能对人类发起的是“降维打击”。\n“降维打击”出自中国科幻作家刘慈欣的科幻小说《三体》。降维打击让处在三维空间的生物进入二维空间，直接导致其物体自身微观粒子相互作用发生变化、生物分子无法稳定存在。\n互联网和人工智能所带来的认知转变，不仅存在于“更快、更好”的层面，而是完全不同的快和完全不同的好。\n在审计行业中，审计师的“快”就是快速理解审计项目的目的、流程和操作方法，“好”就是按照既定战略完成审计任务的能力。现有的工具，例如Excel、ACL等，均是在提高审计师的审计速度和准确度。\n但是人工智能来了，就如同三维空间的我们观察二维空间行动的蚂蚁一样，人工智能看待我们的审计过程也有一种统治感。让一只蚂蚁脚上沾满墨水，把一张白纸爬成完全黑色是十分困难的，但是我们作为人类，可以拿起白纸，直接把它蘸在墨汁里，这样一张完美的“黑纸”就产生了。人工智能处理我们现在的审计问题就是如此。它不需要完全理解人类的思维模式并且按部就班地按照人类的行为模式操作，而是通过大数据的输入和输出反馈，自我形成一套认知方式。以目前的计算机能力，人工智能系统可以在1个月之内遍历这个世界上所有的审计项目，只要算法输入信息和输出反馈合理，它将成长为一个超过世界上所有审计师的存在。\n根据以上两点，我认为人工智能在未来的审计中会有深入的应用，并且极大地改变审计行业。\n4.人工智能行业未来的创业机会\n我把现在的整套创新商业模式分为两类：科学依托的商业创新和无科学依托的商业创新。科学依托的商业创新是著名投资人王煜全关注的美国大学研究项目的创新，具有高科学性。无科学依托的商业创新就是除了这种形式以外的其他创新。两种创新本质的区别是创新资源的稀缺种类不同。科学依托的商业创新的稀缺资源就是科学本身，如果你不知道一个理论或者没有最新科学研究的一手资料，你就完全不可能进入该行业，成为搅局者。而无科学依托的商业创新的稀缺性在于理解能力、执行力和社会资源，即对行业、产业的现状和发展的理解能力、企业团队的执行能力和企业所能调动的社会资源才是这种创新的壁垒。例如，Space-X就是一个科学依托的创新，其掌握的低成本火箭发射技术一直是领先于整个世界的，这也就是其能够处在一个长期的蓝海市场的原因。又例如，谷歌所代表的搜索引擎，其技术虽然复杂，但是已经是一个成熟并基本公开的技术。我们可以看到，我国的搜索引擎市场可谓百花齐放。它们成功的原因各种各样，不过归根结底还是更理解中文搜索、产品团队更加勤奋和社会资源丰富这三个原因。这就属于非科学依托的创新。\n审计的人工智能化属于第二种创新，这种创新的特征就是由小渐大。所谓由小渐大，就是说在这种行业中，很难有人能做一个全产业链的整合者。中国式创新，尤其是创业公司，基本都遵从这个逻辑。无法整合全产业链，并不意味着利润的下降或者份额的减小。在社会分工越来越细致的今天，全产业整合已经不能代表一个企业的核心竞争力。相反，一个企业的竞争力应当体现在它在某些领域的不可替代性。如果创业公司能够发布一套解决审计行业一小部分问题的人工智能系统，其将会很容易成为行业中的不可替代者。\n以下是我思考整理的人工智能在审计行业中的创业方向。\n1.文档信息提取格式化(Document data extraction and format)\n文档信息提取格式化是将文件中的条款和数字等内容提取并转换成格式化的数据，在人工下，这个部分的过程主要是将审计师的理解力转换为逻辑判断，而人工智能需要让程序自动完成文字语义的认知。目前主要的难点就在于自然语言处理(NLP)发展情况。如果想进入这个行业，创业者首先要做的就是如何建立审计先验知识的框架，只有搭建了框架后才可能让自己的产品可以媲美审计师的能力。审计工具不是Siri，出错率必须为0%，因此程序需要具有极强的准确性、容错率和数据信息交叉复现。在2016年5月，谷歌开源了其基于人工智能系统Tensorflow的自然语言分析模型SyntaxNet。这个模型的先验知识框架非常庞大，在低速信息输入和高速信息输入的情况下，识别自然预言的正确率已经超过94%和92.4%。除此之外，目前Kira公司的机器学习系统正在为审计行业量身打造相关产品。\n2.自动报表生成(Report automation)\n目前审计行业使用的软件，主要的功能就是生成分析报表，但是这依靠大量的人力。人工智能所能做的，就是将这些工作自动化，或者部分自动化。IBM的OpenPages提供的功能包括审计计划制定、文件自动归档、时间成本记录和审计报告生成等功能。依托于IBM强大的计算能力和在大数据、云计算业务上的长足发展，OpenPages已经摆脱了仅仅用计算机替代人做的阶段，而是达到了用计算机部分代替人想的阶段。虽然IBM这种大公司已经进入了审计行业人工智能化的争夺战中，但这不代表小企业没有自己的机会。人工智能除了需要依托好的算法，还要有足够的学习样本。随着互联网的开放，小企业也有了获取大数据的机会，另外，小企业的定制化能力更强，因此只要完成某些特定行业、特定步骤的高度自动化软件的开发，小企业将会比大企业更有竞争力\n3.文件发布(Document publishing)\n目前的人工智能主要停留在理解层面，而讲述能力却不足，简而言之，人工智能技术在目前是一个“聪明的哑巴”，只会听和读。例如目前的一些新闻机构，虽然宣称自己在使用人工智能进行快速新闻创作，但是实际上只是让机器将一些信息填充到已经写好的模板之中。\n在未来，人工智能说和写的能力将提升上来，这时，使用人工智能创建审计报告将会节省大量人力精力。但是，目前相关的研究成果还比较少，可以算是以科学为依托的创新，目前看来小企业在这方面没有什么竞争优势。这也是我将这种创业思路放在最后提的原因。\n总而言之，人工智能的大潮将会对很多行业造成冲击，审计行业无法避免，就应该去适应。人工智能不是将人的作用完全抛弃，而是省略掉一些重复、耗时的中间环节。正如本文题目所说，我认为人工智能在未来会在审计行业的第2步到第99步都有所作用，而最重要的第一步，计划制定，和最后一步，审计汇报中，人的作用都是不可忽视甚至是不可替代的。"}
