{"content2":"近年来，我们随处可以听到一个词，“人工智能”。机器的智能化成为了现今的一大研究热点，而机器要变得更加智能，必然少不了对外界环境的感知。有研究表明，人对外界的环境的感知70%以上来自人类的视觉系统，机器也是如此，大多数的信息都包含在图像中，人工智能的实现少不了计算机视觉。那么计算机视觉具体有哪些应用呢？\n无人驾驶\n无人驾驶又称自动驾驶，是目前人工智能领域一个比较重要的研究方向，让汽车可以进行自主驾驶，或者辅助驾驶员驾驶，提升驾驶操作的安全性。目前已经有一些公司研发出了自动泊车等辅助驾驶功能并得以应用。目前这方面做得比较好的是谷歌的无人驾驶汽车。国内也有一些比较好的公司，如百度无人驾驶车已经在一些园区得以应用，还有图森未来的货运车也完成了多次路测，并已经投入市场使用。\n计算机视觉在无人驾驶中起到了非常关键的作用，比如道路的识别，路标的识别，红绿灯的识别，行人识别等等平常驾驶过程中需要注意的。另外还包括三维重建及自主导航，通过激光雷达或者视觉传感器可以重建三维模型，辅助汽车进行自主定位及导航，进行合理的路径规划和相关决策。\n2.人脸识别\n人脸识别技术目前已经研究得相对比较成熟，并在很多地方得到了应用，且人脸识别准确率目前已经高于人眼的识别准确率，很多高铁站及门禁的地方都用到了人脸识别，很多都有刷脸系统，有些城市甚至在银行取钱都可以直接刷脸。\n3.无人安防\n安防一直是我国比较重视的问题，也是人们特别重视的问题，在很多重要地点都安排有巡警巡查，在居民小区以及公司一般也都有保安巡查来确保安全。随着计算机视觉的发展，计算机视觉技术已经能够很好的应用到安防领域，目前很多智能摄像头都已经能够自动识别出异常行为以及可疑危险人物，及时提醒相关安防人员或者报警，加强安全防范。\n4.车辆车牌识别\n车辆车牌识别目前已经是一种非诚成熟的技术了，高速路上的违章检测，车流分析，安全带识别，智能红绿灯，还有停车场的车辆身份识别等都用到了车辆车牌识别，不仅能识别出车牌的号码，目前车辆识别技术已经能对道路上的车辆车型进行识别，通过识别摄像头获取的图像，能获取到车辆的型号及颜色等特征。\n5.智能识图\n智能识图是我们生活中比较常见的计算机视觉的应用了。看到一个纸质文档，想要把其转换成电子文档，直接把文档拍下来，用相关软件进行文字识别，就能把图像中的文字自动转换成电子文档，甚至还能自动翻译成其他语言。看到一件衣服或一个物品，想在网上找他的来源等其他相关信息，直接输入图片，以图搜图，很快就能找到很多该图片出现的地方以及很多类似的图片。甚至还有些能直接告诉你图片中的物体是个什么东西，或者大概判断图片中的人像的大概年龄等比较好玩的功能。\n6.3D重构\n3D重构之前在工业领域应用比较多，可以用于对三维物体进行建模，方便测量出物体的各种参数，或者对物体进行简单复制。最近也慢慢开始应用到民用领域了，比如新出的华为mate20系列手机，就已经可以对玩偶进行三维建模，并能够设置一些特定的动作，让玩偶“活”起来，甚至可以与人进行一些互动。当然这里与人互动还用到AR技术。\n7.VR/AR\nVR/AR技术相信大家都已经比较熟悉了。VR眼睛在前两年卖得特别火爆，还有一些9D游戏机，就是利用VR技术让人能够有一种身临其境的感觉。而AR技术目前比较常见的可能是双十一时候淘宝的天猫，还有之前比较火爆的宠物捕获游戏，可以在现实场景中加入一些其他元素，目前这个领域还在快速发展中。很多方便人们生活的应用也在不断推出，比如智能翻译，用手机对着需要翻译的字，在这个界面上就自动显示出相关的翻译，或者后面可能实现的虚拟试衣间等，将大大的方便人们的生活。\n8.智能拍照\n这个相信是大家很熟悉的一个名词了，基本每个智能手机都开始配有这个功能。最基础的功能包括自动曝光，自动白平衡，自动对焦等，还有一些去燥算法，能很好的提高手机拍照的图像质量。随着计算机视觉技术的进步，一些自动美颜算法，自动挂件，自动滤镜，场景切换等越来越多有趣的功能都被开发出来。还有一些图像处理软件，像专业的Photoshop，还有比较民用化的美图秀秀，美颜相机等，基本也都是利用计算机视觉的技术。\n9.医学图像处理\n常见的医学成像，比如B超，核磁共振，X光拍片等。随着AI技术的发展，还开始有一些AI诊断的功能，AI根据图像的特征对相关疾病的可能性进行分析。\n10.无人机\n随着无人机技术的发展，计算机视觉技术在无人机上的应用必不可少，军用无人机中，可以对目标进行自动识别并自主导航，精确制导等，民用的无人机也类似，例如大疆的无人机，能够跟踪人进行实时的拍照，还有一些手势控制等。还有一些特殊场景的应用，例如电力巡检，农作物分析等。\n11.工业检测\n工业领域计算机视觉也得到了充分应用，例如产品缺陷检测，工业机器人姿态控制，利用立体视觉来获得工件和机器人之间的相对位置姿态。\n12.其他\n计算机视觉还有很多应用，随着技术的发展，应用领域也会越来越多。在工业领域的应用，在机器人技术方面的应用，这里就不一一的赘述了。相信随着计算机视觉技术的不断发展，我们的生活能够越来越智能化，便捷化。\n因为机器视觉课程刚好布置了这门作业，所以大概总结了一下，自己之前一段时间也在找计算机视觉相关的工作，所以多数还是根据自己对这个行业的了解来写的，难免和其他相关的总结有点类似。转载请注明出处。\n参考文献：\nhttps://36kr.com/p/5074487.html\nhttp://wb.qdqss.cn/html/qdwb/20180226/qdwb303829.html"}
