{"content2":"1.人工智能的基本概念\n智能的概念\n自然界的四大奥秘之一：智能的发生、物质的本质、宇宙的起源、生命的本质。\n智能研究的三大观点：\n思维理论：认为智能的核心是思维，人的一切智能都来自大脑的思维活动，人类的一切知识都是人类思维的产物。\n知识阈值理论：智能行为取决于知识的数量及其一般化的程度，一个系统之所以有智能是因为它具有可运用的知识。将智能定义为：智能就是在巨大的搜索空间迅速找到一个满意解的能力。\n进化理论：认为人的本质能力是在动态环境中的行走能力、对外界事务的感知能力、维持生命和繁衍生息的能力。而智能是某种复杂系统所表现的性质， 是没有明显的可操作的内部表达的情况下产生的，也可以在没有明显的推理系统出现的情况下产生。用控制取代表示，否定抽象对于智能及智能模拟的必要。\n总结：智能就是知识与智力的总和。其中，知识是一切智能行为的基础，而智力是获取知识并应用知识求解问题的能力。\n智能的特征\n具有感知能力：通过视觉、听觉、触觉、嗅觉等感觉器官感知外部世界的能力。人工智能的机器感知主要研究机器视觉和机器听觉方面。\n具有记忆思维能力：\n1.记忆：用于存储由感知器官感知到的外部信息以及由思维所产生的知识。 2.思维：用于对记忆的信息进行处理，即利用已有的知识对信息进行吻戏、计算、比较、判断、推理、联想及决策。\n思维的分类：\n（1）逻辑思维：根据逻辑规则对信息进行处理的理性思维方式。\n首先获得外部事物的感性认识，存储到大脑。然后通过匹配逻辑规则进行相应的逻辑推理。推理是否成功取决于，推理规则是否完备和已知信息是否完善、\n可靠。\n逻辑思维的特点：\n①依靠逻辑进行思维\n②思维过程是串行的，表现为一个线性过程。\n③容易形式化，其思维过程可以用符号串表达出来。\n④思维过程具有严密性、可靠性，能对事物未来的发展给出逻辑上合理的预测，可使人们对事物的认识不断深化。\n（2）形象思维：一种以客观现象为思维对象、以感性形象认识为思维材料、以意向为主要思维工具、以指导创造物化形象的实践为主要目的的思维活动。\n形象思维的思维过程的两次飞跃：\n·从感性形象认识到理性形象认识的飞跃：把对事物的感觉组合起来，形成反映事物多方面属性的整体性认识（即知觉），再在知觉的基础上形成具有一定\n概括性的感觉反映形式（即表象），然后经形象分析、形象比较、形象概括及组合形成对事物的理性形象认识。\n· 从理性形象认识到实践的飞跃：对理性形象认识进行联想、想象等加工，在大脑中形成新的意向，然后回到实践中，接受实践的检验。\n形象思维的特点：\n①主要是依据直觉，即感性形象进行思维。\n②思维过程是并行协同式的，表现为一个非线性过程。\n③形式化困难，没有统一的形象联系规则，对象不同、场合不同，形象的联系规则亦不相同，不能直接套用。\n④在信息变形或缺少的情况下仍有可能得到比较满意的结果。\n（3）顿悟思维：一种显意识与潜意识互相作用的思维方式。\n顿悟思维的特点：\n①具有不定期的突发性\n②具有非线性独创性及模糊性\n③穿插于形象思维与逻辑思维之中，起着突破、创新及升华的作用。\n在求解问题时，通常将逻辑思维和形象思维结合起来使用，首先使用形象思维给出假设，然后用逻辑思维进行论证。\n3.具有学习能力\n4.具有行为能力：感知能力看做是信息的输入，行为能力可以看做信息的输出，他们都受到神经系统控制\n人工智能\n图灵测试的提出---------衡量机器智能的测试。\n没有涉及思维过程----------“中文屋思想实验”。\n人工智能是一门研究如何构造智能机器或智能系统，使它能模拟、延伸、扩展人类智能的学科。\n2.人工智能发展史\n孕育\n①公元前384-322,演绎推理的基本依据------三段论。\n②培根，系统的提出归纳法。\n③莱布尼茨，万能符号和推理计算的思想，现代机器思维设计思想的萌芽。\n④布尔，思维规律形式化和实现机械化，创立布尔代数。首次用符号语言描述了思维活动的基本推理法则。\n⑤图灵，1936提出理想计算机的数学模型，即图灵机，为电子数字计算机的问世奠定了理论基础。\n⑥麦克洛奇与匹兹,1943建成第一个神经网络模型（M-P模型），开创了微观人工智能的研究领域，为人工神经网络的研究奠定基础。\n⑦阿塔纳索夫和贝瑞1937-1941开发世界上第一台电子计算机“阿塔纳索夫-贝瑞计算机（ABC）”为人工智能的研究奠定了物质基础。\n形成\n1956-1969\n①1956夏：美国达特茅斯大学召开为时两个月的学术研讨会。麦卡锡（人工智能之父）提出“人工智能”这一名词。标志人工智能作为一门新型学科正式诞生\n②机器学习方面：1957年Rosenblatt研制成功了感知机（将神经元用于识别的系统）。\n③定理证明方面：王浩，1958，IBM-704用时3-5min证明了《数学原理》中有关命题演算的全部定理；1965，鲁宾逊提出归结原理，为定理的机器证明作出突出贡献。\n④模式识别方面：1959赛尔夫里奇推出一个模式识别程序；1965年罗伯特编制出了可分辨积木构造的程序。\n⑤专家系统方面：1965-1968，弗根鲍姆领导的小组，根据质谱仪实验，通过分析决定化合物的分子结构的DENDRAL专家系统。对知识表示、存储、获取、推理及利用等技术是一次非常有益的探索。\n⑥人工智能语言：1960麦卡锡研制出人工智能语言LISP，建造专家系统的重要工具。\n⑦1969年成立的国际人工智能联合会议（IJCAI）,标志人工智能得到世界认可。\n⑧1970创刊的国际性人工智能杂志《Aitificial Intelligence》\n发展\n1970-今\n①1972法国马赛大学，科麦瑞尔提出并实现逻辑程序语言PROLOG。\n②1972斯坦福大学的肖特利夫等人研制用于诊断和治疗感染疾病的专家系统MYCIN。\n③1977弗根鲍姆提出“知识工程”,人工智能迎来以知识为中心的新时期。\n④地矿勘探专家系统PROSPECTOR、根据用户要求确定计算机配置的专家系统XCON、信用卡认证辅助决策专家系统American Express\n⑤人工智能在博弈方面：IBM深蓝、Google Alpha Go\n⑥我国1978年把“智能模拟”作为国家科学技术发展规划的主要研究课题；1981年成立了中国人工智能学会CAAI。\n3.人工智能研究的基本内容\n1.知识表示\n(1)符号表示法：用各种包含具体含义的符号，以各种不同的方式和顺序组合起来表示知识的一类方法。主要用来表示路机型知识。目前使用的知识表示法：一阶谓词逻辑表示法、产生式表示法、框架表示法、语义网络表示法、状态空间表示法、神经网络表示法、脚本表示法、过程表示法、Petri网络表示法及面向对象表示法等。\n(2)连接机制表示法：用神经网络表示知识的一种方法。它把各种物理对象以不同的方式及顺序连接起来，并在其间互相传递及加工各种包含具体意义的信息，以此来表示相关的概念及知识。适用于表示各种形象性的知识。\n2.机器感知\n使机器具有类似于人的感知能力，其中以机器视觉与机器听觉为主。对应人工智能两个专门的研究领域，模式识别和自然语言理解。\n3.机器思维\n指对通过感知得来的外部信息及机器内部的各种工作信息进行有目的的处理。是人工智能研究中最重要、最关键的部分。\n4.机器学习\n研究如何使计算机具有类似于人的学习能力，使它能通过学习自动地获取知识。难度较大，与脑科学、神经心理学、计算机视觉、计算机听觉等都有密切联系。\n5.机器行为\n与人的行为能力对应，机器行为主要是指计算机的表达能力。即“说”、“写”、“画”等能力。\n4.人工智能的主要研究领域\n1.自动定理证明\n海博伦与鲁宾逊先后进行卓有效的研究，提出相应的理论及方法，为自动定理证明奠定基础。我国吴文俊院士提出并实现的几何定理机器证明“吴氏方法”,是机器定理证明领域的一项标志性成果。\n2.博弈\n人工智能研究博弈的目的并不是为了让计算机与人进行下棋、打牌之类的游戏，而是通过对博弈的研究来检验某些人工智能技术是否能实现对人类智慧的模拟，促进人工智能的研究\n3.模式识别\n研究对象描述和分类方法的学科。分析和识别的模式可以使信号、图像或者普通数据。\n模式是对一个物体或者某些其他感兴趣实体定量的或者结构的描述，而模式类是指具有某些共同属性的模式集合。用机器进行模式识别的主要内容是研究一种自动技术，依靠这种技术，机器可以自动地或者尽可能少需要人工干预地把模式分配到它们各自的模式类中去。\n传统模式识别方法有统计模式识别和结构模式识别等类型。近年来迅速发展的模糊数学及人工神经网络技术已经应用到模式识别中，形成模糊模式识别、神经网络模式识别等方法，展示了巨大的发展潜力。\n4.机器视觉\n用机器代替人眼测量和判断，是模式识别研究的一个重要方面。机器视觉与模式识别存在很大程度的交叉性，两者的主要区别是机器视觉更注重三维视觉信息的处理，而模式识别仅仅关心模式的类别。此外模式识别还包括听觉等非视觉信息。\n5.自然语言理解\n研究如何让计算机理解人类自然语言，是人工智能中十分重要的一个研究领域。是研究能够实现人与计算机之间用自然语言进行通信的理论与方法。需要达到如下三个目标：\n(1)计算机能正确理解人们用自然语言输入的信息，并能正确回答输入信息中的有关问题。\n(2)对输入的自然原因信息，计算机能够产生相应的摘要，能用不同词语复述输入信息的内容。\n(3)计算机能把用某一种自然语言表示的信息自动翻译为另一种自然语言表示的相同信息。\n6.智能信息检索\n智能信息检索系统应具有下述功能：\n(1)能理解自然语言。允许用户使用自然语言提出检索要求和询问。\n(2)具有推理能力。能根据数据库存储的事实，推理产生用户要求和询问的答案。\n(3)系统具有一定的常识性知识。\n7.数据挖掘与知识发现\n数据挖掘的目的是从数据库中找出有意义的模式。这些模式可以是一组规则、聚类、决策树、依赖网络或以其他方式表示的知识。一个典型的数据挖掘过程可以分成4个阶段，即数据预处理、建模、模型评估及模型应用。\n知识发现系统通过各种学习方法，自动处理数据库中大量的原始数据，提炼出具有必然性的、有意义的知识，从而揭示出蕴含在这些数据后的内在联系和本质规律，实现知识的自动获取。\n8.专家系统\n是一个智能的计算机程序，运用知识和推理步骤来解决只有专家才能解决的疑难问题。\n9.自动化程序设计\n是将自然语言描述的程序自动转换成可执行程序的技术。是人工智能与软件工程相结合的课题。\n10.人工神经网络\n一个用大量简单处理单元经广泛连接而组成的人工网络，用来模拟大脑神经系统的结构和功能。神经网络已经在模式识别、图像处理、组合优化、自动控制、信息处理、机器人学等领域获得日益广泛的应用。\n此外还有机器人、组合优化问题、分布式人工智能与多智能体、智能控制、智能仿真、智能CAD、智能CAI、智能管理与智能决策、智能多媒体系统、智能操作系统、智能计算机系统、智能通信、智能网络系统、人工生命等。\n参考文献：高等教育出版社，人工智能导论（第3版）,王万良 编著。"}
