{"content2":"计算机视觉将改变物联网。\n计算机视觉的演变\n计算机视觉技术在日常产品中的应用非常广泛，从可以识别手势的游戏机到可以自动对焦的手机摄像头。计算机视觉技术影响着我们生活的方方面面。\n事实上，计算机视觉在政府方面以及商业领域已经应用多年。可以在各种光谱范围内感测光波的光学传感器被部署在许多应用中：比如制造业中的质量保证，用于环境管理的远程传感技术或者在战场上收集情报的高分辨率相机。其中有一些传感器是静态的，也有另外一些传感器是动态的，它们被连接到诸如卫星、无人机和车辆等移动物体上。\n在过去，许多计算机视觉应用程序仅限于某些封闭平台。但是随着与互联网连接技术的结合，他们创造了一套过去难以实现的新应用。计算机视觉加上互联网连接，高级数据分析和人工智能，它们将成为彼此的催化剂，在物联网（IoT）创新和应用方面带来革命性的飞跃。\n推动计算机视觉多领域的发展\n视觉环境设计\n视觉是人类五种感官中最为发达的。我们每天都用它来辨别我们的朋友，发现路上的障碍物，完成任务和学习新事物。我们为我们的视觉设计周边环境，比如：有路牌和信号灯帮助我们从一个地方到另一个地方；商店有标志牌帮助我们找到它们；电脑和电视屏幕显示各种资讯和娱乐节目。鉴于视觉的重要性，将其扩展到计算机和自动化系统显然是势在必行。\n计算机视觉\n计算机视觉首先捕获并存储图像，然后将这些图像转换成可以进一步执行的信息。它由多种技术组合而成，如下图所示。\n计算机视觉工程是一个跨学科领域，需要多种技术中跨职能和跨系统的专家。\n例如，Microsoft Kinect 使用3D计算机图形算法实现计算机视觉来分析和理解三维场景。它允许游戏开发人员将实时全身运动捕捉与人造3D环境结合起来。除了游戏，这在机器人、虚拟现实（VR）和增强现实（AR）应用等领域开辟了新的可能性。\n传感器技术的进步也在传统摄像机传感器以外的许多层面得到迅速发展。最近的一些例子包括：\n红外传感器和激光结合起来感测深度和距离，这是自动驾车和3D地图应用的关键推动因素之一\n非接触式传感器可以在无需身体接触的情况下跟踪患者的生命体征\n高频摄像机可以捕捉到人眼无法觉察的微妙动作，以帮助运动员分析其步态\n超低功耗和低成本的视觉传感器可部署在任何地方并长期使用\n计算机视觉更加智能\n早期应用\n监控行业是图像处理技术和视频分析技术的早期应用领域之一。视频分析是计算机视觉的一个特殊用例，它能够从长达数小时的视频中找出我们需要的片段。 自动检测和识别现实中预定义模式的能力能够应用到数百个场景中，带来巨大的市场机会。\n第一个视频分析工具使用手工算法来识别图像和视频中的特定功能。它们在实验室设置条件下和模拟环境中都是准确的。然而，当输入数据（如照明条件和摄像机视图）偏离设计假设时，性能急速下降。\n研究人员和工程师花费了多年开发和调优算法，或者用新的方法来处理不同的条件。然而，使用这些算法的摄像头或者录像机仍然不够稳健。尽管多年来取得了一些进步，但现实世界的糟糕表现限制了该技术的应用和推广。\n深度学习的兴起\n近年来深度学习算法的出现促进了计算机视觉的发展。深度学习使用人造神经网络（ANN）算法，模拟人脑神经元。\n从2010年初开始，由图形处理单元（GPU）加速的计算机性能已经越来越强大，足以使研究人员实现复杂 ANN 的功能。此外，在部分视频站点和 IoT 设备支持下，研究人员拥有大量不同的视频库和图像数据来训练其神经网络。\n在2012年，一种被称为卷积神经网络（CNN）的深度神经网络（DNN）在精度方面展示了巨大的飞跃。这一飞跃推动了计算机视觉工程领域的发展。现在，在需要图像分类和面部识别的应用中，深度学习算法甚至可以应用到人类以外。更重要的是，就像人类一样，这些算法具有学习和适应不同条件的能力。\n通过深度学习，我们正在进入一个认知技术的时代，计算机视觉和深度学习融合在一起，解决人类大脑层面的高层次的复杂问题。我们目前的研发成果还浮于表面。这些系统将会持续改进，使用更快的处理器，更先进的机器学习算法，更深入地集成到边缘设备。计算机视觉将改变物联网。\n更多应用案例\n其他有趣的用例包括：\n监测作物健康的农业无人机（http://www.slantrange.com/）\n交通设施管理（http://www.vivacitylabs.com/）\n无人机安全检测（http://industrialskyworks.com/drone-inspections-services/）\n下一代家庭安全摄像头（https://buddyguard.io/）\n这些只是计算机视觉大大提高许多领域生产力的一些小例子。我们正在进入物联网进化的下一个阶段。在第一阶段，我们专注于连接设备，搜集数据并建立大型数据平台。在第二阶段，重点将转移到通过计算机视觉和深度学习等技术使“事物”更加智能，从而产生更多可操作的数据。\n挑战\n增强该技术的实用性并进行商业化的过程中，还有很多问题需要克服：\n嵌入式平台需要集成深度神经设计。在能源消耗、成本、准确性、灵性方面都需要认真设计。\n行业需要标准化，以允许智能设备和系统相互通信并共享元数据。\n系统不再只是一个单纯的数据收集器。它们能够支持人们对这些数据的操作。系统能够自动学习和成长。整个软件、固件更新过程在机器学习时代具有新的意义。\n黑客可以利用计算机视觉和 AI 中新的安全漏洞。设计人员需要考虑到这一点。\n结论\n在这篇文章中，我们简要介绍了计算机视觉，以及它是如何成为许多连接设备和应用程序的重要组成部分。最重要的是，我们预测其即将爆发式增长，并列出了实际应用中的一些障碍。在接下来的系列文章中，我们将探索新的框架、最佳实践和设计方法，以克服一些挑战。"}
