{"content2":"来源 |《连线》 编译整理 | 量子位 若朴\n神经网络横扫硅谷如卷席，各式各样的人工智能(AI)已经潜入各式各样的互联网服务之中。不过就算神经网络已经能轻松的认出猫咪的图片，但仍然有很多不足之处，所以一些人怀疑目前人工智能的模式识别系统，是否是一种先进、可靠的AI发展之路。\n无论是Facebook的面部识别、微软的翻译或是Google的搜索，背后都是神经网络通过分析大量数据学会执行任务。人工智能帮助聊天机器人学习谈话的艺术，帮助无人驾驶汽车驶上公路。但是如果没有大量仔细标注的数据，AI并不能理解世界，也不通用。\n另一方面，研究人员对神经网络的工作原理了解有限，很多时候，人工智能就是一个黑盒子。这种不透明导致了严重的问题：如果一辆无人驾驶的汽车撞上了行人，可能人们也无从得知为什么人工智能会做出这样的决定。\n“深度学习确实得到了很多关注，它确实值得关注”，卡内基梅隆大学计算机科学教授Tuomas Sandholm说，“但是深度学习不能给你任何保证”。如果你之前看了量子位的文章，立刻能意识到这位教授就是AI赌神Libratus的创造者。\n教授说的一点不错。由于神经网络中这些明显的弱点，科技巨头们正在寻找新的人工智能发展路径，最近的招聘、收购、研究以及新成立的创业公司，都瞄准了一个新的方向。\n贝叶斯方法正在兴起。依照这种理论，可以通过正统的科学方法研究人工智能：从一个假设开始，然后技术数据更新这个假设，而不是像神经网络那样依赖数据推动结论。贝叶斯方法可以用来处理不确定性，可以为现有模型提供新的证据，可以做神经网络不擅长的事情。\n和神经网络一样，贝叶斯方法可也从数据中学习，但完全是两一个路数的机器学习。“我们感兴趣的是让科学方法自动化”，创业公司Gamalon的创始人Ben Vigoda说，他们正在通过概率编程的方法推动这目标前进。\n神经网络的快速崛起，也为众多的其他技术注入了生命力，这些技术都能让机器变得更聪明。从强化学习到进化计算，机器学习不只有一条路可走。\n迷之科技\n去年12月，当Gary Marcus把他只有15个人的创业公司卖给Uber时，他说自己带来了一种全新的人工智能。\n他的公司名叫几何智能，一个有着雄心的小操作系统。这位47岁的纽约大学心理学教授表示，他和他的研究伙伴们正在开发一种系统，可以仅仅凭借很小的数据量学会执行任务，就像是人类一样，这种方式蕴含的能量远超深度神经网络。\nMarcus认为，小数据系统对于对话机器人以及行驶在公共道路上的无人车而言，是必不可少的。“语言领域和无人车领域都有一些问题，例如永远缺乏足够的数据驱动强力的深度学习”，他说毕竟我们不能在繁忙的道路上撞毁车辆，用以收集数据避免未来的事故。\n剑桥大学信息工程教授Zoubin Ghahramani是Marcus的联合创始人，他俩都不愿因谈及上述技术的细节。这在技术世界一点都不罕见，特别是与AI相关的部分，各种秘而不宣造就了一些迷之科技。不过，Ghahramani也是贝叶斯方法的拥趸。\nGhahramani专门研究一种称为高斯过程的特定类型统计模型，这有可能在他与Marcus的研究过程中发挥了作用。\n高斯过程\n在某些方面，高斯过程是找到特定问题最优解的一种方式。这也是另一种数学技术贝叶斯优化的基础。高斯过程已经用于帮助网站决定应该显示那些广告，或者网站主页应该如何优化。Uber一直在招聘高斯过程方面的专家以改善服务，Google也用高斯过程来协助控制高空互联网气球。\n从根本上讲，高斯过程是识别不确定性的好方法。“知道你不知道是一件非常好的事情”，爱丁堡大学AI研究员Chris Williams说，“做一个自信的错误决定是最糟糕的事情”。他也是高斯过程和机器学习方面的权威作者。\n2015年被Twitter收购的初创公司Whetlab，就为设计神经网络提供了一个更好的方法。设计神经网络是一个极端试错的任务，困难且耗时。但是高斯过程和贝叶斯优化可以帮助自动完整这个任务。正如WhetLab的创始人、哈佛的计算机科学家Ryan Adams所说的，这家公司正使用“机器学习来改进机器学习”。\n神经网络会遇到“自信的错误”困扰，在识别不确定性时，这种优化可以帮助决绝问题。现在Adams已经离开Twitter加入Google Brain。\n一些研究人员还认为，高斯过程的小数据能力，可以推进自主化AI方面发挥关键作用。“为了建立一个真正自主化的代理，它必须能够快速适应环境”，AI创业公司Prowler的首席执行官Vishal Chatrath说，“这意味着从高效的从数据中学习”。\n此外，Chatrath表示高斯过程很容易解释，这个技术与神经网络不同，它不受制于黑盒问题的束缚，如果发生问题，人们可以追踪原因。\nProwler聘请了三位学者从事这方面的研究。这家公司正在搭建一套AI系统，可以从大型多人游戏和其他数字世界中学习无人驾驶技术。这是一个复杂的工作，但他们希望这能有助于在现实世界进行无人驾驶汽车的导航。\n而亚马逊最近也聘请了一位专门研究贝叶斯技术的AI研究院：谢菲尔德大学计算机科学家Neil Lawrence。《不要惊慌》，这是Lawrence最近发表的一篇博客，他在文中说“通过使用数学工具来应对新一波的深度学习，我们可以确保它们基本上是无害的”。"}
