{"content2":"转自：http://36kr.com/p/5071386.html\n国内的AI行业仍处于野蛮生长阶段。热钱不少，优质项目却不多。创业者拿钱难，投资者有钱却花不出去。\n编者按：本文来自微信公众号“刺猬公社”（ID：ciweigongshe），作者哲铭；36氪经授权发布。\n江山代有风口出，各领风骚一两年。这两年在全世界的创投圈都异军突起的人工智能（AI），最近风头似乎被共享充电宝盖过了。AI创投圈呈现出一面是冰、一面是火的奇异景象。\n今年3月5日雷军表示，小米将增加对人工智能的投资。恰巧就在同一天，由于Messenger聊天机器人的错误率高达70%，Facebook决定削减对机器学习和人工智能技术的投资。\nAI创投到底冷暖几何？风向究竟在往哪边偏？\n泡沫与死亡：“每个商业计划书上都要加上人工智能”\n刺猬公社（ID:ciweigongshe）从创投大数据平台“清科私募通”获取的统计数据显示，2001年4月9日到2017年4月9日，中国共有234家AI公司获得融资。其中，仅2016年以来就有112家公司获得融资，数量达到一半。\n艾瑞咨询的统计结果相对较少——中国目前有约65家AI公司获得投资，共计29.1亿元人民币（约合4.5亿美元）。\n调研机构Venture Scanner于今年3月发布的报告则显示，目前全球人工智能领域的企业达到了955家，其中395家已累计获得48.5亿美元的融资。\n统计口径的不同，导致结果所有差异。\n“如何定义AI项目其实是个重要话题，有时很难说清楚。”联想之星的投资副总裁高天垚对刺猬公社举例说，比如一些属于消费服务领域的项目，现在借助一些无人化的概念也会被认为是AI项目，其实不妥。但在这个领域，什么是比较纯粹的AI，很多时候比较难鉴定。\n在清科私募通、投中网的投资行业分类中，目前尚未有“人工智能”这一单独分类。如此热门的投资领域，却没有在创投大数据平台上得到反映，就是因为领域界定的难题。\n人工智能目前主要有四个方向：语音、视觉、自然语言理解、控制。而这四个方向分类下又有不同的垂直应用。语音包括合成、语音增强等；视觉包括面部及物体理解；控制包括机器人、无人驾驶等。媒体人对自然语言理解或许更为熟知一些，如聊天、问答、数据挖掘等。\n“在AI投资各领域中，目前视觉的场景比较多。”华登国际投资总监苏东对刺猬公社说，人类60%的信息获取通过眼睛，所以机器视觉有很大空间。城市安全、无人驾驶乃至扫地机器人的智能视觉都是很好的应用场景。国内视觉创业公司也已有数百家。\n“最近几年，人工智能项目从获得投资的数量上看，肯定是越来越多，退出的却很少。”高天垚说，资本市场从来不缺新的炒作概念，物联网、互联网金融、O2O、共享经济等等，一波接一波。“可能初衷都是好的，但过度的渲染就会导致一些泡沫，使本来不应该出现的创业者或资本进入某个领域。”\n“同一阶段AI公司，在国内估值是在国外的3倍。”北极光创投董事总经理杨磊对刺猬公社说。\n一直看多AI的创新工场董事长李开复，也在此前“寻找中国创客大会”上说，“现在创投市场人工智能泡沫很严重，每个商业计划书上都要加上人工智能，几乎任何行业的创始人都说自己是人工智能公司。”\n创新工场近年来在人工智能领域布局频繁，4月上旬刚联合海南生态软件园主办了第一届德扑人机大战。\n李开复认为，现在人工智能“有点儿过火”。他预计明年初开始，或将有第一波企业走向死亡。\n跟风与短板：“不投也得投，怕错过”\n润米咨询董事长刘润认为，目前这一波AI热潮是被投资催化出来的“虚热”。\n“不投也得投。从创业和投资两方面来看，都会有跟风。”高天垚说，早几年看，AI在投资圈并不是主流投资领域，而现在，机构或多或少都有“怕错过”的心理。\n这和当下包括共享充电宝在内的所谓“风口”受到资本追捧的背后逻辑，如出一辙——商业模式究竟是啥、能否赚钱先不管，把位置占了再说，而且，总能找到接盘手。\n成立于2008年的联想之星，从2011年开始投AI，已经投资了60多家相关企业。除此之外，创新工场、北极光等多家投资机构，也都将人工智能作为其重点布局的赛道。\n但多位关注AI领域的投资人士告诉刺猬公社，现在这个领域的部分创业团队给人感觉是“飘在半空中”，“有些甚至完全不懂AI”。\nAI是强技术领域。高天垚此前在接受《21世纪经济报道》采访时表示，联想之星布局人工智能走过两个阶段，第一阶段关注底层技术，重点投资各种识别技术和理解技术、传感器等。第二阶段联想之星主要在加大对智能机器+行业应用的布局力度，利用智能技术提高效率。\n“譬如无人驾驶，一定是技术驱动的，否则，再有商业模式也不会有产品。”杨磊说，在这个领域中国和国外技术有挺大差距。\n南洋理工大学教授黄广斌对刺猬公社说：“国外商业包装比国内好，比如AlphaGo。其实国内大约在2012年左右，中国AI协会就曾举办了人工智能大赛。”\n黄广斌曾在一篇微博中指出，人工智能能够给中国带来历史机遇。但中国的AI创业者，虽然想做实事，却又“比较浮躁，失去了很多机会”。\n在机器视觉、自然语言处理、无人机等AI发展较早的细分领域，国内有一些公司已经融到了C轮、D轮等比较靠后的轮次，但现在大量的项目仍处于早期，能跑出来的还是凤毛麟角。\n清科私募通的数据显示，处于B轮以前（不含）的AI公司，占比近九成。\nAI各融资轮次公司数量图（数据来源：清科私募通）\n光懂技术也不行。很多AI创业者有很强的技术背景，却依然在融资路上步履艰难。主要原因是这些技术宅男“不会讲故事”、“不懂商业”，无法让投资人理解并认可自己的优势和前景。\n不过，投资人在技术上也有短板。杨磊告诉刺猬公社，很多投资人看不懂AI。\n而一位不愿具名的业内人士对刺猬公社说：“看不懂也不会焦虑。投资这件事儿特别简单，就是我相信我所投的，我投的都不是我认为有问题的。现在来了个风口，多好啊。大家赶紧投，泡沫出了再说。”\n什么样的AI项目能拿到投资？“技术做不出来，不投；太贵，不投”\nAI创投泡沫何时破灭，业内莫衷一是。高天垚认为，“一定要预测泡沫何时破，没有意义，而应该思考如何避免成为所谓的泡沫。”\n在不少投资人眼里，AI是其投资的一个重点领域，却也只是投资组合中的一部分。他们倾向于认为，考察AI创业项目与其他项目并无太大差异。\n“主要考察团队以及主攻方向。”苏东说。\n“所有技术类的投资都是这样的，看团队背景、赛道方向来选择与我们投资逻辑相符合的团队。”杨磊说。\n明势资本合伙人黄明明在接受《21世纪经济报道》采访时称，该公司在选择AI投资项目时，着重强调两点，一是离行业更近一些，二是离钱更近一些。“创业公司要知道钱在哪里，否则算法准确度和数据未必是有用的。”\n高瓴资本集团合伙人洪婧则表示，“更多还是看创业公司有没有长期结构性的壁垒，只看需求很快就会蓝海变红海，主要还是看供给端。一定要把技术和实际的应用场景及预算结合起来，慢慢形成循环，积累数据和对行业真正的理解。”\n李开复认为，投资人在选择人工智能领域进行投资时，需要对相关技术、战略以及成熟的速度有足够的理解，而在投资一个案子前，要进行全面评估，“如果技术做不出来，我们不会投资，如果做出来太贵，我们也不会投资。”\n“AI这个领域的投资非常不容易”，杨磊说，在互联网投资早期，中国的投资机构和其他国家都在一个起跑线，主要竞争的是执行力、资金，还有商业模式创新。\n而如今的AI投资中，技术本身的重要性，与巨头的潜在竞争，如何将技术与商业场景结合形成闭环以及AI领域本身快速的变化等问题，都造成AI投资的难度变大。\n至少从目前的迹象看来，国内的AI行业仍处于野蛮生长阶段。热钱不少，优质项目却不多。国内AI技术发展速度跟不上投资热情。\n而且，国内的这一矛盾比国外更尖锐。杨磊解释说，因为国内较国外的热钱更多，但国内技术水平又相对更弱，优质标的更少。\n结果就是，创业者拿钱难，投资者有钱却花不出去。对这二者来说，都很沮丧。"}
