{"content2":"前言在刚过去的凌晨（北京时间 5月18日 1.00-3.00），一年一度的2017年Google I/O大会在美国谷歌山景城海岸线圆形剧场如期举行Google I/O 大会：Innovation in the Open，开放中创新，是Google官方举办的开发者大会面向 开发者，会议内容是：更新和发布Google的新产品 & 技术对比于网上内容相互复制、堆砌的Google I/O大会内容报道，这是一份很有诚意的 2017年 Google I/O大会的汇总 & 解析目录1. 2016年 Google 产品的表现在发布新产品& 技术前，谷歌 CEO Sundar Pichai先公布了2016年 Google 产品 在市场上的表现：1.1 Google 全系列产品总用户量达10亿具体产品表现如下：Google Photos（ 相册）：活跃用户量= 5亿，超过12亿张照片上传 / 天YouTube：用户观看视频时长超过10亿小时 / 天Google Map（地图）：导航的里程超过10亿公里 / 天Google Drive（云端硬盘）：活跃用户数 = 8亿1.2 Android 市场份额Android OS 的活跃设备数达到了 * 20 亿 *2. 会议内容2.1 概览关键词：人工智能2.2 具体内容2.2.1 人工智能 - Google.ai计划相比于 以往先介绍 Android 产品 & 技术，这次Google I/O 大会却将人工智能提高了第1部分介绍谷歌 CEO Sundar Pichai 针对 谷歌 在人工智能领域的发展提出了两个关键点：1. 人工智能 会渗透到 谷歌旗下所有产品2. 语音 & 图像 会成为谷歌人工智能的重要交互方式这意味是Google 将人工智能渗透在语音 & 图像识别领域上过去的交互方式主要是鼠标和触屏针对谷歌在人工智能领域的发展的关键点，CEO Sundar Pichai 提出了Google.ai计划目的：希望将人工智能具体应用到实际中具体内容：包括3个方面学术领域开发者的开发领域日常生活详细解读应用1：学术领域Google 将包括深度学习在内的人工智能引入到各个学术领域，如生物、医疗、化学等应用场景主要包括医疗诊断、细胞生物学、DNA测序等。应用2：开发者的开发领域Google将开放Tensor Flow、TPU等软硬件工具给开发者，希望所有的开发者都可以进行人工智能的学习 & 开发。Tensor FlowTensor Flow是Github上关注最多的开源项目。所有人都能用人工智能来开发他们自己的应用。人工智能不再神秘，而是会真正的进入日常生活，而且会用众多的行业被人工智能改造Cloud TPU即Google Cloud Compute Engine，用于机型硬件远程加速，是大数据、深度学习的核心引擎。在人工智能处理上比 CPU 和 GPU 表现更优异，重点在训练层面。本次优化了训练(Training)，同时也优化了推理(Inference)。Google将开发该AI基础设施给广发开发者，希望开发者能利用这些强大的人工智能计算资源来开发人工智能的应用应用3：日常生活Google希望将人工智能带入大家的日常生活具体做法则是将 人工智能渗透到产品中，具体渗透的产品如下：产品1：Google Lens定位：一个 视觉搜索引擎新发布产品功能：利用 计算机视觉算法 实时识别 照片内容，从而根据照片内容 提供 相关服务具体使用场景场景1：若您 拍摄 音乐会海报，Google Lens会建议你购买门票，并调用购买门票的APP场景2：若您拍摄路边的餐馆，Google Lens会自动调出该餐厅 & 地图信息Google Lens将集成到Google Assistant和Google Photos中产品2：Google Asistant定位：智能手机 助手基于Google Now融合了语音搜索、人工智能和机器深度学习于2016年发布，此处是更新核心功能：通过 语音 让机器智能地为你提供对应服务类似Apple 的Siri、微软的小冰新增功能：加入Google Lens加入文字输入的方式Google Assistant将提供其API，方便开发者嵌入到自己的应用中特别注意：Google Assistant也将登陆iPhone产品3：Google Home定位：一款基于 Google Assistant的智能家居硬件于2016年发布，下面是更新核心功能：通过语音对话的方式 帮助处理家庭场景下繁琐的日常事务新增功能点a. 打电话通过免提进行通话只需发出 Okay Google，call my mom（打电话给妈妈）等语音命令，就能够自动发出通话请求若居住在美国 或 加拿大，就可免费拨打美国 或 加拿大的任何号码。无需设置、无需安装APP、更不需要手机。b. 与手机、家里的电视 互动在娱乐方面，Google Home 进行了加强与Spotify、HBO now、Hulu等娱乐应用合作，即可以通过语音控制手机上的这些 App作为媒介，连接手机 & 电视。如，出门前可以将导航地图发送到你的手机，或在电视上播放YouTube上看到一半的影片。产品4：Google Photos定位：谷歌相册应用植入Google Lens后的功能更新点：1. 建议共享功能描述：拍照后，Google Photos通过 人脸识别，识别出照片中的人，并建议你把照片发送给对方。具体场景：聚会时拍完集体照后，需要一个个去发给他们，现在一键就可以发送了。2. 共享照片库功能描述：允许你自动与指定的人（比如爸妈、伴侣）共享你的所有的或部分的照片具体场景爸妈总需要多发生活照给他们，但会经常忘 & 需要筛选生活照。现在通过共享可以省去很多时间 & 操作成本上述两个功能加强了图片共享的社交性，功能1是跟半熟人的低频共享；功能2是跟熟人、亲人的高频共享。4. 自动识别图片内容功能描述：自动识别照片中景点、建筑具体使用场景，旅游、迷路等。2.2.2 Android这次Android 主要更新点是：Android 系统 & 开发语言1. Android 8.0（Android O）继Android 7.0 采用Nougat（牛轧糖）后，Android 8.0采用Oreo（奥利奥），即Android OAndroid O主要关注：流畅体验 & 核心功能1. 流畅体验谷歌强调电池续航、安全性、启动时间 & 稳定性，具体如下：2. 核心功能在Android O中新增了几项功能已提高用户在使用时的流畅度:功能1：画中画功能描述：单屏手机上 使用 多应用 操作具体场景：边微信聊天边购物、边看视频边做笔记功能2：App动态提醒标签（小红点）功能描述：当应用收到提醒时，该应用在桌面上的图标右上角显示一个小点点作为动态提醒标签。若长按显示提醒的app，则会弹出类似于iOS Force Touch的小窗，以帮助用户便捷回复若开发者觉得提醒圈颜色与自己的app不搭，Android O系统会根据开发者所提交的配色，为每款app选择最合适的颜色作为提醒色。功能3：基于机器学习的文字识别功能描述：当用户打开任意文本，神经网络能识别并了解到它是什么，并帮助用户自动选择正确的内容需求场景：选中文本内容时 因手指太粗等原因而无法正确选中。2. Android Go定位：一款 轻量、入门级别的 Android 系统使用场景：专门应用于底端硬件设备。如低配置智能手机、平板等等特点意图：通过开发新兴市场（如进军底端国家印度、非洲等），让用户以低廉的成本就能获得原生的Android体验，从而进一步扩大Android市场份额特别注意：1. 从Android O开始，2018年出货的所有RAM不超过1GB的设备都将采用Android Go2. 谷歌未来还将推出更多不同版本的Android以适应不同需求场景3. Kotlin本次大会，Google宣布 Kotlin成为Android 开发的1级编程语言定义：是JetBrains在2010年推出的编程语言，并在2011年开源特点：与Java 互通，并具备许多 Java尚不支持的新特性。Android Studio 3.0将提供支持2.2.3 其余更新1. VR领域LG今年的新旗舰、三星Galaxy S8将支持谷歌Daydream平台谷歌将联合HTC、联想&高通制造VR一体机：Daydream VR首批产品将于2017年推出。2. AR领域公布了AR技术视觉定位服务VPS（Visual Positioning Service）具体使用场景：室内导航具体：通过摄像头识别室内环境特征，引导消费者在商场找到特定商品。如在商场定位买手机等等3. Youtube新增功能：Super Chat功能定位：视频直播社交功能面向用户：Youtube 上的直播观众 & 博主功能描述：观众 通过 直播聊天室 博主的行为具体应用场景：观众A在大会现场观看博主B的直播，观众A付费500美元购买了Super Chat，此举立刻激活了主播所在地的一个大喇叭，喇叭声响意味着围观群众可以朝主播扔水球，于是现场立马演变成一场狂欢。需求：提高博主与观众的互动性、提高观众的娱乐性、网红直播赚更多的钱3. 总结从上面可以看出：本次的Google I/O 大会的重心在 人工智能，表明Google已经从一家移动为先的公司，成为了一家人工智能为先的公司从这次大会开始，Google将依赖Andorid系统 、一系列产品矩阵 & 机器学习工具TensorFlow 建立起一个属于谷歌的人工智能生态系统4. 遗憾本次大会谷歌在人工智能方面的布局确实惊艳非常惊艳但遗憾的是，之前谷歌提及的新系统Fuchsia & 整合Chrome OS却只字不提，希望下次大会中会有关于这两方面的信息。最后，作为一名Android开发者，其实我更关注的是：到！底！什！么！时！候！回！来！中！国！请帮顶或评论点赞！因为你的鼓励是我写作的最大动力！、-END-"}
