{"content2":"生产力和项目管理市场正在蓬勃发展，并且正在以令人兴奋的新方式继续发展。我想知道项目管理中人工智能的未来会是什么样子，所以我每天向在这个领域工作的创始人，生产力专家和未来主义者询问未来五年和十年的预测情况。他们的回答很有启发。\n我们将使用AI作为决策支持，而不是决策。\nGetting Things Done的发明者David Allen认为：“系统将会在提供相关数据方面做得更好，以便在适当的时间，在正确的地点，在任何情况下优化我们的体验。我们需要将生产力系统视为我们决策过程的支持系统。“\n所以，我们还不会使用AI来消除我们的决定并使其自动化，而是增强在任何情况下作出决策的能力。我也认为这是人工智能的下一个可能步骤。大多数人不会相信计算机为他们做出决定，但他们确实在寻找信息来帮助做出这些决定。\n艾伦接着说，“这些新的表现形式和趋势都不像A.I.将为您做出决定。这是行不通的。我看到A.I.可以支持你的决定，但我们仍然会用我们的头来作出决定。“\n这不是机器人。 。 。\n当大多数人想到人工智能时，他们会想到机器人在做手工劳动来为我们完成任务，无论是Jetsons的Rosie还是福特装配线上的机器人。我与此有关的问题是这个观点太有限了。当然，机器人会变得聪明，但其他一切都会变得聪明。在线视频系列In a Nutshell背后的团队发布了一个很棒的解释视频。\n现在，一个能够识别你的动机水平并给你适合这个水平的任务的应用程序不是不可能的。可以回答简单的服务问题并从回复中学习的机器人已经存在，并且取得了一些成功和一些重大失败。\nSmartsheet公司首席执行官马克马德认为，将AI视为巡回机器人是没有意义的，他说：“进一步看，毫无疑问，自动化 - 不要以为机器人会从你的一天中去除普通的和非生产性的工作步骤 - 将增加。机器学习将能够预测员工正在努力做什么并使他们的工作更轻松。怎么样？通过自动收集完成任务所需的信息，填写表格并与适当的人员分享。“\n我看到了两者的结合。具体来说，在项目管理中，我看到了一个未来，机器将能够使用实时数据预测变化并相应做出更改。这是机器人学习和机器学习相结合的关键：考虑装配线系统推出烧烤设备。系统将能够预测由于即将到来的假期需求会增加，并自动告诉生产线上的机器人增加产量。我不确定他们之间是否会做出人为的决定，但我认为，随着我们对机器的决定更加舒适，我们会给他们更多的控制权。\n这是我做出的决定。\n人工智能远不是人，更不用说超人了。正如我指出的那样，我们已经发布了机器学习机器人，并带来了一些非常可怕的结果。机器还不善于理解语境或讽刺，所以当我们让他们学习时，他们通常会错过标记。\n然而，使用机器来帮助做出决定似乎是目前唯一的出路。作为决策支持的一种形式，生产力专家Carl Pullein认为，“机器学习和人工智能将转向创造生产力工具，以便为您安排会议和任务，并能够根据您的需求了解需要完成的工作上下文，你在哪里，需要做什么。“\n像Grammarly这样的机器学习工具已经上市，但随着这些决策助手变得更加知名，他们正在进入更复杂的领域。把它想象成你的Facebook时间线算法或垃圾邮件过滤器，而不是你的待办事项清单。\n就像教育一样，访问是机器学习的关键。\n要了解我们现在的位置，请考虑一直在使用和学习的系统。您的电脑浏览器会与谷歌，Facebook以及任何数量的公司进行对话，您所做的，点击，购买和超出的内容都将被存储。现在，随着物联网最近的趋势，这些东西正在远离我们的电脑和手机，并成为我们日常生活的一部分。并获得一路上的数据。你的智能冰箱可能能够告诉当地的超市你每周喝多少水。如果当地每个人都有一台智能冰箱，那么这家超市就可以更好地决定储备多少水。\n生产力心理学家梅丽莎格拉蒂亚斯认为这个系统也适用于我们的工作场所。 “大多数应用程序和程序都要求用户有针对性地与该工具进行交互以便使用它。我们将看到更多的智能家居，智能汽车和语音激活的入口点，无论身处何处，该工具都可供用户随时使用。她不必停止她正在做的事情，例如，将任务添加到她的任务列表中。“\n所以，超市不仅要知道需要购买什么，而且您的冰箱将在下周知道要添加到购物清单中的内容。自动，通过学习的行为。\n我所谈到的所有专家都认为，决策支持可能是短期内唯一的出路。机器正在被教授人类的决定偏好，因为他们无法自己辨别背景。所以，我们需要教育机器如何像人类一样思考。像Alphabet这样的公司已经在研究它，DeepMind等项目处于AI和机器学习技术的前沿。其他人，如艾伦马斯克的OpenAI，正在努力确保人类对恶意AI的恐惧永远不会实现。当我们学会信任这些系统时，采用会很快跟随。由于它们如此普遍，它们一定会触及所有行业。\n更多人工智能请关注微*信公众号：智德物联科技或者微博@智德物联科技。\n本文部分内容根据Martin Welker在Entrepreneur网站的文章编译而成。"}
