{"content2":"7月初，又一波送书福利来袭，网易云社区 联合 图灵出版社为大家推荐10本让你重新认识人工智能、数学、物理的书籍（人工智能、用数学的语言看世界、几何世界的邀请、物理奇遇记等）。以下为书籍简介，文末有送书福利哦\n1. 《人工智能简史》\n本书全面讲述人工智能的发展史，几乎覆盖人工智能学科的所有领域，包括人工智能的起源、自动定理证明、专家系统、神经网络、自然语言处理、遗传算法、深度学习、强化学习、超级智能、哲学问题和未来趋势等，以宏阔的视野和生动的语言，对人工智能进行了全面回顾和深度点评。\n2.  《科学的极致：漫谈人工智能》\n本书由集智俱乐部成员共同创作而成，全面介绍了人工智能的历史及其在各个领域的发展及应用。不仅涵盖了人机交互、脑科学、计算心理学、系统科学、社会科学等各个学科的基础理论，而且广泛讲述了人工智能在算法、软件、硬件等方面的应用以及跨学科应用。\n3.  《走近2050：注意力、互联网与人工智能》\n本书从注意力的角度解读了包括互联网、人工智能、众包、人类计算、计算机游戏、虚拟现实在内的技术领域及其对社会生活的影响，还创造性地提出了一系列全新的概念：占意理论、图灵-参与者模型、“游戏＋”时代、意本家、自动游戏设计、自动化创业、占意通货、许愿树，等等。所有这些将为我们理解技术与人类的关系、透视人类社会的未来发展和走向提供深刻的洞察。\n4. 《陶哲轩教你学数学》\n菲尔兹奖（数学界的诺贝尔奖）得主陶哲轩数学思维大解析，通过奥数竞赛习题解答，带你领悟数学之美。 本书是天才数学家陶哲轩的第一本书，论述解决数学问题时会涉及的各种策略、方法，旨在激发青少年对数学的兴趣。书中涵盖的内容包括：数论、代数、分析、欧几里得几何、解析几何。\n5. 《用数学的语言看世界》\n本书为理论物理学家大栗博司先生写给自己女儿的数学读本，全书以用“数学语言”解读自然为线索，用生动故事和比喻重新讲解了数学的核心原理与体系，并且讲解了把数学作为一门“语言”的思维方式，是数学入门，重新理解数学的科普佳作。\n6. 《数学思考法：解析直觉与谎言》\n本书为讲解“数学思考法”的通俗科普读物，书中通过用数学思维解析实际生活案例、公众认知中的错误直觉、数学经典名题等方式，由浅入深地传授了分析数据信息价值、辨别谎言、拆解转化复杂问题、抓住事物本质的思考之法，同时讲解了相关的数学知识与理论，可以有效提高理性思维、判断与解决问题能力，对于理解数学、培养数学兴趣亦有有益启示。\n7. 《几何世界的邀请》\n平面几何是观察判断与逻辑思考的精妙结合，是初等数学教育中培育创造力的好途径。本书为日本数学家、菲尔兹奖得主小平邦彦先生的几何入门作品，书中以欧几里得几何、希尔伯特几何、复数与几何为轴线，由浅入深，层层深入，从作为图形科学的几何、作为数学的几何等不同角度介绍完整的几何世界，是几何入门、训练思维与创造力的佳作。\n8. 《物理是什么》\n本书为著名日本著名物理学家、诺贝尔物理学奖得主朝永振一郎先生的物理启蒙科普作品，书中以思索“物理是什么”为线索，以宏阔视野、精深笔触，通俗讲述了从早期哲学思辨到炼金术、占星术，再到近代科学的物理体系的发展，并重点讲解了物理发展过程中的核心原理。同时，书中还收录物理大师朝永先生关于物理的反思，以及对科学与文明关系的思考，是重新认识物理的不朽名作。\n9. 《物理奇遇记》\n本书是著名物理学家乔治·伽莫夫的经典科普作品。通过汤普金斯先生在这些梦中物理世界的种种奇遇，乔治·伽莫夫在这部科普经典中向我们生动讲解了相对论、宇宙学、量子理论以及粒子物理的诸多基本概念，让我们得以更清晰地理解我们所实际生活的物理世界。\n10. 《黑洞与暗能量：宇宙的命运交响》\n欧盟“欧洲科学传播奖”获奖佳作，20年经典科普读物、黑洞爱好者必读经典《黑洞》新版再现。本书围绕黑洞与暗能量两大主题，详细阐述了恒星、黑洞等宇宙天体诞生、演变与陨灭的精彩历程，揭示了黑洞与暗能量的真实面貌，在围绕人类揭秘宇宙的恢弘人文与历史背景中，讲述探索宇宙的物理与天文知识。\n这里是福利：\n10本书赠送给一直支持网易云社区的知友们！\n网易云社区联合图灵出版社在知乎上发起10本最热门科普书免费送！人工智能数学物理获奖经典佳作！  点击参与活动\n参与规则：在该文章的评论中回复以上书籍中你最想看的一本书名称（需在知乎平台上参与才有效哦）。\n7月20日，我们将从回复了最想看的书籍名称的朋友们当中，抽取10名幸运小伙伴免费赠送以上正版书籍一本哦。\n同时网易云社区在知乎平台的另一场赠书活动13本热门书籍免费送！（Python、SpingBoot、Entity Framework、Ionic、MySQL、深度学习、小程序开发等，7月13日结束）正在进行当中，7月网易云社区伴你一起学习成长。\n更多网易产品、运营、技术经验分享敬请关注网易云知乎机构号：网易云 - 知乎（关注者中奖几率更高哦！）"}
