{"content2":"人工智能系统\n我做了一个梦。假设你想永远生活梦中见到的人只是想保住他们的思想和智慧，我们不想让他们的肉，还是因为看《曲柄2：高压》只有梦想做的，离开大脑的事实存在，甚至永生它？看到敌人会生气，这是唯一的，那么，什么是永恒的生命点？\n不是梦的所有。在梦中我看到为了实现对农业自己主动喷淋系统，须要在水管入口安装一个总阀，然后分出3个分支。每一个分支再安装一个阀门，每一个分支再接个3通引出3个分支，每一个分支再安装一个阀门，这样总共同拥有9个喷淋头，当要喷淋的时候，仅仅要打开总阀，分支阀。最后打开终端阀门就能够喷淋某个区域，喷完了就关闭阀门，这就是人们说的农业机械化，不须要手工操作。仅仅要开动机器。\n假设喷头有几万个，一个一个打开也是非常麻烦的，一个人一天下来都不一定能做完。因此设计人员又在每一个阀门上安装一个控制设备。通过无线连接，中心主机通过网络连接到每一个阀门控制器，发送指令启动和关闭阀门，实现自己主动喷淋，人不须要走过去手动了，甚至能够设置时间，每天每一个阀门某个时候开启阀门喷淋5分钟，然后自己主动关闭。操作人员这下人都不须要起来启动喷淋指令。这就是人们说的自己主动控制，自己主动化。远程控制。感觉这个喷淋有点智能了。有点像我们经常使用的智能手机。能够远程控制家里的电视机。\n只是这个还不是结束。\n科技人员在每一个喷头喷淋区域安装一些水分含量探头，探測是否干旱，把数据发到喷头控制器，然后再把数据发到控制中心。\n控制中心主机计算出是否干旱，干旱程度，然后决定是否启动喷淋。以及喷多久，就把指令发送到喷头控制器，定时定量喷水。全然灌溉自己主动化。\n这时候已经不须要人去管理这片土地，人已经是多余。\n我们说这就是人工智能。人工创造的智能，就是黑客帝国的那个帝国。人工智能创造的机械兵团帝国。\n我们地球的生态系统就像人工智能。雨水能自己主动循环喷洒土地和植物。不须要人为去干预。\n人工智能（Artificial Intelligence），英文缩写为AI。\n它是研究、开发用于模拟、延伸和扩展人的智能的理论、方法、技术及应用系统的一门新的技术科学。\n人工智能是计算机科学的一个分支，它企图了解智能的实质。并生产出一种新的能以人类智能相似的方式做出反应的智能机器，该领域的研究包含机器人、语言识别、图像识别、自然语言处理和专家系统等。\n人工智能是对人的意识、思维的信息过程的模拟。\n看起来非常难理解，我们能够这样觉得，人工智能是一台机器，能像人一样智能做事。机器人是人工智能。这样非常easy理解，只是上面全然自己主动化的喷淋系统也算一个人工智能。只是它没有人脸人声音，假设不用键盘鼠标跟他对话。那非常像人了。\n假设有一天它有益不喷水导致禾苗死亡，我们觉得它出故障了，而不是它有了自己的思维，或者中了病毒？\n研究人的智能。非常多都是非常easy的。条件式反应，跟动物差点儿相同。\n以下是一句程序代码，能反映这样的条件式反应\n假设 （ 我渴了（）） 想喝水（）\n假设 （想喝水（）） 运行喝水动作()\n这样的条件式反应不是人类独有。动物都有\n饿了 吃饭\n困了 睡觉\n天亮了 起来干活\n事实上复杂的是人的智能，自我学习，自我思考，自我总结，逆向思维，做梦。\n比方这篇文章《人工智能系统》就是从做梦開始的，并联想到黑客帝国，农业，自己主动控制，智能。并開始分析人工智能。这是怎么做到呢？再厉害的电脑也未必能做到吧。语言的表达，联想。查询概念，发散思维。总结。这些是写完这片文章不可缺少的。我们看到已经有自己主动写文章的软件。可是人类智能的终极智慧。就是创造，创新。似乎不是人工智能能做到的。\n这篇文章不唯独收集整理的资料，还有创新的。比方几个层次的喷淋系统，似乎没有人想过，写过。假设已经有人写过了，那么我把它们加进来，那就是抄袭。\n不是创意。属于专家系统。\n机器学习。有些简单的能够学。可是复杂的未必学会真谛。\n并且给自己主动喷淋系统学习，那么可能就会出错，事实上人学习后满足于经验，常常犯错误的。自己主动喷淋系统是不能够犯错误。所以它不能有学习功能。人能够犯错误，可是人工智能系统能犯错误吗？人工智能学习了独霸统治人类的思想，就会反人类了。这不是我们想要的。事实上大脑是非常复杂的。生物性的，不是能够简单复制的。\n并且没有肉体支撑的人工智能，也不可能有人类所说的灵感。生物性是非常微妙的东西，人的情感受生物影响，对同一个人。有的人喜欢，有的人厌恶，人工智能要选择什么样的情感呢？喜欢还是厌恶？事实上机器人只能选中一种。而不是千变万化。否则我们会说这个机器人疯了。\n人工智能应该定义在实现人类思想的精确机器，不能做创新的。假设人去浇水。会常常喷过头，或者不够。\n自己主动喷淋系统不能够犯错误，所以假设喷淋系统自作主张把喷淋1分钟变成10分钟，这样认为好玩，那样会闹成水灾，预计不久就被人砸烂了，没人喜欢这种系统。\n所以非常多电影描写机器人有自我意识，猩球崛起，那是非常可怕的。人类不会这样给自己挖掘坟墓。\n人工智能包含机器人、语言识别、图像识别、自然语言处理和专家系统等\n机器人 是外观，运动系统\n语言识别、图像识别、自然语言处理 是输入输出系统\n专家系统 是后台决策处理系统，模拟人类思考，并且仅仅能做对的事情。\n可是自我意识。感觉系统不应该是研究出来的，否则会不听使唤。\n感觉自己主动喷淋系统仅仅跟专家系统对上号，只是假设探头可以看庄稼的颜色，那就有图像处理，跟人对话就有自然语言处理。只是人工智能何必就一定做成人模人样呢。\n把上面自己主动喷淋系统整合到一个机器人身上。我们会看到人工智能的雏形。\n探測器，控制器。网络，决策系统。输入输出。这是一个非常好的人工智能系统，为人民服务做得非常好。\n或许以后一个工厂实现了一个人工智能系统。可能不须要一个工人。\n超过了自己主动化一个层次。那时候可能不须要非常多工人了。战争中使用人工智能系统，不见士兵，仅仅见机械兵团。\n汉澳矩阵电脑理论能帮助实现机器人研发。事实上那是一个多cpu多操作系统并存的系统，不是虚拟操作系统。一个机器人不能仅仅有一个操作系统，运动系统，语音识别，图像识别，专家系统，它应该是多个计算机系统的共存。眼盲人的眼睛可以运行。断腿会说话。只是不是现在怎么样cpu多电脑操作系统。\n人工智能系统是一种完全代替人，自己主动复杂的处理系统智能完成繁重的工作。\n也许很快就会有中国第一个人工智能系统。"}
