{"content2":"原文链接摘要：     云栖大会在走过深圳、南京、成都后，即将于6月10号11号在上海隆重召开！ 在之前的三场，我们都为大家带来的是阿里人工智能全线产品的分享，此次在上海为大家带来视觉计算的专场。 因为深度学习技术的发展、计算能力的提升和视觉数据的增长，视觉智能计算技术在不少应用当中取得了令人瞩目的成绩。云栖大会在走过深圳、南京、成都后，即将于6月10号11号在上海隆重召开！在之前的三场，我们都为大家带来的是阿里人工智能全线产品的分享，此次在上海为大家带来视觉计算的专场。因为深度学习技术的发展、计算能力的提升和视觉数据的增长，视觉智能计算技术在不少应用当中取得了令人瞩目的成绩。作为阿里云上的视觉智能系统、 视觉信息离线和实时智能分析处理中心，“阿里云眼”承载了云上广泛、深入的视频图像分析、识别、搜索、生成和挖掘服务。阿里云视觉计算专场通过主题演讲、产品发布、视频播放等多种形式，结合客户的实际需求，介绍了阿里云眼在城市大脑、图像识别、视频分析、医疗健康、搜索广告、视觉设计、图形等领域取得的成果，以及对视觉智能发展前景的一些见解。以下为提前预热的议程，我们敬请期待！《大数据视觉智能之理论与实践》近些年来，基于深度学习的发展、计算能力的提升，以及视觉数据的增长，视觉智能技术已经广泛应用于很多领域，在不少应用当中取得了令人瞩目的成绩。但在很多地方如交通安防监控、手机、医疗、体育等领域，有大量的数据需要自动化的监控、分析、管理和识别，这都给视觉计算带来了新的挑战和机会。正是在这个应用需求量激增的背景下，加上深度学习技术、视觉搜索技术和云计算平台的飞速进展，我们在阿里云计算平台上提出了“阿里云眼”，承载云上广泛、深入的视频图像分析、识别、搜索、生成和挖掘服务。本议题结合实践案例，总体介绍了阿里云在视觉智能方向的发展状况和典型应用。《阿里云机器学习技术与应用》作为阿里“NASA”首个人工智能武器阿里云机器学习平台PAI 2.0于今年3月份对外发布。PAI不仅通过高性能云端计算降低用户存储和计算成本，还具备先进的工具和算法库进而降低技术门槛。PAI 提供了丰富的算法，并以可视化的界面帮助用户快速的进行数据处理、建模以及完成预测。同时PAI 提供了全面兼容开源深度学习框架TensorFlow、Caffe、MXNet，在底层提供了强大的云端异构计算资源，包含 CPU、GPU、FPGA。在 GPU 方面，PAI 2.0 可以灵活实现多卡调度。本议题将结合PAI跟大家分享众多用户基于PAI的场景实现及成果。《优酷场景化营销》姚瑶 优酷广告策略高级经理在用户注意力愈加分散的背景下，如何提升品牌传播效果，是目前广告营销面临的重大挑战。对此，借助阿里大数据与新技术赋能，优酷从对的人、对的场景以及对的形式三个维度出发，寻找综合性营销解决方案，本议题重点介绍在视频场景营销上的探索。在面对复杂海量的视频内容时，通过阿里云人工智能技术加持，根据深度学习算法，准确而高效地识别视频场景，并从时间、空间、事件、人物四个维度建立起结构化的场景标签体系，为品牌广告主提供了可规模化的场景营销解决方案。《深度数据驱动的重建与交互》A depth image encodes the distance to the camera center for each pixel in the image. Thus it captures the partial 3D information from its viewpoint. In this talk, we report our recent researches on the algorithms to analyze and fuse such partial 3D information for 3D scene modeling, which is ready for VR/AR applications. Our semantic analysis of depth images ranges from low-level planarity analysis to high-level object recognition.   The analysis results significantly improve the reconstruction quality and its applications. Finally, we will introduce our real-time clothing simulation algorithm that supports virtual clothing application driven by depth images.《人工智能时代下的视觉设计》一直以来，视觉设计都是一门艺术。设计的优劣与设计师的艺术修养和设计经验密切相关。随着人工智能时代的到来，阿里巴巴把专业的设计能力附能给了计算机，让视觉设计的速度不再受限于设计师一次次的鼠标移动和点击。以横幅广告为例，智能设计技术能够眨眼间自动完成横幅元素的布局与配色，并适配各种屏幕尺寸与业务风格，从而让横幅广告的制作与投放变得无比容易。《医学影像在肿瘤诊疗的应用及智能诊断探索》张国桢 复旦大学附属华东医院放射科主任行湘 阿里巴巴iDST算法专家医疗影像技术的发展有目共睹，它正变得更清晰、更精准，影像数据也成为了医院内体量最大的数据集合，然而人工读片的方式耗费了医生大量精力，加上基层医院影像科医生的缺乏，从成本、效率和准确率上都制约了医疗影像数据在诊断中的应用价值。所以本议题讲会分享基于深度学习的智能诊断方法，采用计算机进行自动读片，怎样提升诊断速度，降低人工成本，以及帮助医生更好的发现结节区域、提升医生诊断效率。如果我们准备的内容对您有所帮助，那不容错过！上海云栖，我们不见不散！报名链接：https://yunqi.aliyun.com/原文链接"}
