{"content2":"2016中国人工智能企业TOP100\n不论在学界还是业界，均有代表人物对人工智能表示了担忧，如史蒂芬·霍金和比尔·盖茨。尽管如此，国内外科技巨头都积极发力人工智能，一波波创业者也相继涌入。人工智能成为当下最炙手可热的科技力量。\n科技这把双刃剑始终代表着人类对于自身的超越，对于更高级智慧的探索，以及无限的好奇心和创造力。科技的发展犹如一条直线，无可逆转。人类只有深入了解它，才能更好地应对并驾驭它。\n类人是人工智能的第三阶段，有情感、会思考、能行动\n丰富的海量数据、强大的计算模型、深度学习和人脑芯片等共同推动着人工智能的逐步完善。\n前几年大数据、云计算的发展热潮，使数据搜集与处理成本逐渐降低，分析能力逐步增强。\n机器能够基于庞大的数据来挖掘其价值，进而形成一定认知，并做出一定判断。它体现出基础人工智能的优势，数据依据更广博、精准，判断更理性。\n其中，作为底层技术的语音识别是人工智能的战略基础。语音识别离不开对相应场景数据的智能训练。微软小娜，亚马逊Echo、苹果Siri等语音服务早已被视为人工智能崛起的另一促进因素。\n而随着AlphaGo击败围棋冠军李世石，深度学习显示出其巨大能量，人工智能从可能走向现实的几率也随之增大。大数据和深度学习成为人工智能的必争之地。\n当然，目前的人工智能技术大部分还处于较为初级阶段。人工智能基本可分为三个阶段，分别为识别阶段（在大量文本中识别特定信息、含义）、认知阶段（基于资料做出判断的能力）和类人阶段（有情感、会思考、能行动）。\n无论哪个阶段，数据成为不可或缺的因素。\n如果没有真正的技术支撑和产品的落地，资本的涌入可能形成一定负面作用\n根据CBInsights的资料显示，2015年AI创业公司仍是投资焦点之一。其中，医疗健康领域融资占比达15%，另外则是场景辅助、机器人、CRM、机器学习、电商、网络安全与监管及教育等领域。可见，人工智能将应用到各行各业。\n例如，成立于2004年的Palantir通过整合人工智能算法和多个数据库，所推出的服务已经被CIA、FBI等美国政府机关采纳。尤其在安全问题方面，它成了美国情报机关反恐不可或缺的工具。\n相应地，人工智能人才也成了香饽饽。他们是技术型人才，对人工智能的理解与运用极其深入。他们也可能极具创意，在商业模式上能够引领潮流。\n投资热潮必然推动产业的发展，但如果没有真正的技术支撑和产品的落地，资本的涌入可能形成一定负面作用。所以，始终把握科技的初心。\n人工智能的发展，离不开对人性的了解\n这是斯坦福大学计算机系终身教授、人工智能实验室主任李飞飞的观点。她带领团队创造了能自动生成图说的软件，并创建了图像识别数据库ImageNet，成为学界和业界的标准。\n而她提出的“人工智能将改变世界，但谁将改变人工智能？”这一问题，恰恰彰显出科学工作者对于人文的关怀。科学与艺术需要达到平衡，否则人类命运的天平倾倒，潘多拉的盒子会带来难以估量的黑暗。\n结语\n人工智能将人类从繁杂的劳务中解放出来，甚至让人摆脱身体在时空中所受的限制，超越现有状态。人工智能是对未来的、力量的渴望，是人类的进化，是不可抵挡的脚步。\nCBinsight2016年100家人工智能公司\n人工智能腾讯科技谭燃2017-01-23 16:56\n【AI世代编者按】调研公司CB Insights近日公布了“最值得关注的100家人工智能公司”。上榜的这100家企业正在从事人工智能领域的技术研究，试图利用人工智能来改变各行各业。\nCB Insights的评选结果基于这些公司所提交的数据、对一系列问题的回答、以及企业的Mosaic分数。Mosaic是一种获得了美国国家科学基金会资助的算法，能预测一家的健康状况。\nCB Insights联合创始人兼CEO阿南德·桑瓦尔(Anand Sanwal)称：“从金融服务到医疗保健，再到运输，每个行业的传统巨头都认为，人工智能将重塑他们所在行业。历史多次证明，这种革命性创新恰恰来自新兴公司。在人工智能领域，上榜的这100家公司正在从事一些具有突破性的研究工作，并有望在未来数十年内颠覆我们的生活。”\n关注AI世代（微信号：tencentAI），回复“100AI”可获得该报告原文下载。\n有关这100家人工智能公司的一些数据：\n·超过1650家公司被提名，仅6%被选中。\n·入选的中国内地公司有深圳碳云智能科技有限公司(iCarbonX)、杭州Rokid公司、北京出门问问和深圳优必选。\n·自2012年以来，这100家公司通过263笔交易融资38亿美元。\n·其中5家公司的估值为10亿美元或更高，即“独角兽”公司。\n·2014 年以来，这100家公司进行9笔超大规模融资(融资额达到1亿美元或更多)。\n·其技术的应用领域包括医疗保健、药物发现、商业智能、游戏和制造等。\n·这100家公司来自11个国家和地区。\n以下为AI世代（tencentAI）编译整理的 “最值得关注的100家人工智能公司”(按公司名称首字母顺序排列)：\n1. Affectiva\n公司网站：affectiva.com\nAffectiva拥有“麻省理工学院媒体实验室”背景，是“情感人工智能”(人工智能的下一个研究前沿)领域的先驱。Affectiva的使命是利用情感识别技术将情感智能带入数字世界。Affectiva的专利技术集计算机视觉、深度学习和全球最大的情感数据库为一体。Affectiva的SDK和API允许开发人员将情感感知和分析添加到自己的应用程序、游戏、设备和数字体验中。当前，1/3的“财富全球100强企业”都在使用Affectiva的情感识别技术。该技术可用于多个垂直领域，包括在线教育、健康、游戏、机器人、媒体和广告、市场调研、汽车零售、人力资源、培训和辅导、视频通信、体验性设计、可穿戴和各种设备。\n2. AImotive\n公司网站：aimotive.com\nAImotive总部位于布达佩斯，为完全自动驾驶汽车开发全套软件组件。AImotive的算法将摄像头作为主要传感器，以完成对象识别、分类、定位、决策、路线规划和车辆控制等任务。除了软件引擎组件，AImotive还提供一个广泛的工具开发包，以加速训练和验证，包括校准、数据采集和增强数据生成、半监督注释，以及实时逼真的模拟环境。为了解决日益增长的硬件加速器需求，AImotive还面向汽车嵌入式解决方案设计了一个强大、高效的神经网络硬件IP。其参考设计可帮助芯片厂商开发有针对性的硬件来匹配人工智能软件套装。\n3. Algorithmia\n公司网站：algorithmia.com\nAlgorithmia帮助开发者、企业和学术界创建、运营、部署并商业化人工智能微服务。当前，超过30000名开发者访问Algorithmia的超过2500种算法的微服务。通过简单的API，开发者可以将这些微服务整合到自己的应用中。Algorithmia的使命就是推动“算法智能”(algorithmic intelligence)的发展、发觉和接入性。目前， Algorithmia提供了两个主要产品：Algorithmia.com(微服务市场)和CODEX(功能和人工智能模型的平台)。\n4. AlphaSense\n公司网站：alpha-sense.com\n智能金融搜索引擎AlphaSense帮助那些需要应对大量数据的专业人员解决信息过载的问题。当前，一些平台提供了人们需要的大量文件，但没有一家提供智能搜索功能。而AlphaSense提供对专有研究数据库的访问，并包括金融语言的语义知识和相关性分析，以开启有价值的隐藏信息。AlphaSense收集了数百万份文档，包括企业提交给监管部门的文件、公司简介、新闻、公关稿、华尔街的调研报告，以及其他任何被上传的内容。\n5. Anki\n公司网站：anki.com\nAnki的使命是把人工智能和消费机器人普及到人们日常生活中。Anki的主要产品是Anki Overdrive，它将电子游戏和实体道具相结合。通过智能手机，用户可以在自定制赛道上驾驶一辆赛车。玩家可以与好友一起比赛，也可以挑战由Anki人工智能技术控制的其他汽车。\n6. Atomwise\n公司网站：atomwise.com\nAtomiwise利用人工智能挖掘新的潜在药物。该公司建立了第一个用于“结构性药物设计”的深度神经网络。目前，Atomwise正在帮助研究人员解决慢性疾病(如癌症、多发性硬化症和糖尿病)、被忽略的全球疾病(如埃博拉病毒和疟疾)、死灰复燃的疾病(如耐抗生素细菌 )和生物疾病威胁(如肉毒杆菌神经毒素)。Atomiwise的神经网络已被应用到整个药物发觉过程中，每天可分析数以百万计的分子。\n7. Appier\n公司网站：appier.com\nAppier是一家总部位于台北的技术公司，帮助企业在“跨屏幕时代”利用人工智能获得增长和成功。Appier由一群充满激情的科学家和在人工智能等领域拥有丰富经验的工程师所创建，员工主要来自谷歌(微博)、英特尔、雅虎、哈佛大学和斯坦福大学等。当前，Appier服务于全球500多个品牌和机构。\n8. Automat\n公司网站：automat.ai\nAutomat是世界上第一个基于人工智能的对话式营销平台。它允许企业与客户进行个性化的一对一对话，以促进互动。Automa的Bot Creator程序编写环境允许营销人员、创意人员和开发者协同开发基于人工智能的对话软件，以淘汰当前的“一刀切”销售模式。通过Automat的“对话即服务”(CaaS)平台，卖家能利用CLU编程语言来了解消费者对其品牌和产品的反馈。\n9. Ayasdi\n公司网站：ayasdi.com\nAyasdi帮助全世界的公司利用人工智能和大数据来提高员工的产出，激发超越人类能力。Ayasdi的革命性机器智能平台利用自动化、机器学习和拓扑数据分析，来简化从庞大复杂的数据集中抽取相应的知识，从而促进企业部署基于人工智能的应用。当前，许多全球500强企业都是Ayasdi的客户。\n10. babylon\n公司网站：babylonhealth.com\nbabylon是智能手机或者平板上的个人医疗服务。它简单易用，任何人都可以随时随地使用。人们在几分钟内就能联系上医生，在手机上进行面对面问诊。babylon的使命是让人们更健康、更快乐。为此，babylon为其应用增加了许多实用功能。用户可以检查任何症状，通过聊天功能咨询任何问题，并迅速得到答复。此外，用户还可以通过其应用订购各种健康检测工具。babylon正在改变让人类变得更健康的方式。\n11. BenevolentAI\n公司网站：benevolent.ai\n尽管知识量急剧增长，科学发现的工作方式50年未变。人类自身不可能处理所有的信息，虽然每30秒就有一篇新的科学论文被发表，但实际上只有一小部分科学信息可形成“可用知识”。BenevolentAI把人工智能和深度学习技术用于大量复杂科学信息的分析，从而改变了知识的创建方式。BenevolentAI的第一款人工智能应用(生物科学领域)已被用于药物研发，并且正被拓展到其它领域。\n12. BloomReach\n公司网站：bloomreach.com\nBloomReach的个性化平台集多种技术为一体，为各种数字环境(包括用户获取和用户转变)下的个人和企业提供良好的体验，使之更个性化，并贴近用户期望。\n13. Blue River Technology\n公司网站：bluerivert.com\nBlue River Technology致力于为农业开发和提供先进的技术。利用计算机视觉和机器人技术，Blue River Technology希望让每一种农作物都被精准耕作。\n14. Cape Analytics\n公司网站：capeanalytics.com\nCape Analytics的使命是改变人类所创建环境信息的创建和使用方式。Cape Analytics利用人工智能技术快速、自动地从地理空间图像中提取专属数据。Cape Analytics的云平台利用计算机视觉技术来提供高质量的信息，这些数据面向所有人开放，而且很容易保险公司等机构整合到自家应用中。\n15. Bonsai\n公司网站：bons.ai\nBonsai总部位于加州伯克利(Berkeley)，是一个软件开发平台，允许所有发者搭建、训练、使用智能模型。不需要复杂的AI算法和技术，Bonsai人工智能引擎能让开发人员更高效地编码，以更好地控制和优化硬件和软件。\n16. Captricity\n公司网站：captricity.com\nCaptricity是一款安全的云服务软件，它能把手写文章转换成电子版，准确度超过99%。Captricity的云解决方案基于深度学习技术，可以从任何来源(纸质文档、扫描件、传真、电子邮件、呼叫中心和Web格式)抽取数据，然后自动连接后端系统进行深度分析，从而省去了人工输入的低效率和高成本。\n17. Chorus.ai\n公司网站：chorus.ai\nChorus的使命是基于每一个成功的销售电话来了解哪些因素影响对话结果，从而帮助你的团队做出正确的决策。当前，几乎所有的这些对话(销售电话)都在结束后的几秒内就被忘记，而Chorus正在改变这一现状。Chorus是一支由全世界一流科学家、工程师和产品设计师组成的紧密团队，许多数据驱动型上市公司和高增长型公司都是Chorus的客户。\n18. Citrine Informatics\n公司网站：citrine.io\nCitrine运行着全球最大的材料库平台。Citrine利用该平台来构建人工智能软件，以推动更高效的发现、优化、制造和部署材料。该软件平台通过各种来源吸纳结构性和非结构性材料数据，然后利用人工智能引擎来识别这些数据中的重要信息，从而助力客户的研发与制造。Citrine服务于那些利用先进材料获取竞争优势的企业，涵盖汽车、航空、消费品、电池和电子等领域。\n19. Chronocam\n公司网站：chronocam.com\nChronocam总部位于巴黎，该公司正在开发一种独特的、生物启发和自适应的方法，来满足自动驾驶、联网设备、安全和监控系统对视觉传感和处理的需求。其创新性的视觉传感器和系统复制了人眼的功能，可实时感知动态场景并获取必要信息，从而解决了普通视觉传感器的局限性。在感知速度、动态范围、视频压缩和能耗方面，Chronocam的视觉解决方案为业界树立了新标杆。\n20. Clara Labs\n公司网站：claralabs.com\nClara Labs以比人类更聪明、更高效的方式来管理您的工作日历。当需要安排会议时，只要抄送给clara@yourcompany.com ，Clara就会接管邮件对话，并以你的名义发送日程邀请。Clara Labs的客户遍及全球，包括销售团队和人力资源部门，每周可帮助他们节省数千小时的时间。\n21. Clarifai\n公司网站：clarifai.com\nClarifai是一家人工智能公司，擅长视觉识别，为企业和开发人员解决现实生活中的一些问题。Clarifai创建于2013年，曾在“ImageNet计算机视觉识别”挑战赛中跻身前五名。Clarifai的强大视觉识别技术基于最先进的机器学习系统，可通过一套简单的API轻松访问，它允许全世界的开发者开发新一代智能应用。Clarifai允许开发者和企业利用人工智能进行快速、低成本的创新，同时提供更好的用户体验。\n22. CloudMedx Inc\n公司网站：cloudmedxhealth.com\nCloudMedx打造了一个临床人工智能平台，把基于“脑启发的临床算法”\n应用的规模和简单性推广到医疗保健领域。该平台建立在一个全面和不断增长的医学知识网络基础之上，它集机器学习和大数据分析为一体，可实时生成健康见解，改善慢性疾病治疗效果。\n23. CognitiveScale\n公司网站：cognitivescale.com\nCognitiveScale为医疗保健、商业和金融服务市场开发机器智能软件。其主要产品为Engage和Amplify，可帮助大型企业提高用户参与度，改善决策，提供自学习和自我保证的业务流程。许多全球500强企业都成功地部署了CognitiveScale的软件，包括IBM和微软。CognitiveScale由IBM、甲骨文和Salesforce等公司的前高管于2013年创建，总部位于德州奥斯汀(Austin)，在英国和印度设有办公室。\n24. Context Relevant\n公司网站：contextrelevant.com\nContext Relevant的产品利用机器学习技术所驱动的“自动化数据科学平台”(ADS)，解决了世界上最棘手的大数据、预测和行为方面的挑战。与其他解决方案相比，Context Relevant的技术更快、更有效。Context Relevant的机器学习平台使用了世界上最优秀的开源基础架构，如Hadoop和Spark，并与自家的ADS引擎和应用环境相整合，从而确保快速创建、测试和部署由数据科学和预测性分析驱动的智能应用。\n25. Cortical.io\n公司网站：cortical.io\nCortical.io提供基于“语义折叠理论”(Semantic Folding，处理“大文本数据”的新型方法)的自然语言理解(NLU)解决方案。其灵感源自对大脑信息处理方式的最新发现，Cortical.io的Retina引擎可将语言转换成语义指纹，然后通过对比指纹的重叠度来比较任何两个文本的语义相关性。Cortical.io创建于2011年，总部位于奥地利维也纳。\n26. CrowdFlower\n公司网站：crowdflower.com\nCrowdFlower是一个面向数据科学团队的人类干预训练平台，帮助客户生成高质量的自定义训练数据。CrowdFlower平台支持一系列应用案例，包括自动驾驶汽车、个人智能助理、医学图像标记、内容分类、社交数据分析、CRM数据改进、产品分类和搜索相关性等。CrowdFlower总部位于旧金山，客户包括“财富500强”企业和数据驱动型企业。\n27. Cylance\n公司网站：cylance.com\nCylance由互联网安全公司McAfee前高管于2012年组建，是一家网络安全产品和服务公司，专注于提前预防网络攻击。Cylance的旗舰产品是CylancePROTECT，是全球第一款下一代防病毒软件，基于人工智能和深度学习技术。与其他安全解决方案相比，Cylance的预防能力更强，2015年曾获得“最佳新兴技术奖”。\n28. Darktrace\n公司网站：darktrace.com\nDarktrace是全球领先的互联网威胁防御公司，去年曾被评为“最佳安全公司”。Darktrace的核心产品为“企业免疫系统”(EIS)，利用机器学习和独家算法来检测和响应以前未识别的威胁。Darktrace在英国剑桥和美国旧金山均设有总部，在奥克兰(新西兰)、波士顿、伦敦、米兰、孟买、巴黎、首尔、新加坡、悉尼、东京和多伦多等地设有办公室。\n29. Dataminr\n公司网站：dataminr.com\nDataminr通过从社交媒体活动中获取信息，来建实时、可执行的消息警告。Dataminr的强大算法能将Twiiter等公开数据转变成可实施的消息警告，使世界各地的安全、运营、财务和通信专业人员能够随着事态的发展而获取必要信息。这些警告消息是通过桌面应用和工作流整合方式提供给用户的。当前，全球许多企业、财务公司、新闻机构和公共机构都在使用Dataminr的消息警告，从而对各种事件做出快速响应。\n30. DataRobot\n公司网站：datarobot.com\nDataRobot把建立机器学习模式的过程变成自动化。通过提供快速、准确和自动化的程序，DataRobot可帮助企业级用户做出更智能、更快速的商业决策。DataRobot通过改变预测分析的速度和经济学，解决了数据科学家严重短缺的问题。\n31. Deep Genomics\n公司网站：deepgenomics.com\nDeep Genomics成立于2015年，致力于通过建立一套计算系统化来改善诊断、 治疗和了解疾病的方式。Deep Genomics的技术集机器学习和基因组生物学为一体，以了解、预测和解释DNA的变化。Deep Genomics开发出了一种新的机器学习方法，可以在海量数据中找出相应的模式，并推断出细胞如何读取基因组、并生成生物分子的计算机模型。\n32. Deep Instinct\n公司网站：deepinstinct.com\nDeep Instinct是第一家将深度学习技术应用于网络安全领域的公司，旨在利用深度学习为任何设备、任何平台和操作系统提供全面的保护。Deep Instinct的技术能实时检测出“零日威胁”和APT攻击(高级持续性威胁)，且准确性极高。凭借前摄性和预测性，Deep Instinct的技术为网络安全提供一种全新的防护方法。\n33. Deepgram\n公司网站：deepgram.com\nDeepgram是一款可以让开发者检索音频和视频文件中的语音信息的搜索引擎，它利用深度学习技术来挖掘和分析这些语音数据，搜索范畴包括通话、会议、播客、视频短片和演讲等。Deepgram拥有世界上最准确的关键词识别机制，可在音频中识别要搜索的关键词；人工智能建模机制，自动分析和分类；支持从音频中提取文本，省去人工录音并转为文本的麻烦。\n34. Descartes Labs\n公司网站：descarteslabs.com\nDescartes Labs创建于2014年，总部位于墨西哥。这是一家致力于推动预测科学的科技公司，利用机器学习和卫星图像等海量数据集进行不同行业的预测和分析。去年，Descartes Labs被调研公司CB Insights评为“游戏规则的颠覆者”。\n35. Digital Reasoning\n公司网站：digitalreasoning.com\nDigital Reasoning是认知计算领域的领先企业，构建了可以分析任何形式的非结构化和结构化数据的认知计算平台Synthesys，为金融、信息、国防、医疗等领域提供解决方案。\n36. DigitalGenius\n公司网站：digitalgenius.com\nDigitalGenius将深度学习和人工智能的实际应用带入了大公司的客户服务中，其核心是深度学习算法，为客户服务行业创建了一个可扩展的深度学习产品。DigitalGenius的产品主要有两大功能：利用机器学习来预测和自动匹配各种案例；利用深度学习算法来自动回答客户提出的问题。\n37. Dispatch\n公司网站：dispatch.ai\nDispatch是一家自动化快递服务创业公司，利用自动驾驶汽车来提供智能化快递服务。Dispatch的第一辆自动驾驶汽车名为“Carry”，由于足够小巧，可在人行道上行驶，同时又可以携带多个包裹。Carry主要在行人区运营，行驶速度与步行相当，因此可以轻松融入人流中。到达目的地后，用户将接到一个密码，用来打开车箱，然后取走货物。\n38. Drive.ai\n公司网站：drive.ai\nDrive.ai是一家软件公司，由斯坦福大学人工智能实验室员工于2015年组建，致力于重新构筑人与交通之间的根本关系。Drive.ai利用复杂的深度学习算法提供自动驾驶解决方案，目前已获准在加州测试自动驾驶车辆。\n39. Drawbridge\n公司网站：drawbridge.com\nDrawbridge是一家领先的匿名数字身份识别技术服务商，开发了已获专利的跨设备匿名数字识别技术，从根本上改变了品牌与消费者的连接方式。Drawbridge的“连接消费者图谱”(Connected Consumer Graph)包含了30多亿部设备上的10多亿消费者，品牌有三种方式与Drawbridge合作：从Drawbridge获得图谱授权，以实现跨设备数据应用；利用Drawbridge平台管理跨设备广告推广活动；与Drawbridge合作进行跨设备数字广告推广。Drawbridge总部位于硅谷，已获得红杉资本和KPCB的投资。\n40. Elitic, Inc.\n公司网站：enlitic.com\nEnlitic是一家致力于改进医疗诊断的深度学习公司，其算法由知名数据科学家、机器学习从业人员和医学专家组成的多学科团队设计，目的是提供更快、更准确的医疗诊断服务。例如，Enlitic的深度学习技术可帮助放射科医生提高准确性，降低成本，提高早期监测结果(可改善治疗结果)。\n41. fido.ai\n公司网站：fido.ai\nFido是一家自然语言处理技术公司，专注于利用人工智能技术将决策过程转换为对话。Fido决策引擎通过从文章、博客和社交媒体等来源提取事实和意见来实现自动学习。Fido的决策引擎具有广泛的应用空间，如事实验证、回答健康问题(基于临床数据、医患对话)、产品开发和营销等。\n42. Freenome\n公司网站：freenome.com\nFreenome是美国费城一家新兴液体活检诊断生物技术公司，通过对血液(自由细胞)中遗传物质流的动态收集，来诊断是否患有癌症。Freenome设计了一种学习引擎“适应性基因组引擎”，用最全面的方法从基因组中获得关于癌症的信息并进行分析，从而给出尽可能准确的预测。 去年，Freenome获得了来自Andreessen Horowitz等投资方的550万美元风险投资。\n43. Gigster\n公司网站：gigster.com\nGigster是一家为缺乏内部研发团队的企业和初创企业提供软件开发与设计解决方案的初创企业。其概念很简单，就像Uber把司机与乘客联系在一起一样，Gigster把自由职业的程序员、设计师与有软件开发需求的公司联系在一起。Gigster创建于2014年，已获得1200万美元的投资。\n44. Gradescope\n公司网站：gradescope.com\nGradescope使用人工技术帮助老师对学生的表现评分，以节省时间。到目前为止，Gradescope已经为全球超过200家机构批改了超过1200万页的学生作业。\n45. GrokStyle Inc.\n公司网站：grokstyle.com\nGrokStyle正在开发一款视觉搜索软件，能即时识别物体。该技术可应用于诸多领域，如室内设计、服装搜素、房地产搜索和产品查找等。当前，GrokStyle专注于室内产品设计。\n46. H2O.ai\n公司网站：h2o.ai\nH2O.ai的主要产品是H2O，即一个领先的开源人工智能平台。通过H2O，许多机器学习模式(线性模型、基于树的集成方法、深度学习)都可以通过R语言、Python、Java、Scala、JSON和H2O的Flow GUI进行训练。一些H2O的“任务关键型应用”包括欺诈、反洗钱、审计、信用评分、用户保险、ICU监测和预测性维护等。\n47. 碳云智能(iCarbonX)\n公司网站：icarbonx.com\n基于世界上最专业、增速最快的全息健康数据，iCarbonX利用最先进的数据挖掘和机器分析技术，提供个性化的健康分析和健康指数预测服务。通过与全球领先的合作伙伴共同努力，iCarbonX希望观察、研究、指导和关注个人健康。目前，许多公司都与iCarbonX建立了合作关系，包括研究机构、制药工厂、医学检测中心、意愿、保险公司和健康管理公司等。\n48. InsideSales.com\n公司网站：insidesales.com\nInsideSales.com创建于2004年，该公司开发了一个强大的平台，利用由人工智能的核心组成部分(大数据、机器学习和预测分析等)驱动的技术来解决销售相关问题，包括销售方、销售物品、销售地点和销售时间等。\n虽然越来越多的科技公司进入了人工智能领域，但InsideSales.com还是凭借其人工智能驱动的销售加速平台处于该领域的最前沿。\n49. Kasisto\n公司网站：kasisto.com\nKAI是一个会话式人工智能平台，帮助公司通过智能对话随时随地与客户进行互动和交易。KAI驱动的对话机器人和虚拟助手可以帮助支付、交易，进行帐户分析及个人财务管理。\n50. Kensho Technologies\n公司网站：kensho.com\nKensho是领先的实时统计计算系统及可扩展的分析架构，致力于通过先进的技术为金融机构提供市场透明度。Kensho利用大规模并行统计计算、用户友好的可视界面、以及预测分析领域的突破技术为投资专业人士提供下一代的分析平台。\n51. KITT.AI\n公司网站：kitt.ai\nKITT.AI总部位于西雅图，是一家自然语言理解创业公司，由艾伦人工智能研究所和亚马逊Alexa基金等机构资助。KITT.AI开发的可定制热词检测器(hotword detector)和对话引擎ChatFlow可以为任何基于语音或文本的设备/聊天机器人提供在线多回合对话功能。\n52. KONUX GmbH\n公司网站：konux.com\nKONUX GmbH总部位于慕尼黑，该公司结合传感器数据和人工智能，实时了解机器和基础设施的状况。这能让操作员提前分析机器的问题并预测维护需求，从而降低维护成本。利用KONUX GmbH的技术，其客户的设备维护成本最高可降低30%，机器故障率最高可降低70%。\n53. Logz.io\n公司网站：logz.io\nLogz.io是一个日志分析平台，利用人工智能和机器学习算法来查找IT环境中不断生成的信息量里的关键事件。Logz.io是一个企业级云平台，也是全球最受欢迎的开源日志分析平台。\n54. Loop AI Labs\n公司网站：loop.ai\nLoop AI Labs开发了认知平台Loop Q，该平台具有学习、解释上下文和理解意义的能力，能用任何语言推理暗数据(dark data)。Loop Q通过强化当前劳动力的能力，让让任何行业的公司处于第四次工业革命的最前沿。\n55. Lunit Inc.\n公司网站：lunit.io\nLunit是一家人工智能技术公司，致力于建立医生和技术间的合作关系，以更好地应对疾病诊断的挑战。Lunit利用视觉感知技术来解释医学图像，并标注有异常的区域。基于在深度学习领域的专业知识，Lunit一直致力于胸部X光异常检测、乳房X光照相术、以及乳腺组织病理切片的自动评级。\n56. Maluuba\n公司网站：maluuba.com\nMaluuba是加拿大一家深度学习技术公司，致力于帮助机器实现思考，推理和与人类一样的方式进行交流的能力。Maluuba的长期愿景是智能机器与人类手牵手，共同推动社会经济向前发展。\n57. MindMeld\n公司网站：mindmeld.com\nMindMeld总部位于旧金山，是一家提供对话式人工智能平台的技术公司。MindMeld的深域对话(Deep-Domain Conversational)人工智能平台支持自然语音或文本输入，可以向另一端的任何应用设备提供对话式用户界面。该用户界面可以是聊天机器人、语音助理，或者是多模态界面(在触摸、点击和语音之间无缝切换)。MindMeld的客户和投资者包括谷歌、三星、Uniqlo、Spotify、英特尔、Telefonica、Liberty Global、IDG、USAA和In-Q-Tel等。\n58. 出门问问(Mobvoi)\n公司网站：chumenwenwen.com/en/site/index.html\n出门问问是一家提供语音搜索技术的创新人工智能公司，其语音搜素技术包括：语音识别、自然语言理解、垂直搜索和前摄搜索。2015年10月，出门问问完成了由谷歌领投的C轮融资。这也是在过去的6年中，谷歌首次直接投资中国公司。自2012年创建以来，出门问问已融资7500万美元，估值为3亿美元(2015年10月)。基于其语音搜索技术，出门问问2014年底还开发了智能手表操作系统Ticwear，并于2015年6月推出了Ticwatch Android智能手表。\n59. mode.ai\n公司网站：mode.ai\nMode.ai是一家提供交互式用户体验的公司，利用计算机视觉和深度学习构建人工智能驱动的视觉聊天机器人(bot)，在移动信息平台上提供创新的对话式商务渠道。\n60. Nanit\n公司网站：nanit.com\nNanit是第一家利用计算机视觉技术监测睡眠数据的公司，不需要佩戴可穿戴设备， 即可为父母提供宝宝的睡眠状态数据，从而让宝宝睡得更香。Nanit婴儿睡眠监测器配备了高清夜视摄像头，可以直接通过手机APP来观察婴儿的睡眠情况。系统还内置小夜灯，可测试室内的温度和湿度。它还能发出舒缓的声音或白噪音，以帮助婴儿入睡。更重要的是，Nanit系统还搭载了智能计算机视觉，可以记录、分析婴儿在晚间的移动次数及方式，推算婴儿在晚间的睡眠质量，父母每早都会收到宝宝前一天晚上的睡眠报告。\n61. Narrative Science\n公司网站：narrativescience.com\nNarrative science的智能系统Quill平台能够理解不同类型数据中的重要信息，然后自动生成完美的书面内容，以提高员工效率。通过对给定主题的数据分析，系统会自动选择合适的写作角度，快速完成一篇具有标准新闻报道结构的文章。而且，系统还可以根据不同的出版社特点，用不同的行文风格“写作”。\n62. Nauto\n公司网站：nauto.com\nNAUTO是一种设备、网络和应用程序，旨在帮助用户以较低的成本升汽车，获得高端汽车才具备的网络和安全功能。NAUTO的系统包括一个收集和处理可视数据的车载设备，经过处理后生成有价值的参考数据，帮助司机高效、安全的驾驶汽车。\n63. Nexar\n公司网站：getnexar.com\nNexar创建于2015年，公司使命就是利用“车辆到车辆”(vehicle-to-vehicle)技术来避免交通事故。Nexar创建了一个相互连接的Dashcam应用网络，用来记录用户的行车状况，并提前警示用户可能发生的潜在交通事故。如果发生车祸，Nexar应用程序可以为司机提供交通事故的证据，帮助车主进行保险索赔。\n64. Numenta\n公司网站：numenta.com\nNumenta的使命是成为机器智能时代的领导者。Numenta认为，大脑是人工智能系统的最佳典范，为构建智能机器提供了路线图。大脑智力的核心——新大脑皮层——控制着一系列功能。Numenta试图建立一种模仿人类大脑新皮层的计算机系统，希望在处理许多认知任务时能接近或胜过人类。Numenta已经发展几个HTM(分层式即时记忆)示例应用程序，展示了广泛的适用性技术，并为开发者提供开源支持。\n65. Numerai\n公司网站：numer.ai\nNumerai是一家基于人工智能技术的对冲基金公司。Numerai建立人工智能的方式比较特别——基于建模用户与数据双匿名的方式，将加密数据开放给用户，以用户贡献的模型去搭建人工智能模型。Numerai每周定期发布加密数据和建模比赛，招揽匿名用户用加密过的交易数据集进行建模和分析。任何人都可以通过匿名的方式参与Numerai的训练营，如果参与者的模型真的成功地预测了市场走势，他们将获得比特币作为奖励。\n66. nuTonomy\n公司网站：nutonomy.com\nnuTonomy由世界知名的机器人和智能车辆技术专家卡尔·伊格尼玛(Karl Iagnemma)和埃米利奥·法佐立(Emilio Frazzoli)创建，总部位于马萨诸塞州剑桥市(Cambridge)，主要为自动驾驶汽车开发软件系统。nuTonomy的系统通过大量自动驾驶汽车提供“点到点”的出行服务。去年8月，nuTonomy开始在新加坡小型商业区“纬壹科技城”(One-North)内测试免费的自动驾驶出租车叫车服务。不久的将来，nuTonomy还将在波士顿公路上测试自动驾驶汽车。\n67. Orbital Insight\n公司网站：orbitalinsight.com\nOrbital Insight处于空间商业化和大数据的交叉点，是对卫星与无人机图像进行大规模分析的先行者。Orbital Insight从其他卫星公司购买图像，利用自学习算法进行深入分析，然后通过提供数据服务来获取利润。例如，通过分析庄稼的卫星图来预测庄稼的长势，从油箱体积分析出全球原油储量，通过分析停车场的数据来预测零售业的销售等。\n68. Paxata\n公司网站：paxata.com\nPaxata是一个自适应数据分析平台，创建于2012年。Paxata提供的自适应信息平台为业务分析师提供一个企业级自服务数据准备系统，能根据分析、运营和监管规定提供所需要的的支持。业务分析师可在一个直观的、可视化的应用程序上工作，无需编码，只要点击鼠标即可获取、搜索、组合、整合及发布数据，同时确保完善的管理和安全性。Paxata总部位于加利福尼亚州红杉市，在纽约州、俄亥俄州、华盛顿特区和新加坡设有办事处。\n69. Persado\n公司网站：persado.com\nPersado提供一个认知内容平台，利用自然语言处理和机器学习来自动生成基于行为和态度的数据，从而创造出对电子邮件、网页和其他营销活动最有效的文案。Persado的潜在用途并不限于电子邮件，还可以用来制作说服病人谨遵医嘱的消息，用来说服人们支付账单，说服人们遵纪守法，或是说服某人在线约会等。\n70. Petuum, Inc.\n公司网站：petuum.com\nPetuum是一个人工智能和深度学习研发平台，致力于帮助企业解决在人工智能和机器学习的部署过程中遇到的瓶颈问题和其他困难。Petuum正在建设下一代的全能AI/ML平台，面向深度学习、预测分析、知识提取、内容摘要提取、集成模型，可用于大量的应用，比如自然语言处理、图像和视频理解，以及数据转移中的反常检测。Petuum支持不同的硬件平台，也可用Python、R、Java、C++和Julia等多种流行语言编程。去年11月， Petuum获得1500万美元A轮风险投资，由Advantech Capital领投，投资方包括腾讯、Northern Light Venture Capital和Oriza Ventures。\n71. Pilot AI Labs\n公司网站：pilot.ai\n深度学习能在很大程度上提高计算机视觉系统的准确性，从而提供革命性的应用，如智能安全摄像头和自动驾驶汽车。但是，要提高计算机视觉系统的准确性，对计算机性能的要求极高，从而限制了这些应用所带来的裨益。而Pilot AI Labs的使命就是通过降低这些算法对计算性能的需求，来推广这些革命性的人工智能应用。今年，Pilot AI Labs的软件将被部署到数百万台设备中。\n72. Prospera Technologies\n公司网站：prospera.ag\nProspera正在开发用于农业的人工智能技术，试图把农业从一种基于直觉的实践活动转变为使用统计模型和自动化的活动，类似于当前的芯片制造业，利用各种协议来优化劳动力、灌溉、施肥和喷洒农药。\n73. Rapidminer\n公司网站：rapidminer.com\nRapidminer是业界最大的开源数据科学平台，让所有企业基于数据科学来做出每一个决定。Rapidminer为企业用户提供易用的科学大数据预测性分析服务。RapidMiner具有丰富数据挖掘分析和算法功能，常用于解决各种商业关键问题，如营销响应率、客户细分、客户忠诚度及终身价值、资产维护、资源规划、预测性维修、质量管理、社交媒体监测和情感分析等典型商业案例。RapidMiner解决方案覆盖了各个领域，包括汽车、银行、保险、生命科学、制造业、石油和天然气、零售业及快消行业、通讯业、以及公用事业等。\n74. Retention Science\n公司网站：retentionscience.com\n企业的用户各不相同，有些是新用户，有些从来不买东西，而有些人则是购物狂。Retention Science的人工智能技术以适于用户的方式向每个人推销商品。\n75. 杭州Rokid Corporation, Ltd.\n公司网站：rokid.com\nRokid机器人凭借人工智能和深度学习技术丰富了我们的生活，通过语音和视觉交互，它能前摄性地提供信息和娱乐功能，还能做家务。Rokid不只是一款简单的机器人，还是我们的家庭伙伴，它能通过独有的声纹识别技术来识别家庭成员。Rokid在杭州、北京和美国硅谷设有分部，团队目前拥有50多名成员，公司三位创始人分别来自阿里巴巴、诺基亚和金山。\n76. ROSS Intelligence\n公司网站：rossintelligence.com\nROSS Intelligence创建于2014年，利用人工智能技术让律师专注于最重要的事情上，即客户。ROSS Intelligence开发了一个专有框架LegalCognition，并与早期合作伙伴IBM Watson合并。它允许律师在几秒钟内执行繁琐的研究任务，而不是几个小时。\n77. Scaled Inference\n公司网站：scaledinference.com\nScaled Inference使得新一代的智能软件能够由大众构建，并提供一个开放的共享平台。Scaled Inference由谷歌前工程师创建，并获得了腾讯的投资。\n78. Semantic Machines, Inc.\n公司网站：semanticmachines.com\nSemantic Machines是一家私人控股的人工智能技术开发商，在伯克利和波士顿设有办公室。在获得贝恩资本、General Catalyst和其他投资者的2100万美元投资后，Semantic Machines正在开发一种人工智能技术，用于指导计算机了解语言和语境，并进行自然互动。Semantic Machines计划向战略合作伙伴提供高度可定制的人工智能平台技术。\n79. Sentient Technologies\n公司网站：sentient.ai\nSentient Technologies的使命是通过让企业以更快的速度做出正确的决定，来改变企业解决最复杂、任务关键型问题的方式。Sentient Technologies的专利技术具有感知能力，可为客户提供高质量的解决方案。Sentient Technologies获得了李嘉诚的投资。\n80. Shift Technology\n公司网站： shift-technology.com\nShift Technology为保险公司提供SaaS解决方案，旨在改进和完善欺诈检测。Shift Technology运用大数据和机器学习来识别保险索赔欺诈，其服务为保险公司节省了大量成本。Shift Technology总部位于法国，去年5月在A轮融资中获得1000万美元投资，领投方为Accel。\n81. Sift Science\n公司网站：siftscience.com\nSift Science为全球在线企业提供实时的机器学习防欺诈解决方案。其机器学习软件能自动学习和检测欺诈行为模式，在企业被骗之前发出预警。 此外，Sift Science还推出了一套新的产品旨在检测和减轻其他类型的欺诈和滥用，包括帐户滥用，内容滥用和促销滥用等。\n82. Sight Machine\n公司网站：sightmachine.com\nSight Machine是制造分析领域的领先者，可帮助企业针对自己的运营情况做出更好、更快的决定。Sift Science的分析平台利用人工智能、机器学习和高级分析技术，来帮助企业解决生产质量和生产力方面的挑战。 目前，许多全球500强企业都在使用Sift Science的技术。Sift Science创建于2011年，总部位于美国密歇根州。\n83. SigOpt\n公司网站：sigopt.com\nSigOpt是一个优化平台，可以“放大”企业的研究工作。SigOpt可以优化任何研究工作，并调整到最佳状态。SigOpt基于云的优化算法组合已被业界认可，可进行无缝部署，并全球保险、信用卡、算法交易和消费包装行业的领先企业所使用。\n84. Skymind\n公司网站：skymind.io\nSkymind创建于2014年，总部位于旧金山，是一家商业智能和企业软件公司。Skymind致力于解决数据分析和机器智能问题。Skymind支持分布式开源框架Deeplearning4j.org和ND4j.org分布式系统，如Hadoop和spark，用于储存、处理和快速分析大量的数据。Skymind 的用途包括诈骗检测、时间序列数据、文本分析、图像/面部识别和语音转文字等。2016年9月，Skymind获得300万美元种子轮融资，投资者包括腾讯、SV Angel、GreatPoint Ventures、Mandra Capital和Y Combinator。\n85. Snips\n公司网站：snips.ai\nSnips是一个SDK，允许任何人仅用一行代码就能创建自己的人工智能助手。Snips注重安全和隐私问题，是第一个完全在设备上运行而不需要服务器的智能助手。Snips拥有41名员工，其中18人从事机器学习，14人从事工程。Snips几位创始人全部拥有博士学位。\n86. SparkCognition\n公司网站：sparkcognition.com\nSparkCognition是一家全球领先的认知计算分析公司，成功地部署了先进的机器学习和人工智能算法，旨在发现隐藏在物联网和网络环境中的异常和网络威胁，同时自动调查并提出解决方案。\n87. TalkIQ\n公司网站：talkiq.com\n语音通话是企业最重要的数据流，占客户联系的68%，而电子邮件和聊天仅占21%。TalkIQ为企业语音通话开发了专有语音识别人工智能引擎，以帮助对这些重要数据进行分析。TalkIQ允许销售和客服团队首次以科学的方法来了解和优化其工作流程中的关键部分，包括识别购买意图、对反对意见的处理、对竞争对手的反应，以及建立融洽关系等。\n88. Talla\n公司网站：talla.com\nTalla允许企业将一个聊天平台变成一个指挥中心，该公司将消息传递系统(如Slack)中管理信息工作流所需的工具、流程和智能自动化结合起来，从而在聊天中启动业务流程，如招聘员工、新技能培训、投票、构建自定义体验等。Talla创建于2015年，总部位于马萨诸塞州剑桥市。\n89. Tamr Inc.\n公司网站：tamr.com\nTamr是一家整合不同数据源并帮助企业理解分析数据的大数据初创企业，利用算法在不同来源的数据库中搜索想要的数据。Tamr对企业所有的数据源建立一个集中目录，然后进行统一的数据展示和管理。这种做法可以令企业对自己的数据有一个全面的掌握，并能有效防止数据泄露。Tamr创建于2015年，总部位于马萨诸塞州剑桥市。2015年6月，Tamr在B轮融资中获得2520万美元投资。\n91. Trifacta\n公司网站：trifacta.com\nTrifacta创建于2012年，是一家提供数据分析解决方案的创业公司。Trifacta利用人机交互技术、可扩展的数据管理和机器学习技术，让用户轻松地将原始的复杂数据转换为结构化数据以进行分析，从而提高现有分析过程的效率。\n90. Textio\n公司网站：textio.com\nTextio能在文章发表前预测出用户所撰写文章的质量及表现，从而让用户的文章做到最好。Trifacta的预测引擎技术将机器学习和自然语言处理相结合，提供招聘、写作评分等应用的解决方案。Textio成立于2014年秋，由微软和亚马逊的两名前员工创建。2015年12月，Textio在A轮融资中获得800万美元投资。\n92. twoXAR\n公司网站：twoxar.com\ntwoXAR一家软件驱动的药物发现公司，利用其计算平台来确定有希望的候选药物，从而在临床研究前降低风险，并通过行业合作将候选药物推广到临床。该平台迄今已经与多家医院合作，被应用于80多种疾病。twoXAR创建于2014年，总部位于加州帕洛阿尔托(Palo Alto)。\n93. 深圳优必选(Ubtech)\n公司网站：ubtrobot.com\n优必选是一家集人工智能和人形机器人研发、平台软件开发运用及产品销售为一体的全球性高科技企业，它是中国第一家将人形机器人商业化的公司。2016年成功推出Jimu机器人品牌，并成功入驻全球部分AppleStore零售店。公司估值已经超过10亿美元，成为机器人领域的“独角兽”。优必选总部位于中国深圳。\n94. Verdigris\n公司网站：verdigris.co\nVerdigris是一个人工智能和物联网平台，致力于让建筑物更智能，同时降低能耗成本。通过结合专属硬件传感器、机器学习和软件，Verdigris能够“学习”建筑物的能源模式。 其软件能生成综合报告，包括能源预测、障设备报警和维护提醒等。\n95. Vicarious Systems\n公司网站：vicarious.com\nVicarious是一家人工智能研究公司，基于大脑计算原理来开发软件，让这些软件能像人一样思考和学习。利用一种名为“Recursive Cortical Network”新算法，Vicarious开发出了一套视觉感知系统，能够像人脑一样解释图片和视频中的内容。Vicarious的技术在机器人、医学图像分析、图像和视频搜索等领域拥有广阔的应用空间。\n96. Voyager Labs\n公司网站：voyagerlabs.co\nVoyager Labs的技术能实时分析来自己世界各地的数十亿个数据点，以了解和预测人类和群体的行为，并提出实时可行的建议 。Voyager Labs创建于2012年，在纽约、华盛顿和伦敦设有办公室，研发中心位于以色列，公司目前拥有90多名员工。\n97. x.ai\n公司网站：x.ai\nx.ai是一款人工智能个人助理，可以为你安排会议。 无需登录、密码或下载，只需要把相关内容抄送给amy@x.ai即可。接下来，x.ai就接管了繁琐的电子邮件安排会议。x.ai创建于2014年，总部位于纽约，投资者包括IA Ventures、irstmark、Two Sigma Ventures、软银、DCM和普利兹克集团(Pritzker)。\n98. Zebra Medical Vision\n公司网站：Zebra-med.com\nZebra Medical Vision正在建立一个医学成像平台，该提供了一个提供基于云、完全托管的研发环境，包括获取大量的结构化数据集、去标识研究、存储、GPU计算能力，以及一系列研究工具的支持。2015年，Zebra Medical Vision获得由Khosla Ventures领投的800万美元投资。\n99. Zoox\n公司网站：www.zoox.com\nZoox是一家机器人公司，目前正在开发全自动驾驶汽车，并打造让该技术走向市场所需要的支持生态系统。Zoox曾展示过一款运动型概念车，这款车没有挡风玻璃，可以朝两头行驶，乘客在车内像在火车上一样相对而坐。Zoox还曾表示，准备用无人驾驶汽车来提供类似于Uber的打车服务。\nZoox员工主要来自谷歌、苹果和特斯拉，已获得AID Partners Capital 2000万美元投资。\n100. Zymergen\n公司网站：zymergen.com\nZymergen是一家合成生物科技初创公司，创建于2013年。该公司致力于利用机器学习技术找出微生物内部可能导致所需结果的基因组，例如能产生某种蛋白质的基因组。该方法旨在取代目前基于容错的实验方法，而且有可能生成更多的有效微生物。2016年10月，Zymergen宣布在B轮融资中获得1.3亿美元投资。该轮融资由软银领投，参投方包括DCVC、True Ventures和AME Cloud Ventures等。(编译/谭燃)"}
