{"content2":"计算机视觉在交通领域主要有如下几个方面的应用：第一个是感知，既车辆的检测，第二个是车辆身份的识别，第三是车辆身份的比对，第四个是车辆的行为分析，第五个是驾控，也就是现在非常火的汽车辅助驾驶与无人驾驶。\n车辆检测与感知\n检测就是计算机通过图片或者视频，把其中的车辆或其它关注目标准确的“框”出来，检测是很多系统的基础。在2012年以前，很多智能交通系统中用的检测是一种基于运动的检测，这种检测会受天气、光线等方面的影响，在不同天气下会存在很多问题。而基于深度学习的检测，是基于车辆的轮廓和形态的检测，是完全模拟人看车的方式，只要人眼可以辨识那是一辆车，就可以“框”出来，这个就可以解决很多过去车辆检测中存在的问题，排除了天气光线等来带的干扰。\n路口的感知\n目前的国内很多城市交通拥堵情况很严重，很多十字路口的红绿灯配时其实并不是最优的，通过基于深度学习的车辆精确感知检测，可以精准的感知交通路口各个方向的车辆数量、流量和密度，从而可以给交通路口的最优配时提供准确依据。如果各个路口都用上这种车辆检测技术，那对交通拥堵将是极大的缓解。\n路段的感知\n经过过去几年的建设，我国的大中型城市都安装了很多监控摄像头，通过路段的感知，可以基于原有监控系统获取到道路的总体交通路况，通过这种车辆检测技术就可以为道路路况分析、交通大数据、交通规划等提供可靠的数据依据。\n路侧停车的感知\n有两个方面的应用，一个是路侧违法停车的感知和抓拍，不再需要摄像机去轮询检测，大大提高了摄像机的使用寿命。另外一个就是路侧停车位的管理，之前的方案在外场要感知车位是否被占用，一般通过地磁感知，成本非常高，系统可靠性也是问题；基于图像的识别则可以很好的解决这个问题，一台摄像机即可监控和感知一大片区域的停车位是否被占用，成本低还所见即所得。\n停车场的感知\n现在室内停车场应用图像识别实现车位检测的已经比较多了，但是现在很多车的检测都是基于车牌，有车牌就可以检测出来，没车牌检测不出来，甚至有的车牌效果不太好也无法检测。而基于深度学习的车辆检测，只看车辆的轮廓，不看车牌，只要看起来像个车的，就可以检测出来，而且精度很高。现在通过计算机视觉技术，可以做到模拟人的视觉感知，哪个地方有车停，哪个地方是空位，直接检测出来把数据发送给平台，发布到停车场诱导系统上。\n车辆身份特征识别\n计算机视觉用于智能交通的第二个大的应用领域就是车辆的身份识别。目前，常用的ETC和电子标签技术识别车辆确实非常可靠，而且精度还是比图像识别要高一些。但是现实中还存在很多现实问题，比如说现在很多大货车无法用ETC，还有ETC系统遭到破坏，怎么办？而电子标签真正落地还需要时间。在这个时间窗口，如何实现车辆身份特征的唯一性识别？通过深度学习提升的车辆识别不仅仅是车辆的车牌识别准确率，还能实现更多维度的识别，现在的“车脸识别”技术不仅能精确识别车牌，还有车辆的颜色、类型、品牌年款、车辆里人物、车辆挡风玻璃上的特殊标志以及车辆尾部的特征标志等。\n车辆的比对\n计算机视觉用于智能交通的第三个大的应用领域就是车辆的比对，最典型的应用就是以图搜图，如何在海量图片里精准的找到一辆车，所谓世界上没有两片相同的树叶，也没有两辆完全一样的车。如下图，看着像是一样的，但是仔细区分，还是会发现不同。\n基于视图大数据的以图搜图功能，可以在海量图片里找到一辆特定的车，不管有没有号牌，这里还包括一些其它的功能，如套牌车分析等等，套牌车在以前，唯一的方法就是举报，但现在计算机可以通过两个车牌是完全一样的车，通过车型比对和车辆特征比对来鉴定是否套牌车。\n车辆比对的另外一个应用场景就是收费结算，目前车牌识别用在停车场的支付里，还有一些遗留问题，就是还存在无牌车、污牌车和套牌车，因而依然必须依赖人工参与。有没有一种办法可以减少或者是不让人工参与呢？车脸识别就可以解决这一问题，可以构建车辆多层多维度的特征，相当于得到一个车辆的肖像，然后通过特征比对去判断是否同一辆车。\n交通视频的分析应用\n计算机视觉应用在智能交通的第四个大的应用领域就是车辆的行为分析。\n第一个是交通事故及事件检测，基于连续视频可以分析车辆的行为，检测如车辆停车、逆行等行为，发现交通事故和交通拥堵进行报警。借助深度学习技术，能实现真正准确的交通事件检测系统，真正的帮交通运营部门提供准确及时的报警信息。\n第二个就是车辆违章抓拍，这些近几年在我国应用非常广泛，而且利用视频检测实现的非现场执法的种类越来越多，现在甚至连开车接打电话都可以识别抓拍，这些都得益于计算机视觉技术的快速进步。\n无人驾驶和汽车辅助驾驶\n最后要说的一个应用领域就是汽车驾控，就是当前非常热的无人驾驶和汽车辅助驾驶。其中非常重要的一个技术点就是图像识别，通过图像识别前方车辆、行人、障碍物、道路以及交通信号灯和交通标识，这项技术的落地应用将给人类带来前所未有的出行体验，重塑交通体系，并构建真正的智能交通时代。\n总结一下，计算机视觉技术过去5年内取得的成绩甚至是远远超过了之前的20年，得益于深度学习技术带来的巨大进步，计算机视觉的广泛应用，能够大大提升智能交通系统的感知精度与维度，让智能交通系统更加智慧。\n通过深度学习技术，未来能够让移动支付在智能交通系统中更加快速的落地，让无人驾驶的美好梦想变成现实，从而给全人类带来更加安全、便捷、舒适的出行体验。\n人工智能、大数据、云计算和物联网的未来发展值得重视，均为前沿产业，多智时代专注于人工智能和大数据的入门和科谱，在此为你推荐几篇优质好文：\n人工智能与计算机视觉\nhttp://www.duozhishidai.com/article-15129-1.html\n计算机视觉如何入门\nhttp://www.duozhishidai.com/article-8235-1.html\n计算机视觉领域内，必知的十个深度学习架构\nhttp://www.duozhishidai.com/article-861-1.html\n多智时代-\n人工智能\n和\n大数据\n学习入门网站|人工智能、大数据、\n物联网\n、\n云计算\n的学习交流网站"}
