{"content2":"都说教育要从娃娃抓起。学习新东西当然也要从基本概念抓起了，近两年，人工智能的真的是火遍大街小巷，不过，“人工智能”也不是一人独火，他还有两个形影不离的队友：“机器学习”与“深度学习”。这三个词如同天团组合一般，出现在各种地方，有时甚至互为化身。那么问题来了，人工智能、机器学习、深度学习三者到底是什么关系？它们之间有什么联系与区别呢？\n人工智能——为机器赋予人的智能\n1956年夏天，以麦卡锡(John McCarthy)、明斯基(Marvin Minsky)、罗切斯特(Nathaniel Rochester)和香农(Claude Shannon)等为首的一批年轻科学家相聚达特茅斯，共同研究和探讨用机器模拟智能的一系列有关问题（史称“达特茅斯会议”）。在那次会议上，“人工智能”一词被提出，也标志着“人工智能”这门新兴学科的正式诞生。这里面的科学家我只认识香农，附上帅照。\n当时的人工智能研究处于“推理期”，人们认为只要能赋予机器逻辑推理的能力，机器就会具有智能。当时的研究的确取得了一定的成果，比如证明了不少数学定理，部分定理的证明方式甚至比数学家的更为巧妙。\n然而，人类的智能不仅来源于逻辑推理能力，也来源于大量经验和知识。比方说假如我从未坐过飞机也从未给别人买过机票，当你问我明天飞北京的机票多少钱，我估计会懵逼，连查携程都不知道，从而显得不那么“智能”，但其实我的推理能力并没有掉线。从20世纪70年代开始，人工智能研究进入了“知识期”，人们希望在推理的基础上，把各领域的知识总结起来告诉机器，让它获得智能。当时大量的专家系统（具有大量的专门知识与经验的程序系统，可进行推理和判断，模拟人类专家的决策过程）问世，在很多应用领域取得了不少成果。\n但人们很快认识到，把知识总结起来教给机器是非常困难的（称为“知识工程瓶颈”），因为人类的知识实在太多，还得把这些知识写成机器能够理解的形式。如果我们能够只给机器一些相对原始的数据，然后让机器自己去进行学习，那该多好。所以从20世纪80年代开始，机器学习这一技术路线逐渐主导了人工智能的研究，直到现在。\n机器学习—— 一种实现人工智能的方法\n机器学习可以理解为机器从已知的经验数据（样本）中，通过某种特定的方法（算法），自己去寻找提炼（训练/学习）出一些规律（模型）；提炼出的规律就可以用来判断一些未知的事情（预测）。\n机器学习最基本的做法，是使用算法来解析数据、从中学习，然后对真实世界中的事件做出决策和预测。与传统的为解决特定任务、硬编码的软件程序不同，机器学习是用大量的数据来“训练”，通过各种算法从数据中学习如何完成任务。\n比如我们接触了1w只单身汪（已知样本），通过归纳总结与比较（算法）找出TA们身上一些共性特点，然后将这些共性特点作为判断单身汪的依据（模型），那么下次遇到一个人（未知样本），就可以判断TA是不是单身了（预测）。\n既然是从一堆已知的样本中找规律，那么找规律的方式以及找出的规律的形态就会因人而异，也就是算法与模型都可能会有所不同。所以，机器学习本身也是分为不同流派的，每种流派都有它代表性的模型与算法。机器学习主要分为符号主义学习（以决策树模型与相关算法为代表）、连接主义学习（以神经网络模型与相关算法为代表）与统计学习（以支持向量机与相关算法为代表）。符号主义学习与连接主义学习在20世纪80年代至90年代中期非常流行，统计学习则从90年代中期开始迅速占据舞台。值得一提的是，为判断一个人是否为单身汪而找出的一系列特征规律其实就是一棵决策树。\n任何通过数据训练的学习算法的相关研究都属于机器学习，包括很多已经发展多年的技术，比如线性回归（Linear Regression）、K均值（K-means，基于原型的目标函数聚类方法）、决策树（Decision Trees，运用概率分析的一种图解法）、随机森林（Random Forest，运用概率分析的一种图解法）、PCA（Principal Component Analysis，主成分分析）、SVM（Support Vector Machine，支持向量机）以及ANN（Artificial Neural Networks，人工神经网络）。\n深度学习——一种实现机器学习的技术\n进入21世纪之后，互联网与移动互联网的兴起造成了数据量的爆发式增长，云计算也使得计算能力大幅增强，同时神经网络的相关算法也逐渐成熟，所以导致连接主义的代表——神经网络卷土重来。再次归来的神经网络，往往拥有比原先更为庞大的网络层级结构，所以被称为“深度神经网络”。由于有足够的训练数据和计算能力，深度神经网络在很多（尤其是语音处理、自然语言处理、图像处理等较为复杂的）任务中取得了非常优异的性能。性能的突破促成了人工智能在语音识别、文本翻译、人脸识别等一系列场景的应用，让大家看到了新技术落地所带来的经济效益与想象空间，从而引起了人工智能的热潮。\n说了这么多，下面用一幅图来说明人工智能的技术流派类别与演变历程。要注意的是，虽然人工智能的流派在不断演变，但这并非说明过去的技术路线就被抛弃了。这更像是以实际应用为导向的各领风骚——在一个时代，某种技术流派正好能够较好地解决这个时代所需要去解决的实际产业问题，那么自然就会流行。目前有很多不同的机器学习技术正应用于各自适合的场景，比如作为统计学习代表的支持向量机，仍然是文本分类任务的首选技术。\n三大巨星的成长史\n故事的结尾\n人工智能是一个大的概念，是研究如何使机器获得智能的学科；机器学习是人工智能中的一个技术流派，通过从已知样本中提炼规律来获得判断未知样本的“智能”；深度学习则是机器学习的一种，它所学习出来的模型是深度神经网络。深度学习使得机器学习能够实现众多的应用，并拓展了人工智能的领域范围。"}
