{"content2":"科幻中关于A.I.的纠结A.I. =artificial intelligence人工智能那位发现了相对论的科学家曾说:想象力是比知识更重要的东西，知识是有限的，而想象力概括着世界的一切，推动着进步，并且是知识进化的源泉。严格地说，想象力并不是虚空的，它是科学研究中的实在因素。在电影艺术中，想象力与科技可以集合，无疆界的思维用现实科学手段作出表达，产生的科幻电影成为一面折射科技与社会文化的镜子。“在科学技术的力量到达之前，我们已经到达了那些世界。”这就是科幻的真实含义。它符合现在绝不可能，兼未来一定要有可能这两个基本条件。若是现在已有可能，则见不到想象力的成分；而假如未来亦无可能，那就代表该构思已抵触了既有的科学。平民版人工智能人工智能（AI）技术是科幻类作品中一个备受青睐的题材。可以发现，科幻电影里机器人的出境率几乎是最高的，主角、龙套、最大幕后黑手，其都能胜任。如果说要把人工智能的发展历程归纳出一部正史，那描述机器人的科幻电影就可以撰成一篇小传。1956年，一群科学家聚集达特茅斯学院，讨论着对于当时的世人而言完全陌生的话题。这就是被称为人工智能起点的“达特茅斯会议”。从那以后，研究者们发展了众多理论和原理，人工智能这一极富挑战性的概念也随之在文学和电影中扩展，与它相关的内容，涉及了计算机知识、心理学和哲学。2008年的屏幕上，最可爱的就是机器人WALL-E和他的女朋友，功能上来看WALL-E有点像升级版的智能型吸尘器，他的女友只能归于反恐武器一类，但这不是关键的，他们和电影《星球大战》中的C-3PO、R2-D2一样，拥有忠诚、友谊、爱慕等感情，和诸如神经质、面冷心善、“宅”等小性格，以及琐碎的生活细节，和并非由程序设定产生的理念。美式电影提倡的平民英雄，让机器人世界里的高大全形象也不再受欢迎。   就和人类的相似度来讲，电影《人工智能》中机器人动作外形达到了已臻化境的程度。在日本，这个全世界机器人工业最为发达的国家之一，目前较先进水平是今年3月份诞生的黑发美女HRP-4C，其面部的8个发动机赋予“她”愤怒、惊讶等表情，体内的30个发动机则能让“她”姿态诡异的走上几步台步。此前，汽车制造商本田公司已经研制出能够行走和讲话的机器人“阿西莫”，但这款机器人并不是人类的样子。至于情感个性层面，《人工智能》中机器人的灵魂与人类几无差别，影片也就此将更多的注意力都放在伦理探讨上。影片《WALL-E》诞生的同一年，欧盟启动了一个研究项目，包括英国伦敦大学在内的欧洲10所大学的专家计划合作开发出世界上第一批有性格的机器人，旨在实现机器人与人类的长期交流与互动，就像人与人之间一样。但即便是更深层次地发掘人机交互，短期内技术只能停留于让机器人拥有一种类似人的性格上，通过设置某种特殊的电脑程序使机器人能学会主人的情感、喜好等，增进人类对机器人的信赖度。那么科幻电影里的人工智能何时来到我们身边呢？它还是他？起初人工智能被界定为“让机器的行为看起来就像是人所表现出的智能行为一样”。但在今天，如要考虑人工智能的实现程度，需要更为精准地用强人工智能和弱人工智能来划分。强人工智能观点认为计算机不仅是用来研究人的思维的一种工具，相反，只要运行适当的程序，计算机本身就是有思维的，这样的机器将被认为是有知觉的，有自我意识的，这更像我们在科幻电影中见到的那些家伙们。弱人工智能也并不是“弱智”，其与强人工智能不对立，只是认为不可能制造出能真正进行推理和解决问题的智能机器，这些机器看起来只不过像是智能的但并不真正拥有自主意识的工具而已。然而，主流的研究正是围绕“工具”而进行的，且成就可观；强人工智能则处于停滞不前的状态，首先关于概念的争论就一直未平息：如果一台机器，唯一工作原理就是对编码数据进行转换，那么这台机器能算是有思维的智能吗？可是，人类又怎样去确定其他个体是否像我们一样是智能的呢？“它”或“他”可能只是表现得像拥有智能或不像，做出判断完全靠人类主观的定论，既然弱人工智能可以令机器看起来像是智能的，那么能完全否定这台机器有智能吗？拿HAL9000来说，它曾被评为最恶劣电影机器人之终极第一名。在影片《2001太空漫游》中，HAL9000是人类科技文明发展的顶端，号称零缺陷（观众意外发现H、A、L各自后一位字母是I、B、M）。HAL9000能够表现出情感，这是因为人类的设计，但是到底它是否具有情感，没有人知道。为了完成任务抑或有预谋地铺设陷阱，HAL9000让数位船员失去了生命，机器做出的表象仍旧是人类控制着所谓的工具，但在深层次的地方，工具已经成为未知。问题已经向哲学方向发展了。而基于人工智能研制的目的，如果希望产生一台能够自行思考的机器人，那就必须了解什么是思考，以及什么是智慧。现有的技术可以令机器模仿人类身体相当多器官的功能，但模仿人类大脑却难如登天，到目前为止，人类仅知道它是由数十亿个神经细胞组成的器官，对于它产生智慧的模式还知之甚少。人工智能，“它”似乎还不是“他”。我们，机器人在德国1926年推出的《大都会》中，机器人在其中充当了劳资矛盾的催生物，虽然故事略嫌肤浅，但其以视觉风格而不是以内涵深度取胜，仍堪称世界科幻影坛的先驱。本片亦诞生了第一个人类与机器人共同生活的构想，而根据“科幻”的含义，既然不违背既有科学理论，就不能阻挡在其后电影导演的脑内人类已面临人机大战的威胁。从机器人的发展历程可以看到，随着整合控制论、机械电子、信息技术、材料学和仿生学的发展，机器人的性能得到不断提高，其应用也越来越广泛。从理论上讲，按照这样发展下去，机器人最终会广泛替代人的劳动。但这一天的到来必须在人类控制范围内，否则仅是战斗型机器人就将是人类的噩梦，更勿论可自行思考的机器人。探讨人类生存危机的影片《我，机器人》改编自科幻小说家阿西莫夫的作品，根据机器人三大定律的逻辑推演而来。早在1940年，阿西莫夫提出了著名的“机器人三定律”，规定所有机器人程序上必须遵守:机器人三定律虽然只是科幻小说里的创造，但后来已成为世所默认的机器人研发原则。然而很多人指出，“三定律”更类似是一种技术上的保证，而非逻辑上的，从人工智能的设想可以知道，机器人具有修改自身程序或者说自我学习的可能性；而携带武器可直接攻击人类的军用机器人的出现，也是对“三定律”的一种颠覆。正如《我，机器人》所表达的含义：机器人并没有问题，技术也不是问题，人类逻辑的局限才是最大的问题。据英国《新科学家》杂志报道，2008年谢菲尔德大学科学家诺埃尔·夏基拟定了一份“机器人大战”的前景和带来忧虑的文稿。其内容披露美国在伊拉克已经部署了4000多个半自动机器人。美国国防部在曾经发表的《无人系统路线图》中建议，到2010年前耗资40亿美元研制机器人武器。此外，一些欧洲国家以及加拿大、韩国、南非、新加坡和以色列等国也在开发军用机器人技术。在文稿最后，科学家不无忧虑地表示，机器人今后很可能将自己决定何时“扣动扳机”，而“机器人对于为什么要这样做没有判断能力”。在对这一点的认识上，电影人和人工智能专家一样清醒。已故台湾电影导演杨德昌生前曾说过，当数字科技在做人原本做的事情时，其之后的产业扩展和萧条的方式都不是线性的，也因为数字工具的效能，很多方法不能再用传统方法去看。当人类的功能被取代的时候，其中产生的能量，亦不是我们人类可以想象的。邢利栋"}
