{"content2":"人工智能在医疗领域究竟要怎么玩？\nhttp://news.hc3i.cn/art/201708/40125.htm\n2017-08-14 15:04\n作者:石晨露\n来源：中国数字医疗网\n7月20日，国务院发布《新一代人工智能发展规划》，明确人工智能作为未来国家重要的发展战略，将人工智能再次送上发展快车道。同时，更大胆预测人工智能核心产业的规模将在三年内超过1500亿元，到2030年超过1万亿元。由中国医学装备协会数字医疗技术分会、HC3i中国数字医疗网、无界进修主办的2017中国医学装备协会数字医疗分会年会暨“互联网与新医疗”高峰学术交流会期间，相关行业专家及企业领导以“医疗人工智能，云计算的机遇与挑战”为主题进行了圆桌讨论，场面十分激烈。\n产业链如何看待人工智能和云计算？\n本次讨论对话环节，邀请到上海瑞金医院副院长胡伟国，中国医学装备协会数字医疗分会副会长、南京军区福州总医院陈金雄，金沙江创投董事总经理丁健，北京市医师协会副会长许朔，荣之联医疗事业部技术总监田鑫辉，埃森哲医疗事业部总监李信仪，生命奇点联合创始人、首席科学官佟崴嵬，百度研究院大数据实验室高级产品经理王涛等各个不同领域的相关行业专家。不论从学术研究，还是从应用实践，甚至是投资方面，人工智能和云计算到底面临怎样的机遇和挑战，嘉宾各抒己见，分享了自身的看法和经验。中国医学装备协会数字医疗分会副会长、中山大学医学院计算机中心/产学研合作处周毅主持本次讨论对话环节。\n一、医院视角\n作为一名临床医生，上海瑞金医院副院长胡伟国表示，信息化产业跟医疗的合作可以分为三个阶段：第一，数字医疗。将医院所有的临床资料进行数字化运转，以及现在各类数字化产品的发展；第二，智慧医疗。医院临床数据资料进行数字化之后，进行互联互通建设；第三，认知医疗。就像如今的沃森，沃森毕竟是美国的医生，那么如何进行汉化，绝不仅仅只是文字上的汉化，以及将文献统一等等。胡伟国强调，未来人工智能也好，智慧医疗也罢，认知医疗是未来的一个发展趋势，如何将人工智能作为医生决策的辅助，这是非常重要的。\n同样作为医院的代表，来自中国医学装备协会数字医疗分会副会长、南京军区福州总医院的陈金雄则从宏观和微观角度分享了对于人工智能的看法。宏观层面来说，中国医疗最大的问题就是资源不够，依靠目前的生产方式是无法解决医疗问题的，而是需要借助“互联网+智能医疗”解决。微观层面来说，我们既要仰望星空，更要脚踏实地，踏踏实实把小数据做好，同时做到数据共享、信息共享，为人工智能发展增添更多的燃料。\n二、投资视角\n年被称为人工智能发展元年，作为投资人，自然已经嗅到人工智能市场的“躁动”。投资人如何看待人工智能在医疗行业的发展？更青睐于投资哪些项目？不妨从金沙江创投董事总经理丁健的分享中得到答案。\n丁健表示，目前大家都在用人工智能做大数据处理、自然语言处理（NLP）。丁健认为，虽然自然语言处理在人工智能领域看上去很简单，但是实际上是有误导性的，语音识别和自然语言处理有着本质区别，语音识别只是说，而自然语言处理的真正最高境界是要理解字的含义。对于这方面的投资，目前资方还是处于观望状态，但是对于图像领域比较看好，而且随着数据量的增加，特别是高质量、标签数据的增加，深度学习在这个角度上会有更高的突破。\n与此同时，医疗行业目前最核心的问题在于关于数据的共享和数据的数据化问题。其实不仅仅是医疗界，很多行业都是如此，都觉得大数据是块宝，拼命将自己的数据保护起来。对此，丁健这样比喻到，大数据更像是武功秘籍，每人拿一页根本做不成事情，只有将武功秘籍拼凑在一起，才能发挥它的功效。随着人工智能的发展，特别是深度学习方面，对于数据的质量和完整性将会提出更高的要求，所以数据的共享十分重要。\n三、协会视角\n“众所周知，临床最重要的就是患者安全，只要能够保证安全，医疗互联网也好，人工智能也好，都会发展得很好。”北京医师协会副会长许朔这样说道。那么如何做到保障患者安全，第一要积极，第二要规范。\n许朔表示，人工智能的确改变了人们的生活、就医行为等各方面，同时人工智能对于行业的冲击也是大范围的，任何行业都无法避免。许朔还用两个实例分享了人工智能和大数据在临床的应用，不论是在硅谷考察大大小小的公司，看到很小的沃顿商学院的公司在做临床急救方面的事情，还是旧金山的未来诊所快速进行患者诊断，这些都为我们提供了很好的借鉴。人工智能已经把医疗做成了一个围城，那么怎么突出重围，值得每一个医疗工作者思考。\n四、技术视角\n人工智能的发展，离不开底层技术的支持。荣之联医疗事业部技术总监田鑫辉从技术视角分享了人工智能在医疗行业的发展趋势。包括文字结构化处理、可穿戴设备，甚至包括移动医疗等等这些方面，人工智能的应用都十分广泛，但是这些仅仅只是上层的应用，必须需要底层强大的数据支持。因为采集的数据量的多少以及准确度都会对最终结果产生重大影响。田鑫辉表示，由于这个行业的特殊性，数据的采集要求十分高，这将是一个不断精细化的过程，除了数据共享，区域型数据中心建立、信息标准建立，以及数据的安全性等方面，都是未来真正迈向人工智能时代，需要做的关键工作。\n未来医院真的不需要医生？\n未来医院是否真的不需要医生？胡伟国这样解释道：爱迪生预言没有人使用交流电，比尔盖茨认为16K对人是足够的，如今这些猜想都是错误的，马云所预言的未来医院不需要医生，同样是错误的，为什么？因为医生除了医技、医能以外还有人文关怀，这是对于患者来说不可或缺的人对人的关怀，所以从人文角度来讲，马云的预言是错误的。与此同时，陈金雄用赋能、部分取代、转型三个词表达了自己的看法。\n同样，作为企业方，埃森哲医疗事业部总监李信仪也认为从智能技术和医生合作来看，人工智能是不可能取代医生的，只能是以一种辅助工具的形式帮助医生。\n生命奇点、百度等众多的企业都在布局人工智能，希望可以通过人工智能、云计算技术给医疗行业的发展带来更大的颠覆，但是颠覆更多的理解是创新，用一种新的方式革新整个医疗行业，最终实现全民健康的目标，这也是每一位医疗人始终践行的宗旨！"}
