{"content2":"计算机视觉、机器学习、自然语言处理、机器人和语音识别是人工智能的五大核心技术，它们均会成为独立的子产业。\n计算机视觉\n计算机视觉是指计算机从图像中识别出物体、场景和活动的能力。计算机视觉技术运用由图像处理操作及其他技术所组成的序列，来将图像分析任务分解为便于管理的小块任务。比如，一些技术能够从图像中检测到物体的边缘及纹理，分类技术可被用作确定识别到的特征是否能够代表系统已知的一类物体。\n计算机视觉有着广泛的应用，其中包括：医疗成像分析被用来提高疾病预测、诊断和治疗；人脸识别被Facebook用来自动识别照片里的人物；在安防及监控领域被用来指认嫌疑人；在购物方面，消费者现在可以用智能手机拍摄下产品以获得更多购买选择。\n机器视觉作为相关学科，泛指在工业自动化领域的视觉应用。在这些应用里，计算机在高度受限的工厂环境里识别诸如生产零件一类的物体，因此相对于寻求在非受限环境里操作的计算机视觉来说目标更为简单。计算机视觉是一个正在进行中的研究，而机器视觉则是“已经解决的问题”，是系统工程方面的课题而非研究层面的课题。因为应用范围的持续扩大，某些计算机视觉领域的初创公司自2011年起已经吸引了数亿美元的风投资本。\n机器学习\n机器学习指的是计算机系统无须遵照显式的程序指令，而只依靠数据来提升自身性能的能力。其核心在于，机器学习是从数据中自动发现模式，模式一旦被发现便可用于预测。比如，给予机器学习系统一个关于交易时间、商家、地点、价格及交易是否正当等信用卡交易信息的数据库，系统就会学习到可用来预测信用卡欺诈的模式。处理的交易数据越多，预测就会越准确。\n机器学习的应用范围非常广泛，针对那些产生庞大数据的活动，它几乎拥有改进一切性能的潜力。除了欺诈甄别之外，这些活动还包括销售预测、库存管理、石油和天然气勘探，以及公共卫生等。机器学习技术在其他的认知技术领域也扮演着重要角色，比如计算机视觉，它能在海量图像中通过不断训练和改进视觉模型来提高其识别对象的能力。\n现如今，机器学习已经成为认知技术中最炙手可热的研究领域之一，在2011~2014年这段时间内就已吸引了近10亿美元的风险投资。谷歌也在2014年斥资4亿美元收购Deepmind这家研究机器学习技术的公司。\n自然语言处理\n自然语言处理是指计算机拥有的人类般的文本处理的能力。比如，从文本中提取意义，甚至从那些可读的、风格自然、语法正确的文本中自主解读出含义。一个自然语言处理系统并不了解人类处理文本的方式，但是它却可以用非常复杂与成熟的手段巧妙处理文本。例如，自动识别一份文档中所有被提及的人与地点；识别文档的核心议题；在一堆仅人类可读的合同中，将各种条款与条件提取出来并制作成表。以上这些任务通过传统的文本处理软件根本不可能完成，后者仅针对简单的文本匹配与模式就能进行操作。\n自然语言处理像计算机视觉技术一样，将各种有助于实现目标的多种技术进行了融合。建立语言模型来预测语言表达的概率分布，举例来说，就是某一串给定字符或单词表达某一特定语义的最大可能性。选定的特征可以和文中的某些元素结合来识别一段文字，通过识别这些元素可以把某类文字同其他文字区别开来，比如垃圾邮件同正常邮件。以机器学习为驱动的分类方法将成为筛选的标准，用来决定一封邮件是否属于垃圾邮件。\n因为语境对于理解“timeflies”（时光飞逝）和“fruitflies”（果蝇）的区别是如此重要，所以自然语言处理技术的实际应用领域相对较窄，这些领域包括分析顾客对某项特定产品和服务的反馈，自动发现民事诉讼或政府调查中的某些含义，自动书写诸如企业营收和体育运动的公式化范文，等等。\n机器人\n将机器视觉、自动规划等认知技术整合至极小却高性能的传感器、制动器以及设计巧妙的硬件中，这就催生了新一代的机器人，它有能力与人类一起工作，能在各种未知环境中灵活处理不同的任务。例如，无人机、可以在车间为人类分担工作的“cobots”等。\n语音识别\n语音识别主要是关注自动且准确地转录人类的语音技术。该技术必须面对一些与自然语言处理类似的问题，在不同口音的处理、背景噪声、区分同音异形/异义词（“buy”和“by”听起来是一样的）方面存在一些困难，同时还需要具有跟上正常语速的工作速度。语音识别系统使用一些与自然语言处理系统相同的技术，再辅以其他技术，比如描述声音和其出现在特定序列与语言中概率的声学模型等。语音识别的主要应用包括医疗听写、语音书写、电脑系统声控、电话客服等。比如Domino抯Pizza，最近推出了一个允许用户通过语音下单的移动APP。\n上述5项技术的产业化，是人工智能产业化的要素。人工智能将是一个万亿级的市场，甚至是10万亿级的市场，将会为我们带来一些全新且容量巨大的子产业，比如机器人、智能传感器、可穿戴设备等，其中最令人期待的是机器人子产业。\n机器人应用的分法有很多种，从应用层面可以粗略地分为以下几个类别。第一个类别是工业级机器人，像富士康这种公司已经运用得很好了，因为劳工成本越来越高，用工风险越来越高，而机器人则可以解决这些问题。第二个类别是监护级机器人，它可以在家里和医院里作为病人、老人或孩子的护理，帮助他们做一定复杂程度的事情。中国对监护级机器人需求其实更迫切一些，因为中国人口红利在下降，同时老龄化又不断地上升，这两个矛盾，机器人都可以帮助解决。因此，这个领域的需求在民用市场占比很大。第三个类别就是探险级机器人，用来采矿或者探险等，大大避免了人所要经历的危险。此外还有用来打仗的军事机器人等。\n网络媒体Business Insider预测，机器人将在许多岗位上取替人类：电话营销员、校对员、手工裁缝师、数学家、保险核保人、钟表修理师、货运代理商、报税员、图像处理人员、银行开户员、图书馆员、打字员等。因为它们的价格竞争力惊人。麦肯锡全球研究院的研究表明，当中国制造业工资每年增长10%~20%时，全球机器人的价格每年下调10%，一台最便宜的低阶机器人只需花费美国人年平均工资的一半。国际研究机构顾能预测：2020年机器人将导致全球新一波失业潮。\n同时，人工智能技术的发展还将让许多旧产业获得改头换面式的新生，其中最典型的是汽车产业。汽车产业已存在上百年了，其间的变革也是非常大的，但驾驶汽车的始终是人，可最近几年，随着谷歌等公司的大力投入，机器或者说某种自动化的系统已经有望取代人来驾驶汽车，从而形成一个市场容量巨大的新产业，即无人驾驶汽车产业。这个产业的规模也将是万亿级甚至是10万亿级的。而且，这个产业还将与新能源产业叠加、融合在一起，形成“车联网＋能联网＋互联网＋电动汽车”的复合产业——未来，我们会把插电式汽车和氢燃料汽车作为发电厂使用，从而使新能源汽车成为电网的一部分，成为新能源的供给者，与现在一些装有太阳能发电系统的房屋是太阳能的供给者一样。\n毫无疑问，与互联网一样，智能技术会向几乎所有旧产业渗透。华泰证券在一份人工智能产业的研究报告中提及了九大行业：生活服务O2O、医疗、零售业、金融业、数字营销业、农业、工业、商业和在线教育。实际上，将获得新生的旧产业还有许多，如军事、传媒、家居、医疗健康业、生命科学、能源、公共部门……甚至包括受VR/AR（虚拟现实与增强现实）技术发展影响而产生的虚拟产业。"}
