{"content2":"1.什么是人工智能？\n在20世纪50年代，人工智能（Artificial Intelligence）作为计算机科学中一个分支学科就被提出和确立了，它企图了解智能的实质，并生产出一种新的能以人类智能相似的方式做出反应的智能机器，该领域的研究包括机器人、语言识别、图像识别、自然语言处理和专家系统等。AI发展的终极目标就是某种机器运行的逻辑程序可以表现出与人类等价或者无法分辨的智能；也就是机器有自己的思维，能够进行思考。从实用的角度，AI就是要让计算机系统能够自动完成那些需要依靠人类智慧才能完成的工作。\n人工智能早期的思路与方法主要是用一系列规范的、形式化的数学规则来表示人类总结的知识，通过自动化的程序代替人类处理问题。这也是一种演绎的方法，通过既有的规则去推理模拟。例如专家系统（Konwledge-based expert system），在某一领域擅长的专家，将其知识和经验转化为一条规则，再将该规则转换为程序进行问题的处理；但问题是无限可能的和规范的，而规则却是有限的和多变复杂的。因此，早期人工智能取得成功的领域，往往都是具有明确规则和条件的问题，换句话说，就是待解决问题的所有情况都是可以被穷举出来的。但实际的情况，往往是难易表达清晰，而规则则必须是清晰明确的，因此规则去描述多数的实际问题是不现实的。\n随着人工智能的发展，基于概率统计的机器学习（或者称为模式识别）开始成为人工智能的主流方法。机器学习将大量真实世界产生的数据中具有代表性的样本，交给程序，让算法在数据中寻找和学习规律，通过这种方式得到的规律就是我们需要输入的规则，这也是一种归纳的方法。机器学习也是有其一定的假设，它假设样本数据的概率分布与真实世界的概率分布相同，即从一定规模的数据中学习到的规则也适用于真实世界中的一般情况；由此我们也可以知道，根据大数定律，用于学习的样本规模越大，样本数据的概率分布越接近真实世界的概率分布，我们最后得到的规则的适用性越好。\n由此，我们可以知道无论是专家系统还是机器学习都是人工智能的一个方向，只是它们基于不同的思想！\n2.什么是机器学习？\n机器学习（Machine Learning）是人工智能发展到一定阶段的必然产物。二十世纪五十年代到七十年代初，人工智能研究一直处于“推理期”，那时人们认为只要赋予机器逻辑推理能力，机器就有智能。但是，人们逐渐发现由人把知识总结出来再教给计算机是相当困难的，一些学者想到如果机器能够自己学习知识该多好。于是，机器学习由此产生。机器学习主要研究的内容是关于在计算机上从数据中产生“模型”的算法，即学习算法，有了学习算法后，我们把经验数据提供给它，它就能基于这些数据产生模型，在面对新的情况或者数据时，模型会给我们提供相应的判断。机器学习根据训练的数据是否拥有标记信息，学习任务主要分为两个方向：监督学习（supervised learning）和无监督学习（unsupervised learning）。\n2.1监督学习：监督学习要求每个样本都有既定的标签，样本数据作为输入，标签作为目标输出，学习的目标是得到输入与输出之间的关系函数f(x)=y，即在输入一个样本后，通过学到的关系函数得到该样本的标签。此处拿朴素贝叶斯举例，朴素贝叶斯分类器的公式为：\n其中，ai为x的第i个属性值，概率P（c）和P（ai|c）为不同类标记和属性值组合的出现频率。下面给出具体实例将上面的公式进行应用，已知如下的数据：\nDay\nOutlook\nTemperature\nHumidity\nWind\nPlayTennis\n1\nSunny\nHot\nHigh\nWeak\nNo\n2\nSunny\nHot\nHigh\nStrong\nNo\n3\nOvercast\nHot\nHigh\nWeak\nYes\n4\nRain\nMild\nHigh\nWeak\nYes\n5\nRain\nCool\nNorma\nWeak\nYes\n6\nRain\nCool\nNorma\nStrong\nNo\n7\nOvercast\nCool\nNorma\nStrong\nYes\n8\nSunny\nMild\nHigh\nWeak\nNo\n9\nSunny\nCool\nNorma\nWeak\nYes\n10\nRain\nMild\nNorma\nWeak\nYes\n11\nSunny\nMild\nNorma\nStrong\nYes\n12\nOvercast\nMild\nHigh\nStrong\nYes\n13\nOvercast\nHot\nNormal\nWeak\nYes\n14\nRain\nMild\nHigh\nStrong\nNo\n现有一实例x:<outlook=sunny,temperature=cool,humidity=high,wind=strong>，那么playtennis=？\n分类主要分为下面两步骤（下面的公式没有经过拉普拉斯平滑）：\na、从已知的样本中学习规则：\n（1）p(yes)=9/14,p(sunny|yes)=2/9,p(cool|yes)=3/9,p(high|yes)=3/9,p(strong|yes)=3/9,\n（2）p(no)=5/14, p(sunny|no)=3/5,p(cool|no)=1/5,p(high|no)=4/5,p(strong|no)=3/5.\nb、分类：p(yes)p(sunny|yes)p(cool|yes)p(high|yes)p(strong|yes)=0.00529\np(no)p(sunny|no)p(cool|no)p(high|no)p(strong|no)=0.02057\n因此朴素贝叶斯将上实例分类为No。\n监督学习主要分为两种问题，回归和分类；两者的区别在于处理问题的连续性和离散性，回归的输出可以是任意实数，而分类的输出为一个类别，同时回归可以转换为分类，即概率最大的类别为分类的结果。\n2.2无监督学习：样本数据没有标签，学习的目标是探索样本数据之间是否含有隐含的不易被发现的关系，统计样本的分布情况。如K-means聚类算法，先确定该样本数据中包含的类别（标签）数量，然后再根据特征之间的距离进行聚类。机器学习的主要目标就是得到输入与输出之间的关系，这个关系的确定受我们确定的影响因素，即问题中的特征。设计一个合适的特征表示在机器学习中是一项及其重要却又非常困难的任务。一方面，特征的选取会直接影响预测的稳定性，要想得到准确的预测结果就必须选中相关性最高的特征；另一方面，如何设计特征又需要加入许多人类的先验经验才能完成，需要运用人类智慧和经验分析各种因素所带来的直接或间接的影响。所以通常的做法是首先列举出各种可能的特征，然后通过交叉组合的方式进行穷举验证，这也称为特征工程。特征工程是传统机器学习的最大束缚，不仅费时费力，还需要人工提供大量的先验经验以弥补数据本身挖掘不足的缺陷。\n3.什么是深度学习？\n深度学习（deep leaning feature leaning）是在人工神经网络基础上发展而来的一种表示学习方法。什么是人工神经网络呢？人工神经网络是机器学习中一种结构，它的定义为：由具有适应性的简单单元组成的广泛并行互联的网络，它的组织能够模拟生物神经系统对真实世界物体所做出的的交互反应。人工神经网络中最基本的成分是神经元模型，即上述所说的简单单元，神经元接受到来自n个其他神经元传递过来的输入信号，这些输入信号通过带权的连接进行传递，神经元接收到的总输入值将与神经元的阈值进行比较，然后经过“激活函数”处理以产生神经元的输出。把许多这样的神经元按照一定的层次结构连接起来就得到了人工神经网络。什么是表示学习呢？表示学习就是要让算法在少量人为先验经验的情况下，能够自动从数据中抽取合适的特征，完成原本需要通过特征工程才能得到的结果。表示学习最核心的诉求就是发现真正重要的特征，舍弃那些并不影响判断的因素。因此，深度学习与传统的机器学习的方法是有区别的，传统的机器学习：特征工程+可被训练的分类器；深度学习：特征工程被可训练的特征提取器所替代。深度学习是如何做到的呢？\n深度学习是通过构建一个多层的表示学习结构，使用一系列非线性变换操作把从原始数据中提取出的简单的特征进行整合，从而得到更高层更抽象的表示。换句话说，深度学习将一系列相对简单的非线性映射操作构建成一个多层网络，每一层都完成一次特征变换。如人脸识别，网络以像素表示的图像作为输入，在低层次中主要学习到代表图像边缘的特征，可能是连续几个像素所组成的某个方向上的线段；中级层次会学习到由边缘线段所组成的局部图案，这些图案实际是构成目标物体的各部件；高级层次以各种局部部件作为基本单元就可以组合出人脸的抽象表示。\n深度学习成功的基本要素：\n海量的训练数据\n非常灵活的模型\n足够的运算能力\n足够对抗维度灾难的先验经验\n我们一直在说深度学习，那么什么样的结构才算是有深度的呢？关键在于深度学习比传统的机器学习多了多级特征提取的结构，能够进行表示学习，这样才算是有深度。在了解人工神经网络之后我们可能会产生一个疑问，只要神经元足够多，构成一个很宽的网络，它可以拟合任何的函数，那为什么还要更深？其实主要是因为，在神经元数量相同的情况下，深层网络结构具有更大的容量，分层组合带来的是指数级的表达空间，能够组合成更多不同类型的子结构，这样更容易学习和表示各种特征。而且，层数的增加意味着激活函数带来的非线性变换的嵌套层数更多，就能构造更复杂的映射关系。\n总结：\n三者的关系：\n\n参考资料\n1.周志华  《机器学习》\n2.王琛，等  《深度学习原理与TensorFlow实践》"}
