{"content2":"一、目标：C++/python研发岗  算法岗二、公司、岗位总结公司名称地点岗位实习要求职位描述岗位要求转正机会星环信息科技上海分布式存储3天/周，4个月以上1. 负责星环分布式存储系统的设计，开发与运维工作；2. 负责实现分布式存储系统的解决方案，架构设计和关键特性；3. 负责构建高并发、高吞吐、低延时的数据存储服务。1. 本科及以上学历，计算机/软件工程相关专业；2. 熟练掌握Java、Scala、C++中的一种或多种；3. 有良好的数据结构和算法基础；4. 积极主动，有良好的解决问题能力；5. 熟练使用Linux；6. 有HDFS、HBase、MongoDB、Cassandra、ElasticSearch等分布式系统的开发或运维经验者优先；7. 熟悉MySql、PostgreSQL等数据库者优先。有字节跳动北京C++4天/周，3个月以上1、负责2D/3D特效制作工具开发 2、根据开发规范与流程完成模块的设计、编码、测试以及编写相关文档 3、跟踪业界的最新产品，打磨产品体验1、熟练掌握C++，数据结构和算法 2、熟悉Objective-C、QT、Windows开发优先 3、熟练掌握各种设计工具、方法，编码功底扎实 4、有较好的产品意识，具有良好的分析和解决问题能力中标软件北京C++4天/周，3个月以上1、办公软件新功能开发；2、办公软件兼容性问题修复；3、办公软件性能优化相关工作；4、外部项目的其它相关事项；5、配合产品组制定研发需求与规划；6、其它组长分配的办公软件研发相关任务；1. 熟悉办公软件的基本功能使用；2. 具有较为扎实的C++基础，熟悉常用的数据结构和算法，熟悉常见的设计模式；3. 具备Windows下VS以及linux下QTCreator良好的调试能力；4. 思维方式灵活，能从多角度看待问题；5. 做事积极主动，富有责任心和集体荣誉感；6. 计算机及相关专业；7. 优先条件：（1） 对操作系统有深刻理解，具有linux开发经验；（2） 了解多种开发语言，或有相关开发经验（如：java、Python、javascript等）；（3） 熟悉二进制、OOXML文档格式或有相关文档的处理分析经验；（4） 熟悉linux操作系统和OpenOffice / libreoffice等开源办公软件。面试聚力维度北京C++6天/周，3个月以上1.负责根据公司人工智能科研项目的需要，做配套的软件开发工作；1.掌握C++语言，熟悉常见的数据结构和算法；2.具有很强的多线程代码调试、BUG定位及修复能力；3.熟练使用OpenGL、D3D、CUDA等任意一种图形API，了解计算机图形学；4.熟悉UE4引擎者优先；5.责任心强，有较强的学习能力，较好的沟通交流能力，能够迅速融入团队。6.对人工智能行业发展有热情者优先。有Momenta魔门塔北京C++4天/周，3个月以上1.搭建深度学习部署框架。2.与算法、SDK团队协作，实现高效、易用的解决方案。1.熟练掌握 C/C++，有很强的工程开发经验。2.了解常见深度学习算法和模型，对深度学习性能优化有热情。3.有敏锐的观察力，迅速定位问题和解决问题。4.熟悉计算机体系结构和编译原理者优先。有商汤科技北京，上海，深圳C++3天/周，3个月以上1. 参与深度学习平台的设计与研发2. 对深度学习最新算法与架构进行调研，实现及改进3. 对计算调度与分布式通信进行优化4. 依托公司内部深度学习设施，建立垂直行业的综合应用平台以下1、2条满足1条即可：1. 能熟练运用c++11编程，具有良好的编程习惯2. 对于主流Deep Learining框架的内部框架有深入了解的优先3. 具有良好的沟通理解能力，喜欢技术方面的工作有商汤科技北京，上海，深圳Docker容器云3天/周，3个月以上1. 容器云平台建设、优化2. 深度学习解决方案容器化3. 分布式解决方案容器化4. AI云平台前瞻性探索与实践1. 精通至少一种：c, c++, Go2. 了解docker基本工作原理3. 具有发现问题、研究问题、解决问题的积极性以及方法体系加分项，满足任何一项均可获取重大加分：1. 在容器云方向具有卓越的远见并具备一定程度的执行力2. 精通Kubernetes相关领域任意核心模块3. 精通Docker相关领域任意核心模块4. 深度参与云原生领域或者分布式领域任意重要开源项目有商汤科技北京，上海，深圳python3天/周，3个月以上1. 参与深度学习平台的设计与研发2. 对深度学习最新算法与架构进行调研，实现及改进3. 对计算调度与分布式通信进行优化4. 依托公司内部深度学习设施，建立垂直行业的综合应用平台1. 能熟练运用python编程与架构较大规模的python程序2. 对于主流Deep Learining框架的内部框架有深入了解的优先3. 具有良好的沟通理解能力，喜欢技术方面的工作有字节跳动北京后台开发3天/周，3个月以上1、负责字节跳动产品的后台开发工作 2、主要实现语言python和golang1、良好的设计和编码品味，热爱写代码 2、较好的产品意识，愿意将产品效果做为工作最重要的驱动因素 3、掌握WEB后端开发技术: 协议、架构、存储、缓存、安全等 4、积极乐观，认真负责，乐于协作 5、每周可以实习3天以上，连续实习3个月以上 6、计算机、软件、通信相关专业同学优先有网易游戏杭州UE4游戏研发实习4天/周，3个月以上1、使用UE4引擎进行IOS/Android平台手机游戏开发2、与策划,美术保持良好的沟通,确保程序功能与设计需求一致3、开发游戏核心逻辑,包括但不限于战斗、同步、寻路等模块4、针对各个发布平台进行游戏性能优化1、计算机,软件开发,游戏开发,网络安全等本科及以上学历2、扎实的计算机基础知识,深入理解数据结构,算法,操作系统等知识3、良好的C++编程功底,熟悉一门脚本语言4、良好的逻辑分析能力,以及解决问题的强烈意愿5、热爱游戏,玩过FPS游戏者优先面议网易游戏杭州Unity客户端程序实习4天/周，6个月以上1、使用Unity3D引擎进行iOS/Android平台手机游戏开发；2、与策划、美术保持良好沟通，确保程序功能与设计需求一致；3、研发所需的各类工具，编辑器等内容的再开发以及调整优化；4、针对各个发布平台进行游戏性能优化1、热爱游戏；2、计算机及相关专业本科以上学历，有C、C++、C#、python或Lua语言编程基础；3、有unity引擎使用经验为佳4、良好的逻辑思维和编程习惯，具备独立解决技术问题的能力5、有责任感，有良好的沟通能力，具备团队合作精神6、能承受一定的工作压力，对游戏开发充满热情7、能保证每周实习4~5天，连续实习6个月的学生优先。有智加智行苏州软件实习4天/周，3个月以上1.负责自动驾驶相关的前沿技术研发工作。2.协助其他团队完成自动驾驶研发工作。1.熟练掌握C++/python。2.大三/研二在读，计算机专业/电气工程/数学或者统计学专业优先。3.一周至少保证3天实习，连续实习至少3个月。有图森未来北京项目经理4天/周，3个月以上对项目开发流程、项目质量和项目开发进度的规划、控制、监督和管理；作为接口人，和其他相关部门沟通和对接需求；以天为单位完成项目状态跟进和日报，发现并协助解决项目推进过程中的各种问题，直至完成；定期完成项目分析报告，并及时通告相关人员；领导交代的其他任务。对人工智能充满热情，对于相关技术有基本的了解；计算机、软件工程、自动化或相关专业本科以上；有基本的英文读写能力；优秀的逻辑分析能力和语言组织能力，可以自行分析和提炼问题，并形成报告；有图森未来北京深度学习框架研发4天/周，3个月以上针对公司内部需求，优化深度学习平台（MXNet）训练和部署性能；基于MXNet，设计和研发大规模分布式训练平台；为相关开源项目贡献新Feature。了解机器学习以及深度学习基本知识；熟悉计算机体系结构和性能优化基本知识；在相关开源项目（MXNet，Caffe，TensorFlow，PyTorch）有贡献者优先。加分项：有并行分布式开发经验或ACMICPC/超算比赛等参赛经验。有图森未来北京感知算法4天/周，3个月以上追踪并改进前沿感知算法模块，包括但不限于基于视觉与LiDAR的物体检测，场景分割，目标追踪等；将独立感知模块的输出进行融合，得到适合后续路径规划模块的表示。在计算机视觉/深度学习/机器感知三者之中至少熟悉一项基本知识，有处理真实大规模数据经验（课程作业除外）；熟悉Python, C++；动手能力强，可以快速将想法落实；加分项：有计算机视觉或机器学习相关研究经验，有高水平论文发表参加kaggle比赛获得前十名者参加过ACM/ICPC等编程竞赛者取得优异成绩有地平线北京生成式模型算法4天/周，3个月以上1. 负责基于深度学习的生成式序列预测模型算法研究与实现；2. 以业务应用为导向，探索数据处理、模型训练评测、推断加速等方面的工程内容；3. 由资深算法工程师指导发表相关高质量论文，撰写相关专利。1. 计算机科学、电子信息工程、数学或相关专业的在读硕士或博士（也欢迎优秀的本科生）；2. 良好的工程实现能力，熟练掌握C/C++、Java、Python等至少一门语言；3. 了解并使用过以下深度学习框架中的至少一种: MXNet/Caffe/Caffe2/Pytorch/Tensorflow/Keras4. 对CNN、RNN、VAE、GAN等模型中至少一种有研究使用经验者优先。有网易游戏杭州强化学习4天/周，3个月以上1、利用深度学习和强化学习学习游戏中的智能体。2、需要候选人具备一定的问题分析能力， 问题建模能力和独立研究的能力。实习期间能够撰写论文或专利。1、计算机和机器学习等相关专业硕士及以上学历；2、在机器学习、深度学习和强化学习方向具有扎实的理论和实践基础，保持对领域最前沿技术的追踪；3、熟练掌握一种常见的深度学习框架，譬如 TensorFlow/Keras和PyTorch；4、熟练掌握常用的游戏开发脚本（c#、Python）；5、有数据挖掘、和机器人控制算法相关经验者优先；6、在顶级会议（AAAI/IJCAI/ICML /NIPS等）或期刊有论文发表者优先;7、能够独立分析并解决问题，有带项目经验者优先。有百度北京视觉深度学习实习5天/周，3个月以上北京百度智能汽车事业部招一名实习生，一月可以入职，硕士工资大概200一天，外地实习生有额外补助。具体JD如下：-负责无人车中计算机视觉或深度学习算法相关的前沿技术研发工作-负责图像中的目标检测, 分类以及跟踪等-负责图像理解等相关算法研发工作-自动化、计算机、电子、应用数学等相关专业在读或者已毕业学生-在计算机视觉，机器学习或者深度学习中至少精通一项-具有良好的沟通能力，良好的团队合作精神，良好的科研精神-熟悉C/C ++或Python程序开发，具有良好的编程习惯-具有良好的英文读写能力(Preferred)面议旷视科技北京算法4天/周，3个月以上1、协助或独立推进计算机视觉和深度学习领域的核心算法；2、协助或独立构建计算机视觉或深度学习领域的关键应用。1、扎实的编程基础；2、对CV / DL有浓厚的兴趣，致力于在此领域发展。包括但不限于计算机视觉（包括分类，检测，分割，跟踪，和三维重建）；图像或信号处理；计算摄影学和计算机图形学等；3、熟悉 Python 等至少一门脚本语言，使用过 Theano, Caffe, Torch, TensorFlow 等开源深度学习框架优先；4、有深度模型训练，图像分类、物体检测与分割、视频分析、三维建模、计算机图形学等相关科研经历者（例如顶级会议第一作者）优先。有旷视科技北京算法工程Intern4天/周，3个月以上1. 参与人脸识别算法研发2. 参与建设人脸识别算法迭代与落地System3. 研发迭代亿级/十亿数据规模算法4. 左手Paper，右手Code，拉通算法与工程落地1. 良好的编程能力，熟练掌握 Python,C/C++ 等至少一门语言2. 扎实的数据结构和算法基础，熟悉 Linux 操作系统3. 对计算机视觉或深度学习有浓厚兴趣4. 有算法竞赛、机器学习或分布式系统经验者优先5. 每周周一到周五至少实习四天，实习时长不低于三个月有快手科技北京算法3天/周，3个月以上1、参与快手商业化投放排序算法的研究及开发工作；2、分析、理解用户数据和业务场景，设计合理的推荐算法，优化Ranking机制；3、学习快手商业化CXR预估算法及相关机器学习/深度学习算法研发3、设计良好的架构支持高并发、大数据的策略业务需求。1、计算机或相关专业本科以上学历，硕士博士优先2、熟悉机器学习、数据挖掘或深度学习相关基础知识，对机器学习的常用算法有使用经验，并能根据实际场景进行优化；3、熟练掌握linux下面向对象编程；熟悉Java or C++，基础扎实；4、善于阅读文献，快速学习 ；5、有开发高品质产品、编写高质量代码的自我要求；6、每周可至少出勤3天，连续实习3个月及以上有图森未来北京深度学习框架研发5天/周，2个月以上针对公司内部需求，优化深度学习平台（MXNet）训练和部署性能；基于MXNet，设计和研发大规模分布式训练平台；为相关开源项目贡献新Feature。了解机器学习以及深度学习基本知识；熟悉计算机体系结构和性能优化基本知识；在相关开源项目（MXNet，Caffe，TensorFlow，PyTorch）有贡献者优先。加分项：有并行分布式开发经验或ACMICPC/超算比赛等参赛经验。有小米科技北京软件开发4天/周，3个月以上-搜索相关基础平台的开发工作-搜索及相关领域的机器学习算法设计与应用-熟悉Linux环境下Java/C/C++、python、SHELL等语言编程-对常用数据结构和算法有较为深刻的理解-优秀的分析和解决问题的能力，对挑战性问题充满激情 -强烈的上进心和求知欲，较强的学习能力和沟通能力，具备良好的团队合作精神具备以下条件者优先：-具备一定机器学习背景，熟悉常见机器学习算法-具备搜索相关经验，在自然语言文本处理上有经验优先面议思核科技上海AI算法5天/周，3个月以上探索与实现计算机视觉/深度学习/机器人领域的前沿研究，推动研究的落地与应用；l 研发与优化计算机视觉算法，如物体检测识别，目标跟踪，场景分割等；l 研发与优化深度学习算法，包括深度学习模型设计/网络训练与测试/数据生成与维护等；l 理解并实现机器人在以下相关领域的算法：抓取、操作、运动规划、控制、感知、学习等。1、本科及以上学历，在校生，计算机相关专业；2、强大的C++/Python编程能力，优秀的算法、数据结构知识；3、强烈技术热情和学习欲望，快速掌握新知识；4、出色的解决问题能力，乐于技术分享和讨论。优先项：1、计算机视觉/机器人/机器学习专业知识背景；2、有计算机视觉/机器人/机器学习领域研究或实际研发经验；3、NOI、ACM、超算、Robocon等竞赛获奖经历。有腾讯上海计算机视觉4天/周，3个月以上1.负责行人检测追踪，行人识别等深度学习相关算法研发2.算法模型迭代，sdk开发1. 熟悉C++和python，较强的工程能力2. 熟悉deep leaning和计算机视觉相关算法有平安科技深圳金融安全研究员5天/周，3个月以上1、应用AI算法进行智能化的安全检测和分析2、熟悉深度学习算法（eg, RNN, LSTM）及开源框架（eg, Keras, Tensorflow）3、熟悉计算机网络（eg, DNS, TCP/IP）和安全运营（eg, firewall, IDS）4、良好的英语阅读和写作能力1、应用AI算法进行智能化的安全检测和分析2、熟悉深度学习算法（eg, RNN, LSTM）及开源框架（eg, Keras, Tensorflow）3、熟悉计算机网络（eg, DNS, TCP/IP）和安全运营（eg, firewall, IDS）4、良好的英语阅读和写作能力有商汤科技杭州见习研究员3天/周，3个月以上1.前沿SLAM算法的调研，复现和改进2.手机/自动驾驶等业务方向SLAM、VIO算法研发3.现有SLAM算法的性能和效果优化or1.深度学习在SLAM领域的调研和应用2.基于深度学习的光流，VO等算法的应用3.基于深度学习的标志识别，物体识别等工作，应用于基于Marker和Object的SLAM和AR1.计算机/数学/电子工程等相关专业，扎实的数学（数值优化，线性代数，图像处理）和编程（C++，Linux）基础；2.有SLAM/VIO/VO的相关项目经历者优先；3.有SLAM或者深度学习、神经网络等相关项目经历者优先；4.有计算机视觉/机器人等领域相关论文优先；5.有高性能计算（GPU、DSP，NEON编程）经验者优先。有网易游戏杭州用户画像4天/周，3个月以上1.    在人工智能与游戏的交叉领域中进行创新研究，探索新的游戏设计及交互方式；2.    借助游戏平台及数据迭代发展人工智能技术，在相关领域发表高质量论文或撰写专利；3.    使用人工智能技术，在游戏领域中实现全面、快速、解耦合的画像状态生成与应用；4.    充分发挥人工智能优势，深入理解与精准定位用户，挖掘用户个性化等相关应用；5.    解决游戏中检测、排序、估值、预测、推荐等数值类难点问题，以研究推动应用落地；- 有一定游戏经历，热爱人工智能；- 熟悉常用的数据挖掘、机器学习、深度学习方法；- 精通至少一种编程语言，包括但不限于Python、C/C++、Java、PHP、R、C#等；- 有丰富的Linux使用经验，熟练掌握Shell等一门以上脚本语言；- 有图研究（Graph）、流失研究、模型解释性、解耦合等领域经验者优先；- 对用户画像，游戏中检测、排序、估值、预测、推荐等数值类难点问题有经验或有兴趣者优先；- 有过深度学习工程项目经验者优先，能熟练使用主流深度学习框架者优先；- 在人工智能会议和期刊发表过优秀论文，有顶级会议期刊发表经历者优先；- 实时关注人工智能前沿，定期泛读顶会论文，精读领域内好文；- 编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维；- 专注、精益求精、时间规划能力强、有强烈的探索精神及深入思考的能力；- 具有良好的沟通、协作能力，较高的开发效率和承压能力，责任意识强；-20年及之后毕业或19届已保研，每周实习4-5天，保证实习4个月以上者优先。有网易游戏杭州强化学习4天/周，3个月以上1、利用深度学习和强化学习学习游戏中的智能体。2、需要候选人具备一定的问题分析能力， 问题建模能力和独立研究的能力。实习期间能够撰写论文或专利。1、计算机和机器学习等相关专业硕士及以上学历；2、在机器学习、深度学习和强化学习方向具有扎实的理论和实践基础，保持对领域最前沿技术的追踪；3、熟练掌握一种常见的深度学习框架，譬如 TensorFlow/Keras和PyTorch；4、熟练掌握常用的游戏开发脚本（c#、Python）；5、有数据挖掘、和机器人控制算法相关经验者优先；6、在顶级会议（AAAI/IJCAI/ICML /NIPS等）或期刊有论文发表者优先;7、能够独立分析并解决问题，有带项目经验者优先。有图普科技杭州算法5天/周，6个月以上1.展开机器学习/深度学习等相关领域研究和开发工作；2.从事深度学习系统开发工作（包括机器学习、图像处理等的算法和系统研发）1.机器学习/模式识别等相关专业2019届硕士或博士；2.熟悉linux，c++，python以及后端服务器开发3.在深度学习领域有一定实践经验；4.善于解决和分析问题，富有想象力和学习能力，良好的团队合作精神。有创造性思维，有推进人工智能的理想和使命感；a.写过或较深入参与过深度学习框架开发者优先；b.在ML/DL方向知名国际会议期刊发表过论文者优先；简历投递地址：campus@tuputech.com有图普科技杭州深度学习4天/周，3个月以上利用深度学习进行图像处理领域最前沿算法研发，并将算法应用到实际场景中；1.    硕士，计算机相关专业；2.    计算机基础扎实，有很强的算法实现能力；3.    有深度学习相关实践者优先；4.    在计算机视觉领域顶级会议或者期刊发表者文章者优先；5.    可实习时间至少3个月；简历投递地址：campus@tuputech.com有网易游戏杭州强化学习4天/周，4个月以上利用深度学习和强化学习学习游戏中的智能体。 需要候选人具备一定的问题分析能力， 问题建模能力和独立研究的能力。实习期间能够撰写论文或专利。1、计算机和机器学习等相关专业硕士及以上学历；2、在机器学习、深度学习和强化学习方向具有扎实的理论和实践基础，保持对领域最前沿技术的追踪；4、熟练掌握一种常见的深度学习框架，譬如 TensorFlow/Keras和PyTorch；5、熟练掌握常用的游戏开发脚本（c#、Python）；6、有数据挖掘、和机器人控制算法相关经验者优先；6、在顶级会议（AAAI/IJCAI/ICML /NIPS等）或期刊有论文发表者优先;8、能够独立分析并解决问题，有带项目经验者优先。有"}
