{"content2":"如今领占主导地位的19种AI技术！\nhttp://blog.itpub.net/31542119/viewspace-2212797/\n深度学习的突破将人工智能带进全新阶段。 2006 年-2015 年是人工智能崛起的黄金十年。 2006 年 Hinton 提出“深度学习” 神经网络，使得人工智能的性能获得了突破性进展， 2006 年成为人工智能发展史上一个重要的分界点。\n人工智能黄金十年\n近年来，随着深度学习算法的逐步成熟，AI技术分支越发增多，现在让我们细数AI技术，看看领占主导地位的19种AI技术都有哪些！\n1、 自然语言生成（Natural Language Generation）\n自然语言生成是AI的子学科，可将数据转换成文本，使计算机能够像人一样的拥有表达和写作的能力，它能够帮助客户快速的生成商业报告和市场概要。\n2、 语音识别(Speech Recognition)\n语音识别是一门交叉学科，可将语言转换成文字。目前所涉及的领域包括：信号处理、模式识别、概率论、信息论、发声机理和听觉机理等。\n目前，语音识别领域内的系统数量越发繁多，通过语音应答交互系统和移动应用程序对人类语言进行转录的系统已多达数十万。\n3、 虚拟代理（Virtual Agents）\n虚拟代理是一种能够与人类进行交互的计算机程序，最常见的例子就是聊天机器人。虚拟代理目前多用于客户服务以及智能家居等领域。\n4、 机器学习平台（Machine Learning Platforms）\n机器学习（ML）是计算机科学的一个分支学科，同样也是人工智能的分支。它能够为计算机添加学习的功能，提升计算机的学习能力。\n通过提供算法、API（应用程序编程接口）、开发和培训工具、大数据以及各种应用程序，机器学习实力逐渐增强，很多企业为之青睐。目前机器学习能够帮助用户完成商业预测和分类等任务。\nAdext AI是世界上第一个也是唯一一个观众管理工具，它将人工智能和机器学习应用于数字广告，以便将广告精准的投放给最符合产品定位的受众。\n5、 人工智能硬件优化（AI-optimized Hardware）\n如果你问AI时代，硬件会不会迎来春天？技术告诉你：会的。这里就涉及到一个新技术——人工智能硬件优化，用于运行面向人工智能的计算任务，经过专门设计和架构的GPU(图形处理单元)和CPU(中央处理单元)。\n即将推出的AI优化硅芯片将直接嵌入到你的便携设备以及生活各处。\n6、 决策管理(Decision Management)\n智能机器能够为人工智能系统引入规则和逻辑，研发人员可以将它们运用到初始设置或培训、机器的维护以及调整等流程中。\n决策管理已经深入到企业的各种应用程序当中，来协助和执行智能决策，实现收益最大化。\n7、 深度学习平台（Deep Learning Platforms）\n深度学习平台是机器学习的一种特殊形式，它包含多层人工神经网络，能够模拟人类大脑进行数据处理和决策。目前深度学习平台主要被应用于基于大数据集的模式识别和分类。\n8、 生物识别技术(Biometrics)\n所谓生物识别技术就是，通过计算机与光学、声学、生物传感器和生物统计学原理等高科技手段密切结合，利用人体固有的生理特性，（如指纹、脸象、虹膜等）和行为特征（如笔迹、声音、步态等）来进行个人身份的鉴定。\n生物识别技术可以实现人与机器之间更加自然的交互，包括图像、语音以及各种肢体交互等，是市场研究领域内的重要帮手。\n9、 机器处理自动化（Robotic Processes Automation）\n机器处理自动化使用脚本及其他方法实现人类操作自动化，支持企业更高效的商业流程，比较适用于人力成本高昂但效率低下的任务和流程。\n典型的例子就是Adext AI，它是一个将人工智能融入数字广告的平台，可以帮助企业完成大量的机器性重复性高的工作，提升企业工作效率。\n未来，机器处理自动化将成为一个企业的重要解决方案，它将帮助企业充分利用人才，让员工进入更具战略性和创造性的职位，能够更大限度的发挥优秀员工的价值。\n10、文本分析和自然语言处理（Text Analytics and Natural Language Processing）\n该项技术利用文本分析，通过统计和机器学习的方法，了解句子结构、意义和意图。文本分析和自然语言处理技术目前多被应用于安全系统欺诈检测。同时，它还被大量的智能助手和应用程序用于提取非结构化数据。\n11、数字孪生/AI建模(Digital Twin/AI Modeling)\n数字孪生是一种软件结构，可以弥合物理系统和数字世界之间的差距。\n例如，通用电气（GE）正在建立一支人工智能小组，来监控飞机引擎、机车和燃气轮机，并利用通用电气机器的云托管软件模型预测故障。他们的数字孪生主要是软件代码行，其最精确的版本极其复杂，看起来就像三维计算机设计图纸，满是交互式图表和数据节点。\n12、网络防御（Cyber Defense）\n网络预防是一种计算机网络预防机制，专注于预防和检测，并且能够在基础设施和信息受到威胁、攻击的第一时间给出响应。\n人工智能和机器学习将网络预防带到了一个新的发展阶段，用以应对网络日益危险的环境。2017年，网络违规指数（Breach Level Index）检测到的违规记录超过20亿次，其中数据意外丢失占76%，盗窃类占69%。\n能够处理输入序列的递归神经网络可以与机器学习技术结合起来，创建监督学习技术。这种技术可以用于检测网络可疑用户活动，检测出高达85%的网络攻击。\n初创公司Darktrace将行为分析与高级数学相结合，来自动检测组织内的异常行为。另一家网络安全初创企业Cylance使用人工智能算法来阻止恶意软件、减轻零时差攻击（Zero-day attacks）造成的损害。两家公司都将人工智能技术应用到网络安全领域，致力于服务网络安全预防工作。\n13、合规( Compliance)\n合规是指个人或组织符合公认规章制度，或符合某项合同条款的要求，同时具备相关行业认证。\n人工智能应用于合规工作的案例屡见不鲜。例如，自然语言处理技术能够扫描监管文本将其模式与关键字相匹配，来识别与公司相关的更改。\n具有预测分析功能和场景构建器的资本压力测试方案能够帮助公司遵守监管资本要求。并且，深度学习使用能有效减少被标记为潜在洗钱活动的交易数量。\n14、知识工作辅助(Knowledge Worker Aid)\n很多人都在担心人工智能是否会完全取代人类工作，但我们可以换一个角度去思考问题，实践证明了人工智能的价值真的很大，它可以极大的帮助员工工作，特别是工作在知识领域内的员工。\n事实上，知识领域的智能化被列为第二大最具破坏性的新兴技术趋势。知识性强的医疗和法律行业的工作人员将逐渐依赖于人工智能技术。\n越来越多的公司开始致力于该领域工作，例如Kim Technologies，该公司的目标就是为那些没有IT编程经验的知识工作者提供工具，在人工智能的帮助下创建新的工作流程和文档流程。\n15、内容创作(Content Creation)\n内容创作是指人们在网络上贡献材料的过程，包括视频、广告、博客帖子、白皮书、信息图表以及其他视觉或书面材料。\n像《今日美国》(USA Today)、赫斯特(Hearst)和哥伦比亚广播公司(CBS)等品牌早就开始使用人工智能来生产内容。\n一个例子就是Wibbitz。Wibbitz是一个SaaS工具，它可以帮助发布者利用人工智能视频制作技术，在几分钟内从书面内容中创建视频。另外一个例子是Wordsmith，它是由Automated Insights创建的一个工具，该工具利用自然语言技术基于盈利数据生产新闻报道。\n16、P2P网络( Peer-to-Peer Networks)\nP2P网络，即对等计算机网络，是一种在对等者（Peer）之间分配任务和工作负载的分布式应用架构，是对等计算模型在应用层形成的一种网络形式。\nBet Capital LLC的首席执行官Ben Hartman表示：P2P网络也被用于货币加密，甚至能够通过收集和分析大量数据来解决一些世界上最具挑战性的问题。\nNano Vision是一家以加密货币来奖励用户的初创公司，目的在于改变我们处理人类健康威胁的方式，例如超级细菌、传染病和癌症等。\n领域内的另一个示例是Research，它是一个分散的搜索引擎，由社区提供动力，通过令牌奖励会员，来获得一个更加透明的搜索引擎系统。\n17、情绪识别(Emotion Recognition)\n情绪识别是一种利用高级图像处理或音频数据处理“读取”人类脸上情绪的技术。目前，情绪识别技术已经能够捕捉“微表情”，识别肢体语言暗示，以及分析含有情绪的语音语调。\n执法人员可以将此项技术应用到审讯任务，检测嫌疑人情绪来获取想要得到的信息。\n越来越多的创业公司都在使用此项技术，该项技术除了语言分析、音频输入还能描绘一个人的性格特征，包括积极、兴奋、生气等。\n知名情绪识别公司Affectiva发布了一款人工智能情绪监控软件AffectivaAI，它的目标是搭载到时下已经出现的半自动驾驶汽车中，监控驾驶员的精神状态，当驾驶员出现嗜睡、过度焦虑或易怒状态时，自动驾驶系统会及时接管汽车，保证行车安全。\n18、图像识别( Image Recognition)\n图像识别是指在数字图像或者视频中识别出物体特征的过程，更多AI技术的堆叠也使该项技术功能越来越强大。\n人工智能可以在社交媒体平台上搜索照片，将其与大量数据集进行比较，从而找出最相关的内容。\n图像识别技术还可用于车牌检测、诊断疾病、分析客户意见等。\nSenseTime是该行业相对较出色的公司，该公司开发了面部识别技术，可应用于银行卡验证、应用支付和图片分析等领域。\n19、智能营销(Marketing Automation)\n当前，市场营销部门可谓是在人工智能中受益匪浅，业界极其看好人工智能，对人工智能技术的未来抱有很大信心。该领域内55%的营销人员认为人工智能的影响力比社交媒体大。\n智能营销能够帮助企业提高市场参与度帮助员工提升工作效率。它能够对客户进行细分、集成客户数据和管理活动，简化重复性高的任务，让决策者将更多的时间投入到战略性任务上。"}
