{"content2":"AI，大数据，复杂系统 最精 40本大书单原创 2017-10-30 Peter 混沌巡洋舰如果这篇文的题目变成最全书单，那么这篇文会变得又臭又长，这个年代，关于人工智能和大数据的书，没有一万本也有一千本，而这里列出的40本，则是精选过的，不敢说每一本都字字珠玑，但这个书单保证没有一本水书。废话不说，赶快上车，先放思维导图，再一本本的简单说说。书单分成8部分，其中的数字代表我对这一系列的书的推荐程度。先说经典书的部分终极算法：机器学习和人工智能如何重塑世界这本书的名字，显示着作者试图在机器学习的各个流派间进行整合，最终提出机器学习里的“牛顿三定律”的理想。作者在这本书里，介绍了当前常用的算法的发展历程，这些算法包括决策树，遗传算法，神经网络，朴素贝叶斯及贝叶斯网络，隐式马尔可夫链，K最近邻及支持向量机，作者还介绍了无监督学习的算法。在介绍算法时，作者还介绍了机器学习里最大的两个阻碍，过拟合及维度灾难。对上面的这些名词看不懂，看过书你就明白了。这本书中，没有公式与代码，有的只是对机器学习中的算法本质一针见血的点破，有的只是依据这些算法而编出的日常生活中的故事，是对机器学习中核心算法的概念化的模型。一言以概之，这是一本所有有高中数学水平且无计算机背景的读者都能够读懂的科普书。如果你不想对控制着我们衣食住行方方面面的机器学习算法一无所知，那么这本书是你必读的书。人工智能之父马文·明斯基经典作品：情感机器+心智社会这两本书的作者被誉为人工智能之父，不是因为他发现了某一个特别NB的算法。而是因为其对人类的认知过程有着独特的见解，从而能利用对人类认知的洞察来指导机器学习算法的研发。其在70年代写成的心智社会一书，令当前的人工智能研究者还会常读常新。这本书虽然价格有些高，但考虑到读一遍根本不指望能看懂，要看三遍才能有些领悟，算算阅读单价，就不算高的。再加上这本书送朋友，那是多么有逼格的一件事啊。这本书是人工智能之父集一生功力写成的集大成之作。如何让机器有感情，是在机器智能即将超越人之后的人工智能的下一个天花板。情感计算的概念，也随着Chatbot（聊天机器人）而火了起来。阅读这本书，会让读者认识到情感不一定是人类独有的特征。情况也可以被表示为一连串的计算。而赋予机器情感，我们也能造成有常识，有直觉的机器。如果你想打破人工智能的黑盒子，这本书也是一本需要反复研读的大作。数学之美这本书虽然叫做数学之美，其实由于作者吴军博士是谷歌的搜索专家，所以写的多半是自然语言处理领域的发展。关于这本书，溢美之词已经太多了。而我这里想说的不是其将算法背后的原理讲述的多么清晰，而是作者讲述了其和诸位自然语言处理领域的先驱的个人故事，其中描述了诸多学者的风骨以及其背后的道德力量。这是这本书少有被人提起，但却能令人记忆深刻的地方。人工智能的未来这本书的中文版已经绝版，在网上搜这本书，多半搜出的是雷库兹曼的原名为How to create a mind 的书的翻译版。对于这本04 年的书，书的作者杰夫·霍金斯(Jeff Hawkins)，成功的计算机工程师和企业家，掌上型电脑PalmPilot、智能电话Treo等产品的发明人。这本书提出的HTM模型，可能凭其单一的结构而第一次产生自我学习的“智能”，其理论的高瞻远瞩，启发了当今的深度学习浪潮。理解信念：人工智能的科学理解这本书的作者尼尔斯•尼尔森（NilsJ.Nilsson）是斯坦福大学教授。这是一本哲学书。其核心论旨包括，我们人类的感觉系统是获取外界信息、形成信念的唯一途径；运用科学方法、经由严格批评和修正而建立起来的信念，是相对真实且更为有用的。人工智能在某种程度上，和人类一样拥有信念，或者可以说，人类是一台台复杂的机器。智能的本质 人工智能与机器人领域的64个大问题在书中，作者从常识出发，对人工智能和机器人表达了很多“令人惊讶”而又让人深思的观点。例如在陪伴老年人方面，迄今为止先进的机器人都不如狗做得好。书中充满了思辨和哲学判断，感觉作者属于乐观派中的悲观派，乐观的是认为不会出现终结者，悲观的是AI发展还是太慢了。 我认为是近年来不可多得的好书。 同时，作者担心的并不是机器智能的迅速提高，而是人类智力可能会下降，这才是最值得担忧的。接着是AI对商业和我们生活的影响。这一系列的书很多，选出几本我读过的第二次机器革命《第二次机器革命》这本书，是那种能够在机场书店找到的图书，这本书不算厚，两三个小时就可以读完，也不算烧脑。书中的内容围绕着以人工智能和数字化为代表的技术对未来社会的影响展开论述。这本书令我记忆最深的是每一章开篇引用的名言，即幽默又别有深意。人工智能时代这本书的作者Kaplan是斯坦福大学顶尖人工智能专家。卡普兰本科毕业于芝加哥大学历史与科学哲学专业，之后考入宾夕法尼亚大学计算机科学专业，后进入斯坦福大学人工智能实验室工作。这本书的英文名直译过来是人不必遵守机器的规则。这是一个老人写的书，这种警世的书也需要由一个老人写出，作者见证了人工智能的低潮与复兴，见证了越来越大的贫富差距。他活到了替子女说话的年纪，又没有丢掉幽默。这样智慧的老人，值得我们去倾听。与机器人共舞凯恩斯就曾指出，科技将取代工作岗位，而非整体工作量。这些改变了我们工作方式、互动方式以及娱乐方式的创新，将给21 世纪的社会带来翻天覆地的改变，这种影响几乎等同于20世纪初机械设备将农耕经济带向工业经济时，社会所经历的根本性变革。这本书的作者是曾获得普利策奖的资深记者，视角全面，分析深入。接着说说大数据方面的书爆发：大数据时代预见未来的新思维本书作者全球复杂网络权威Barabasi所作，一本超越《黑天鹅》的惊世之作。作者认为人类正处在一个聚合点上，在这里数据、科学以及技术都联合起来共同对抗那个最大的谜题——我们的未来。作者指出人类日常行为模式不是随机的，而是具有“爆发性”的。爆发揭开了人类行为中令人惊讶的深层次的秩序，使得人类变得比预期中更容易预测得多。爆发模式的揭示，其影响力将与20世纪初期的物理学或者基因革命的影响力不相上下。智慧社会：大数据与社会物理学这本书的作者是MIT人类动力学实验室主任。这本书提出了一种量化的办法，来定向测度沟通对行为的影响，即想法流（idea flow）的传播的规律。量化的考察沟通对创新的影响。作者用可控双盲实验去验证诸如社会网络的大小与想法的多样性有正相关关系；社会网络的互动密度与效率显著相关等习以为常的观点，使得全书的科学很强。大数据可视化：重构智慧社会大数据的目的最终还是要讲一个好故事。而人类是一种视觉动物，一幅图的效果好过千言万语。这本书举出了很多第一线的例子，来说明怎么样去做出好的数据可视化，对于任何要处理数据的人来说，这本书中的道理都是必不可少的，须要透彻掌握的。大数据思维与决策这本书的作者是计量经济学家，这本书展示了社会科学的全面数字化。没有数字就没有真相。作者指出统计是一个非常强大的研究社会问题的手段，可以应用在任何你想要的领域。社会学科的专家，将越来越依靠大数据模型做出判断，直觉和数据统计呈现出互补的趋势。而在善于利用大数据的商家面前，消费者将越发无计可施。赤裸裸的未来·大数据时代：如何预见未来的生活和自己正如这本书的书名所展示的，就个人而言，我们早已生活在一个“超级透明”的世界，我们泄露出去的海量信息无处不在。若将这些信息收集起来，加以分析，就能勾勒出每一个人的真实性格、内心偏好，乃至可以预测每个人的命运。作者大胆预言：“大数据时代”只不过是一朵小浪花，终将会被更新、更前沿的“物联网时代”取代，并以灾难预测、流行病预防、犯罪防治、潜能开发、情绪管理、恋爱情感、个性化学习、娱乐私人定制等领域为例，描绘了一个富有激情的美好未来。白话大数据与机器学习本书通俗易懂，有高中数学基础即可看懂，同时结合大量案例与漫画，将高度抽象的数学、算法与应用，与现实生活中的案例和事件一一做了关联，将源自生活的抽象还原出来，帮助读者理解后，又带领大家将这些抽象的规律与算法应用于实践。大数据：从概念到运营有多少人只是谈论大数据，却不知道该怎么将大数据应用到具体的工作中去，这本书的作者有着在大数据领域拥有超过20年的从业经历，曾担任雅虎公司广告分析副总裁，在数据存储、商业智能和数据分析利用方面有着独到的见解。本书一共有十三个章节，在书中作者将大数据在实际运用中的方方面面通过具体的案例进行了分析。侧重于大数据的实际运用方面而不是理论的探讨。大量的案例使得书中观点鲜活有力。Python 金融大数据分析大数据的应用最广的领域，无疑是数据驱动的金融业。作为该领域的入门书，这本书介绍了python语言在金融数据可视化，金融衍生品定价，金融时间序列数据处理，蒙特卡罗方法等话题上的具体应用，是一本简单明了的入门书。接下来的书关于数学，这是所有数据科学的基本功妙趣横生的统计学这是本统计学入门书，涉及了很多高中课程中的内容，例如我们是不是比父母更聪明？开车时打电话与酒驾一样危险吗？坐飞机和开车，哪种方式更安全？钻石越重，价格就越高吗？小学四年级的学生可以用统计学做什么？这本书的目标是日常生活所需要的统计思想、正确分析数据的基本路径。统计会犯错这本书的大部分例子来源于临床医学。但书中的道理却可以应用到任何领域上。这本书可以当作一本统计学文章阅读踩雷指南，至少看完了对一些得出千奇百怪的结论的文章抱有怀疑，即使是权威期刊刊登的文章。最后指出的因为保密造成的数据不公开问题也是值得深思的。用数学的语言看世界本书为理论物理学家大栗博司先生写给自己女儿的数学读本，全书以用“数学语言”解读自然为线索，用生动故事和比喻重新讲解了数学的核心原理与体系，并且讲解了把数学作为一门“语言”的思维方式，是数学入门，重新理解数学的科普佳作。该作者写的书都不错，这里只推荐其中最好懂的一本。改变世界的134个概率统计故事哲学家耶安哈金指出，统计学是1900年后人类的二十大发明之一。到了21世纪，正如家赫伯特乔治威尔斯在1903年所预言的那样，“统计式的思考将会和读写能力一样，成为优秀社会人士的必备技能”。此书以概率论为主，讲数学家的八卦。加上深入浅出的故事化讨论，让统计学不再枯燥。贝叶斯思维：统计建模的Python学习法前面都是科普书，这次来本教科书。这本书是根据作者在美国大学讲授相关课程的讲义编撰而成的。结合生活中的案例+代码实现+分析，让读者了解贝叶斯思维的威力，帮助你在生活的各个方面获得清晰的思维， 举书中的例子 战争环境下（二战德军坦克问题），法律问题上（肾肿瘤的假设验证），体育博彩领域（棕熊队和加人队NFL比赛问题），通过阅读，作者潜移默化的帮助读者形成了建模决策的方法论，建模误差和数值误差怎么取舍，怎样为具体问题建立数学模型，如何抓住问题中的主要矛盾（模型中的关键参数），再一步一步的优化或者验证模型的有效性或者局限性。程序员的数学编程的基础是计算机科学，而计算机科学的基础是数学。本书面向程序员介绍了编程中常用的数学知识，借以培养初级程序员的数学思维。读者无需精通编程，也无需精通数学，只需具备四则运算和乘方等基础知识，就可以阅读本书。这是一套书，分成三部分，涵盖线性代数概率论和基本的代数。接下来的书和复杂系统有关复杂如果你之前对复杂性科学还没有太多了解，那这本书可以成为你复杂性科学的第一本书。蚁群在没有中央控制的情况下为何会表现出如此精密的复杂行为？数以亿计的神经元是如何产生出像意识这样极度复杂的事物？是什么在引导免疫系统、互联网、全球经济和人类基因组等自组织结构？理解复杂系统需要有全新的方法，需要超越传统的科学还原论，并重新划定学科的疆域。借助于圣塔菲研究所的工作经历和交叉学科方法，复杂系统的前沿科学家米歇尔以清晰的思路介绍了复杂系统的研究，横跨生物、技术和社会学等领域，并探寻复杂系统的普遍规律，探讨了复杂性与进化、人工智能、计算、遗传、信息处理、代谢比例、网络科学等领域的关系。《Complexity_A Very Short Introduction》本书作者John Holland是复杂理论和非线性科学的先驱，遗传算法之父。本书介绍了复杂性科学的一些基本概念和核心架构，如complex physical system(CPS)、complex adaptive system(CAS)，描述了复杂系统的特征如涌现性质、自组织行为、混沌行为、胖尾分布、适应性行为。正如作者在写完这本书后意识到，将一些概念以最本质的简单的形式表现出来后，会发现一些原先分开的话题间被忽视的联系，希望你读完这本书后也有这样的感觉。而且，这本书真的是Very Short。复杂性思维本书是德国慕尼黑工业大学教授迈因策尔的代表作，14年出版的原书07年第五版的中译本。迈因策尔教授的研究范围遍及数学、物理学、科学哲学，尤其在复杂系统、非线性动力学等领域多有建树。本书从哲学的高度（在这里窃以为哲学不能指导科学，但可以为科学澄清意义），从科学前沿探索与人类心智探险史的结合中，广泛涉猎物理学、生命科学、认知科学、计算机科学、经济学、社会学等诸多方面。从物理世界的进化到生命世界的进化，从意识的起源到认知科学的兴起，从社会政治系统到社会经济系统的运行，从哲学史到哲学前沿的反思，揭示了不同学科体现出的共同的复杂性特征，阐释了对复杂性的探索将如何引起人们思维方式的深刻变化，引起的世人对共同未来的关怀。Thinking complexity要认识一门学科，不止需要了解概念，还需要亲自动手，get your hand dirty。Thinking complexity 以python为基础，演示了多种复杂系统的模型，让在计算机诞生之前难以验证的理论得以模拟，并逐步建立起复杂演绎基础之上的新认知模式。Python语言简单易懂，但书中的很多代码、练习有时间还得需要仔细研究实践。本书内容短小，但是信息量很大，关键看你是走马观花的读，还是一行行代码地进行实践了，收获是不一样的。复杂性科学涵盖了各种主题。这些主题之间相互关联，但需要花费不少时间才能搞清楚这些联系。为了帮助读者看到全景，这本书阅读列表，这些都来自于该领域最流行的研究成果。阅读列表以及关于如何使用它的建议在附录B中。这本书提供了一系列练习；很多练习都要求读者重新实现一些开创性实验并对其进行扩展。复杂性吸引人的一个地方在于我们可以通过适当的编程技能与数学知识接触研究前沿。这本书的内容覆盖：小世界图，无标度网络，细胞自动机，生命游戏，分形，自组织临界性，基于主体的模型(agent based model) 及几个现实中的案例分析。是复杂性研究入门参考好书。另外本书还可以用作Python编程与算法的大学中级课程教材。既是你对python和算法一无所知，其前三章的内容也可以让你能够接着看下去。《复杂_诞生于秩序与混沌边缘的科学》这是一本老书了，“类似于纪实小说，介绍了复杂性科学的研究中心圣塔菲研究所建立、发展的情况。你会看到那些不同领域的人是怎样由于共同的志趣走到了一起，以及又是如何涌现出诸如遗传算法、人工生命、细胞自动机、正反馈经济系统、动态博弈系统等等新思想的。这本书以小说一样的手法介绍了研究所里面个个人物的动人故事，以及他们研究的那些激动人心的成果。这本书的出版可以说给中国的学术界打开了一扇窗子，让我们真正的了解了国外的复杂性科学。有人称这本书是复杂性科学的圣经是不为过的。”大师说科学与哲学计算机与复杂性科学的兴起这是作者著名物理学家兼科学作家海因茨•R.帕格尔斯的遗作。是一本随笔集，将科学讨论带往更高层次，除了预言复杂性科学对人类的影响，也讨论了分道扬镳的科学与哲学如何才能重新融合。书中论及的话题包括：生物组织原理的重要性、以计算法来看数学及物理过程、并行计算网络以及非线性动力学的重要性、对混沌的了解、实验数学、神经网络和平行分配处理。下面的书将说说人类最担心的强AI的出现。Life 3.0世界两个顶级学术期刊\"nature\" 和“Science” 上每周都会推荐几本新出的科学主题的科普书，而一本书若是能同时被这俩家杂志推荐，则更是难得。今年8月25号出版《life 3.0》正是这样一本书，这本书的副标题是在人工智能的时代作为人意味着什么，作者不是专职搞计算机的，而是本行物理的普林斯顿教授。超级智能很多人提到强AI，说起的第一本书就是这个。本书作者尼克‧波斯特洛姆，全球著名思想家，牛津大学人类未来研究院的院长，哲学家和超人类主义学家。在这本书中，作者谈到了超级智能的优势所带来的风险，也谈到了人类如何解决这种风险。作者认为，他的这本书提到的问题将是我们人类所面临的最大风险。人工智能革命：超级智能时代的人类命运本书的难得之处还在于，它既不哗众取宠，也没有把问题过分简单化。本书作者毕业于蔡斯牛津大学哲学系，本书在人工智能的憧憬与危机之间敏锐地寻找平衡，对于所有好奇当今世界正在发生什么、我们是怎样走到今天、又将走向何方的人来说，本书都是一本必读书。如何思考会思考的机器关于强AI，一定需要大众的讨论，而这本书由世界上最聪明的头脑共同写成。包括全 球大数据权威阿莱克斯•彭特兰、世界顶级语言学家史蒂芬•平克、生物地理学家贾雷德•戴蒙德、互联网思想家凯文•凯利、《全球概览》创始人斯图尔特•布兰德等Edge 网站出品，必属精品。我们最后的发明这本书是一个纪录片导演的末世预言，核心观点是ASI（超级人工智能）极有可能毁灭人类，然后细致地逐个批判了库兹韦尔等乐观派。这本书的好处是好玩、有趣、思路清奇、剑出偏锋，但从知识的角度来说，它其实不是那么“科学”、不那么“理性”接着来说最火的深度学习白话深度学习与TensorFlow白话深度学习与TensorFlow这本书覆盖了深度学习的诸多概念，内容全面，看完了这本书，你就懂了深度学习这个领域的行话了。这本书也许不会教会你代码或者tensorflow，但却能让你明白深度学习是什么。书中包含很多具体例子，作者有丰富的实践经验。机器学习之路机器学习之路这本书从内容方面本书共包含两部分：机器学习篇和深度学习篇。这本书避过数学推导等复杂的理论推衍，介绍模型背后的一些简单直观的理解，以及如何上手使用。这本书适合有一些编程和自学能力，但数学等基础理论能力不足的人群。深度学习与R语言说起深度学习，想到的都是python为基础的语言，其实作为一种开源的数据建模语言，R也是可以做深度学习的。这本书介绍了深度学习基础知识后，着重介绍两种不那么流行的网络结构，受限玻耳兹曼机和深度置信网络，并通过生物信息和自然语言处理领域的实际例子来说明深度学习的优势和局限。最后说说AI的历史科学的极致 漫谈人工智能集智俱乐部有一群有激情有实力的小伙伴，其中既有来自学术界的张江教授，也有基于深度学习开发了彩云天气，彩云翻译等APP的创业者。而这本书则是集智众人的智慧结晶。这本书由于是中国人写成，所以避免了翻译作品的语言障碍。杨澜曾经在她的博客中推荐过这本书，说她从这本书中收获甚多，可见这本书是很容易读懂的。正如书名所显示，这本书涉及诸多人工智能领域。而书中诸多的插图，例子和参考文献则让这本书赢在了细节上。贤二机器僧漫游人工智能这本书贤二诞生的初衷和过程。书中的漫画超有趣。贤二机器僧这样一个传统佛法与现代科技相结合的产物表明，科技本身没有对错、好坏，它是中性的，但人的心却可善可恶。佛教徒不应该排斥科学，而应该拥抱科学，善于运用科技手段和成果，成就更多利于他人的事业。硅谷之谜作为浪潮之巅的续集，读完了这本书，想说的是硅谷的历史是不可复制的，AI的发展，是伴随着大公司的成败而起的。我们已经站在了AI发展的最前沿，不能只照搬前人的经验了。要做的是透彻的明白工业时代和后工业时代的本质，用一种全新的基于信息论、控制论、系统论的思维方式来从下而上的去想问题。"}
