{"content2":"今日CS.CV计算机视觉论文速览\nFri, 22 Feb 2019\nTotally 20 papers\nDaily Computer Vision Papers\n[1] **Title: Deep CNN-based Speech Balloon Detection and Segmentation for Comic Books\nAuthors:David Dubray, Jochen Laubrock\n[2] Title: Boundary-weighted Domain Adaptive Neural Network for Prostate MR Image Segmentation\nAuthors:Qikui Zhu, Bo Du, Pingkun Yan\n[3] *Title: Cross-Sensor Periocular Biometrics: A Comparative Benchmark including Smartphone Authentication\nAuthors:Fernando Alonso-Fernandez, Kiran B. Raja, R. Raghavendra, Cristoph Busch, Josef Bigun, Ruben Vera-Rodriguez, Julian Fierrez\n[4] **Title: GSLAM: A General SLAM Framework and Benchmark\nAuthors:Yong Zhao, Shibiao Xu, Shuhui Bu, Hongkai Jiang, Pengcheng Han\n[5] *Title: A Parallel Optical Image Security System with Cascaded Phase-only Masks\nAuthors:Shuming Jiao, Yang Gao, Ting Lei, Zhenwei Xie, Xiaocong Yuan\n[6] **Title: A Joint Deep Learning Approach for Automated Liver and Tumor Segmentation\nAuthors:Nadja Gruber, Stephan Antholzer, Werner Jaschke, Christian Kremser, Markus Haltmeier\n[7] Title: Deep Discriminative Representation Learning with Attention Map for Scene Classification\nAuthors:Jun Li, Daoyu Lin, Yang Wang, Guangluan Xu, Chibiao Ding\n[8] Title: ComplexFace: a Multi-Representation Approach for Image Classification with Small Dataset\nAuthors:Guiying Zhang, Yuxin Cui, Yong Zhao, Jianjun Hu\n[9] **Title: Long-Bone Fracture Detection using Artificial Neural Networks based on Contour Features of X-ray Images\nAuthors:Alice Yi Yang, Ling Cheng\n[10] **Title: Towards Real-time Eyeblink Detection in The Wild:Dataset,Theory and Practices\nAuthors:Guilei Hu, Yang Xiao, Zhiguo Cao, Lubin Meng, Zhiwen Fang, Joey Tianyi Zhou\n[11] *Title: Evaluation of Algorithms for Multi-Modality Whole Heart Segmentation: An Open-Access Grand Challenge\nAuthors:Xiahai Zhuang, Lei Li, Christian Payer, Darko Stern, Martin Urschler, Mattias P. Heinrich, Julien Oster, Chunliang Wang, Orjan Smedby, Cheng Bian, Xin Yang, Pheng-Ann Heng, Aliasghar Mortazi, Ulas Bagci, Guanyu Yang, Chenchen Sun, Gaetan Galisot, Jean-Yves Ramel, Thierry Brouard, Qianqian Tong, Weixin Si, Xiangyun Liao, Guodong Zeng, Zenglin Shi, Guoyan Zheng, Chengjia Wang, Tom MacGillivray, David Newby, Kawal Rhode, Sebastien Ourselin, Raad Mohiaddin, Jennifer Keegan, David Firmin, Guang Yang\n[12] Title: Atrial Scar Quantification via Multi-scale CNN in the Graph-cuts Framework\nAuthors:Lei Li, Fuping Wu, Guang Yang, Lingchao Xu, Tom Wong, Raad Mohiaddin, David Firmin, Jennifer Keegan, Xiahai Zhuang\n[13] Title: Improvement Multi-Stage Model for Human Pose Estimation\nAuthors:Zhihui Su, Ming Ye, Guohui Zhang, Lei Dai, Jianda Sheng\n[14] Title: Class-independent sequential full image segmentation, using a convolutional net that finds a segment within an attention region, given a pointer pixel within this segment\nAuthors:Sagi Eppel\n[15] Title: Perceptual Quality-preserving Black-Box Attack against Deep Learning Image Classifiers\nAuthors:Diego Gragnaniello, Francesco Marra, Giovanni Poggi, Luisa Verdoliva\n[16] *Title: Self-supervised Learning for Dense Depth Estimation in Monocular Endoscopy\nAuthors:Xingtong Liu, Ayushi Sinha, Masaru Ishii, Gregory D. Hager, Austin Reiter, Russell H. Taylor, Mathias Unberath\n[17] Title: Adversarial Augmentation for Enhancing Classification of Mammography Images\nAuthors:Lukas Jendele, Ondrej Skopek, Anton S. Becker, Ender Konukoglu\n[18] Title: Domain Partitioning Network\nAuthors:Botos Csaba, Adnane Boukhayma, Viveka Kulharia, András Horváth, Philip H. S. Torr\n[19] *Title: Cloud-Based Autonomous Indoor Navigation: A Case Study\nAuthors:Uthman Baroudi, M. Alharbi, K. Alhouty, H. Baafeef, K. Alofi\n[20] Title: Probabilistic Neural-symbolic Models for Interpretable Visual Question Answering\nAuthors:Ramakrishna Vedantam, Karan Desai, Stefan Lee, Marcus Rohrbach, Dhruv Batra, Devi Parikh\nPapers from arxiv.org\n更多精彩请移步主页\nInteresting:\n📚\npic from pixels.com"}
