{"content2":"特伦斯·谢诺夫斯基《深度学习：智能时代的核心驱动力量》，《The Deep Learning Revolution》, terrence j. sejnowski pdf特伦斯·谢诺夫斯基是全球最大在线学习平台Coursera最受欢迎课程《学习如何学习》（Learning how to learn）主理人，该课程学习人数已经超过了300万。 [8]作为神经网络的先驱，早在1986年，特伦斯就与杰弗里·辛顿共同发明了玻尔兹曼机。 [7]2004年，特伦斯·谢诺夫斯基担任索尔克研究所Francis Crick教授，以及克里克-雅各布理论和计算生物学中心主任。编辑推荐★ 【不是所有写深度学习的书你都能读得懂。】以堪比文学书的流畅，引领你了解人工智能井喷式发展的真相。★ 【深度学习会扩大你的认知，人工智能不是生存威胁。】这本书所讲的内容，与每个人的生活息息相关。AlphaGo、自动驾驶、语音识别、智能翻译、AI医疗、图像识别……你所看到的各种形式的人工智能，背后都是深度学习在发挥作用。这本书将告诉你，深度学习有哪些神奇之处，并对你产生哪些影响。★ 【人工智能大牛作者重磅作品】世界十大AI科学家之一、美国“四院院士”（全美在世仅3位）、全球人工智能专业会议NIPS基金会主席特伦斯·谢诺夫斯基（Terrence/Terry Sejnowski）力作。★ 【AI女神、AI教父联袂推荐】谷歌前云AI负责人、斯坦福大学HAI研究院联合创始人 李飞飞、AI教父杰弗里·辛顿诚挚推荐★ 【风靡全球，多语种同步上市】风靡全球的智能时代前沿读本，全景展示深度学习的发展与应用。被翻译成多国语言，300万+用户一致好评。★ 【想了解深度学习，读这本就够了。】很多信息都在传递AI会给我们带来革命性的巨变，却只点出了表象，而这本书将从AI的源头——深度学习开始，讲述这个智能时代核心驱动力量如何一步步影响科技、商业乃至整个世界的进步。名人推荐\"特伦斯是一名杰出的神经科学家，我们于1986年共同发明了玻尔兹曼机。——AI教父 杰弗里·辛顿人工智能是科技王冠上的钻石，而深度学习代表了其中一个承上启下的重要阶段。这本书有助于在我们心目中更加清晰准确地绘制人工智能的未来图景。你可以从本书中了解到那些令人惊讶，甚至于有些担忧的科技进展，大致了解它们背后的原理。这展现了人工智能相对于人类而言的单方面优势。你也能看到许多真实事例，反映了人工智能相对于人类而言的“笨拙”。在现实中，这种“笨拙”的情况往往更加普遍。这些事例有时令人忍俊不禁，它恰恰体现了我们人类的大脑是多么精妙的设计。——微软小冰之父、微软（亚洲）互联网工程院副院长 李笛特伦斯·谢诺夫斯基作为深度学习领域的先驱，带领该领域由理论命题走向实证科学。这是一大飞跃。——诺贝尔生理学或医学奖得主 埃里克·坎德尔作为深度学习领域的亲历者，以及深度学习灵魂人物的同行者，谢诺夫斯基分享了这一技术发展过程中的洞见和轶事。这本书记录了人工智能这场狂飙运动，字里行间都能感受到作者的兴奋和投入。——互联网之父、谷歌副总裁 文顿·瑟夫人工智能正在觉醒，世界正在被重塑。深度学习正是这一变化背后的驱动力。特伦斯·谢诺夫斯基扎根该领域研究30年，是绝对的先驱。如果你想了解人工智能，必读此书。——麻省理工学院斯隆商学院教授 埃里克·布林约尔夫松作者简介特伦斯·谢诺夫斯基 Terrence (Terry) Sejnowski世界十大AI科学家之一，美国四大国家学院（国家科学院、国家医学院、国家工程院、国家艺术与科学学院）在世仅3位的“四院院士”之一，全球AI专业会议NIPS基金会主席。作为神经网络的先驱，早在1986年，特伦斯就与杰弗里·辛顿共同发明了玻尔兹曼机，把神经网络带入到研究与应用的热潮，将深度学习从边缘课题变成了互联网科技公司仰赖的核心技术，实现了人工智能井喷式的发展。特伦斯现任美国索尔克生物研究所(美国生命科学领域成果最多的研究机构) 计算神经生物学实验室主任，是美国政府注资50亿美元“脑计划”项目（BRAIN，the Brain Research through Advancing Innovative Neurotechnologies）领军人物。特伦斯同时是全球最大在线学习平台Coursera很受欢迎课程《学习如何学习》（Learning how to learn）主理人，通过系统讲解大脑认知的底层知识，让学习者可以改变思维模式，提高学习的能力和效率。目前该课程学习人数已经超过了300万。目录推 荐 序 面对科技拐点，我们的判断与选择中文版序 人工智能会放大认知能力前 言 深度学习与智能的本质第一部分 智能的新构想01 机器学习的崛起汽车新生态：无人驾驶将全面走入人们生活自然语言翻译：从语言到句子的飞跃语音识别：实时跨文化交流不再遥远AI医疗：医学诊断将更加准确金融科技：利用数据和算法获取最佳回报深度法律：效率的提高与费用的降低德州扑克：当机器智能学会了虚张声势AlphaGo奇迹：神经科学与人工智能的协同弗林效应：深度学习让人类更加智能新教育体系：每个人都需要终身学习正面影响：新兴技术不是生存威胁回到未来：当人类智能遇到人工智能02 人工智能的重生看似简单的视觉识别计算机视觉的进步早期人工智能发展缓慢从神经网络到人工智能03 神经网络的黎明深度学习的起点从样本中学习利用感知器区分性别被低估的神经网络04 大脑式的计算网络模型能够模仿智能行为神经网络先驱者乔治·布尔与机器学习利用神经科学理解大脑大脑如何处理问题计算神经科学的兴起05 洞察视觉系统人眼是如何看到东西的大脑皮层中的视觉突触的可塑性通过阴影脑补立体全貌视觉区域的层级结构认知神经科学的诞生第二部分 深度学习的演进06 语音识别的突破在嘈杂中找到你的声音将独立分量分析应用于大脑什么在操控我们的言行07 霍普菲尔德网络和玻尔兹曼机约翰·霍普菲尔德的伟大之处内容可寻址存储器局部最小值与全局最小值玻尔兹曼机赫布理论学习识别镜像对称学习识别手写数字无监督学习和皮层发育08 反向传播算法算法的优化语音合成的突破神经网络的重生理解真正的深度学习神经网络的局限性09 卷积学习机器学习的稳步发展卷积网络的渐进式改进当深度学习遇到视觉层级结构有工作记忆的神经网络生成式对抗网络应对现实社会的复杂性10 奖励学习机器如何学会下棋大脑的奖励机制用“感知-行动”框架提高绩效学习如何翱翔学习如何歌唱人工智能的可塑性更多需要被解决的问题11 火爆的NIPS为什么NIPS如此受欢迎谁拥有最多数据，谁就是赢家为未来做准备第三部分 人类，智能与未来12 智能时代21世纪的生活未来的身份认证社交机器人的崛起机器已经会识别人类面部表情新技术改变教育方式成为更好的学习者训练你的大脑智能商业13 算法驱动用算法把复杂问题简单化理解、分析复杂系统大脑的逻辑深度尝试所有可能的策略14 芯片崛起神经形态芯片视网膜芯片神经形态工程摩尔定律的终结15 信息科学用字节丈量世界用数学思维解决通信难题预测是如何产生的深度理解大脑大脑的操作系统生物学与计算科学人工智能能拥有媲美人类大脑的操作系统16 生命与意识视觉意识视觉感知的过程视觉感知的时机视觉感知的部位视觉搜索的机理创造意识比理解意识更容易17 进化的力量大自然比我们聪明认知科学的兴起不能把语言问题只留给语言学家难预测的行为规律神经网络的寒冬从深度学习到通用人工智能18 深度智能遗传密码每个物种都有智能进化的起源人类终将解决智能难题\"序言面对科技拐点，我们的判断与选择李笛微软小冰之父、微软（亚洲）互联网工程院副院长在近年来陆续出版的、解读人工智能技术与趋势的许多书籍中，这是一本不可多得的好书。它的阅读过程令人愉悦，涉及的知识深度又比较恰当。因此，即使是不具备相关领域知识背景的读者，也能够轻松地读完它。人们完全可以利用“碎片时间”来研读这本30多万字的大作，从而集中了解到与人工智能相关的技术分支、组织人物与重要事件。在人工智能热度很高的当下，这本书的价值在于，帮助读者建立一种相对贴近事实的科学观。读者可以把这本书当作一本有关人工智能的简明历史来看待。人工智能是科技王冠上的钻石，而深度学习代表了其中一个承上启下的重要阶段。深度学习脱胎于科学家们六十多年前开始的人工智能研究，其自身的概念形成，到落地开花，则只有十多年的光景。与过去相比，深度学习极大地推进了人工智能各个分支课题的发展速度；与未来相比，我们今天所取得的一切成果，都是非常粗糙的，注定会被更好的成果取代。因此，了解深度学习，就如同站在一个关键的节点上向时间河流的上下游看，一览无遗。我相信，不同的人会从这本书中得到不同的收获。总体而言，这本书有助于在我们心目中更加清晰准确地绘制人工智能的未来图景。从某种意义上说，所有的过去亦都昭示了未来，但我更建议读者以最轻松的心态来阅读它。因为这样，能够让读者以更加客观公正的视角去检阅人类与机器的能力短板与优长——你可以从本书中了解到那些令人惊讶，甚至于有些担忧的科技进展，大致了解它们背后的原理。这展现了人工智能相对于人类而言的单方面优势。另一方面，你也能看到许多真实事例，反映了人工智能相对于人类而言的“笨拙”。科学与科学幻想泾渭分明。在现实中，这种“笨拙”的情况往往更加普遍。这些事例有时令人忍俊不禁，它恰恰体现了我们人类的大脑是多么精妙的设计。事实上，在我看来，当下最令人彷徨不定的，并不是人工智能有多么“强大”或有多么“笨拙”，而是我们已处在一个科技的拐点，需要由我们每个人对未来的走向做出抉择。这是一个非常具有现实意义的话题。虽然深度学习是这个拐点的主要推动力之一，但它并不需要为我们的困扰承担责任： 选择权的困扰：一辆无人汽车行驶在道路上，假设突然面临必然要发生的车祸，它应当向左撞向一个无辜的老人，还是向右撞向一个无辜的壮年？ 决策权的困扰：一个系统可以基于人类个体不具备的广泛即时的大数据，用任何人无法企及的速度，迅速做出某个决策。这样的洞察和决策力，应该掌握在谁的手中？ 工作权的困扰：一项基于人工智能的技术可以比人类以更好的质量和速度去完成某项生产。这项技术应该归属于工厂主来代替工人，还是应该归属于工人来帮助工厂主更好地完成工作？前者会带来失业，而后者有望带来更高的工作效率。 社会层面的困扰：一个面向情感的人工智能机器人帮助一个人解决孤单，却使他主动减少了与他人的社交沟通。这种陪伴究竟是在帮他解决问题，还是制造了更多的问题？ 技术滥用的困扰：一项技术可以帮助任何人打造与他们高度相似的语音，制造出来的声音，令他的家人也难辨真假。这样的技术会不会被别有用心的人用于犯罪，例如诈骗电话？不知不觉间，这些看似遥远的事，突然间已变成我们必须要面对的现实情况，而我们也已经在上述一些场景中做出了初步的抉择。其中一个关键因素是，人们常常对人工智能的“智商”印象深刻，但往往忽略了：人工智能系统化的优势之一在于“大规模的并发”。因此，任何一种以上技术应用的场景，只要乘以巨大的人口，都会带来很大的影响。相对而言，在围棋游戏中赢过人类，其实是最不需要担忧的了。在微软，我们最近成立了与人工智能及伦理相关的组织，力图在当前的框架内去发现尽量多的问题，尽可能在早期就避免问题的发生。微软在人工智能领域的技术和产品线很广泛，因此我们做过的抉择也相对较多。这些抉择往往决定了我们在有能力的情况下，主动放弃去做什么。这意味着克制与敬畏之心。例如：微软小冰在两年前推出拟人的全双工语音电话技术（Full Duplex）时，我们就制定了该产品的伦理规则，不允许在用户不知情的情况下，让小冰伪装成真人去拨打电话。我们也不使用微软小冰的技术去从事呼叫中心的外呼业务，因为它存在被滥用为垃圾广告电话的风险——尽管这些往往意味着巨大的商业价值。今天，在中国、美国、日本、印度和印度尼西亚，微软小冰拥有近7亿人类用户，如果她在对话的时候努力诱导人们去购买某种商品，显然会带来可观的收入预期。但谁会愿意和一个一心想着如何诱导你买东西的人成为知己呢？这种克制，不仅仅是一两家企业的责任。它依赖于整个社会对人工智能，特别是深度学习相关技术的了解。对技术的了解越普遍，也就越能帮助企业更好地运用手中的技术，进而帮助我们每一个人获得更好的生活，享受人工智能为我们带来的价值。在我看来，这就是这本书所具有的现实意义。它并非教科书，而是一本面向未来的历史书。它揭示了人工智能有望给世界、给人类带来的巨大改变，远超我们现在所能想象到的全双工语音、人脸识别、情感计算甚至是自动驾驶。换句话说，基于我们现在的技术和产品水平，相信许多人已能在脑海中比较清晰地勾勒出，自己在马路上与一辆并没有司机驾驶的汽车相遇的场景。但与人工智能即将展现的伟大图景相比，这些都不值一提。文摘不久之前，人们还常说，计算机视觉的辨别能力尚不如一岁大的孩子。如今看来，这句话要改写了。计算机不仅能和大多数成年人一样识别图片中的物体，在马路上驾驶汽车的安全性还高过16 岁的青少年。更神奇的是，如今的计算机不再是被动按照指令识别和驾驶，而是像自然界的生命由数百万年前开始进化那样，自主地从经验中学习。是数据的井喷促成了这一技术进步。如果说数据是新时代的石油，那么学习算法就是从中提取信息的炼油厂；信息积累成知识；知识深化成理解；理解演变为智慧。欢迎来到深度学习的新世界。深度学习是机器学习的一个分支，它根植于数学、计算机科学和神经科学。深度网络从数据中学习，就像婴儿了解周围世界那样，从睁开眼睛开始，慢慢获得驾驭新环境所需的技能。深度学习的起源可以追溯到20 世纪50 年代人工智能的诞生。关于如何构建人工智能，当时存在两种不同的观点：一种观点主张基于逻辑和计算机程序，曾主宰人工智能的研究和应用数十年；另一种观点则主张直接从数据中学习，经历了更长时间的摸索才逐渐成熟。20 世纪，计算机技术还不够成熟，而且按照现在的标准，数据存储成本十分高昂，用逻辑程序来解决问题更加高效。熟练的程序员需要为每个不同的问题编写不同的程序，问题越大，相应的程序也就越复杂。如今，计算机能力日趋强大，数据资源也变得庞大且丰富，使用学习算法解决问题比以前更快、更准确，也更高效。此外，同样的学习算法还能用来解决许多不同的难题，这远比为每个问题编写不同的程序更加节省人力。本书的初稿是我在太平洋西北地区徒步旅行，并思索了近几十年来人工智能领域的显著变化之后写出来的。……地球上的生命充满了无数奥秘，但最具挑战性的也许是智能的本质。自然界充斥着各种形式的智能，从微小的细菌到复杂的人类智能，每种智能都适应了它在自然界中的位置。人工智能也将以多种形式出现，并在智能族谱中占据特殊的位置。随着基于深度神经网络的机器智能日渐成熟，它可以为生物智能提供一个新的概念框架。这是一本关于深度学习的过去、现在和未来的指南。不过本书并不是对该领域发展历史的全面梳理，而是记录了这一领域重要概念的进步及其背后研究群体的个人观点。人类的记忆并不可靠，对故事的每次复述都会导致记忆的偏差，这个过程叫作“重整记忆”。这本书中的故事延续了40 多年，尽管有些对我来说依然历历在目，就像昨天刚发生的一样，但我很清楚，那些故事在我的记忆中不断被复述时，有些细节已经悄悄地被改写了。本书有两个相互交织的主题：人类智能是如何进化的，以及人工智能会如何演变。这两种智能之间的巨大差异在于，人类智能的进化经历了数百万年的时间，而人工智能在最近几十年才发展起来。尽管对于文化演变来说，这个速度仍然是快得出奇，但是过于谨小慎微可能并不是个正确的选择。"}
