{"content2":"北京 | 高性能计算之GPU CUDA课程11月24-26日3天密集学习 快速带你晋级阅读全文>\n沙韬伟，苏宁易购高级算法工程师。\n曾任职于Hewlett-Packard、滴滴出行。\n数据学院特邀讲师。\n主要研究方向包括风控、推荐和半监督学习。目前专注于基于深度学习及集成模型下的用户行为模式的识别。\n目标导向，不谈其他的方向，只谈如何快速拿到数据挖掘的offer。\n\n我选择了公司的校招中比较严格的（top5%）一个jd要求，我们看下如何拿下这个offer。\n计算机或者数学等相关专业学历\n无论你是什么专业的，大学有个选修课的东西，很多人都是用来混学分的，你可以去选择比如“数理统计选修”、“概率论选修”、“算法基础”这些课，挂了不影响绩点，但是你考的好可以给之后找工作带来很高加分，你的老板会认为你是一个热爱数据挖掘并且有长远计划的人。\n在机器学习、数据挖掘、统计学理论、最优化理论等领域有着深厚积累\n“全栈工程师”在我心中一直是伟大的存在，但是对于本科毕业，选择专精很重要。推荐几个方向：用户研究（征信、消费者研究），图像音频分析（讯飞之流），异常分析（风控、物流），订单预测等等，你在一方面研究的比较深，就算是应届生，但是比起像我这种三四年的老油条，老板更喜欢培养这样带有“天赋专精”的白纸。\n熟悉机器学习和数据挖掘领域前言技术\n前沿技术是一个比较宽泛的词，相信我，面试你的人每天从早上10点加班到晚上10点，周末还要打游戏，他自己都不知道啥叫前沿技术，平时打好基础，老板基础问不倒的时候，你就已经在候选人名单里面了。\n在国际顶级回忆和期刊以第一作者发表过高水瓶论文者优先\n这点我也做不到，我就不bb了。\n在机器学习、数据挖掘等相关项目实际经验者或者知名数据挖掘比赛（例如KDD Cup等）中取得领先名次者优先\n这个是非常重要的。\n在应届生面前，成绩是没有区分能力的，老板在乎的是你入职后给公司带来的利益而不是你是不是学生会主席这些毫无意义的事情。我走的是前面这条路，分享一下我的套路。我大三的时候参加了百度的某个不知名比赛，拿了区的入围奖，然后拿着这个入围奖参加中国电信实习生招聘，大四凭借一年电信实习经验去了惠普的数据挖掘实验室继续实习，完整的做了2个项目后正式入职现公司。\n分析下来就是，刚开始是弱鸡，所以采取了一些简单的途径拿到一些听起来很厉害但是很弱鸡的奖，再借这个奖混进一些容易被唬住的公司（没有黑电信的意思），之后在凭借工作经验进入一些能够给你机会的地方（就是让你自己带一些项目），好好做几个优秀的项目（这个比较难，看命），然后达成你的目标。想一下子第一很难，但是我们可以做一个长远的规划，先前100，再前50，再前10，再第一。\n编程基础扎实，熟悉算法数据结构，有多年scala或python开发经验\n我大学的时候学校教了spss，但是我当时考虑的是外面企业都是抠x。应该不会买，果然毕业之后，R语言、Python火的不行，建议选择一门你喜欢的开源语言，去写code练吧，网上很多撕逼的问题比如“php是不是最好的编程语言”，其实，选择一个你最适应的就行，别在乎别人怎么bb，因为最后要用的人是你自己。\n有大数据相关系统，拥有map-reduce、sprak、实时计算等经验\n这个需要回到第5条，我在大学里面的时候，老师就忽悠我，说什么mysql足够了，而且一般学校不会搭建Hadoop这些平台，搭建成本高，维护成本高。建议混入一些“高端的”公司，请里面的老油条两三顿夜宵，给你开个查询权限，相信我，从菜鸟到乳鸽，你只需要1个月的时间。\n踏实勤奋、自我驱动、善于沟通\n个人感觉数据挖掘岗位需要强迫自己拥有三个技能。\n1）快速学习能力，永远不知道下一个火起来的算法是啥\n2）数据敏感力，数据挖掘的下限取决于勤奋，上限取决于数据敏感程度\n3）沟通能力，你要让你的boss相信你做的Random forest结果，你需要先说服他，我做的是靠谱的。\n原文链接：http://www.jianshu.com/p/328fafc251f1\n查阅更为简洁方便的分类文章以及最新的课程、产品信息，请移步至全新呈现的“LeadAI学院官网”：\nwww.leadai.org\n请关注人工智能LeadAI公众号，查看更多专业文章\n大家都在看\nLSTM模型在问答系统中的应用\n基于TensorFlow的神经网络解决用户流失概览问题\n最全常见算法工程师面试题目整理（一）\n最全常见算法工程师面试题目整理（二）\nTensorFlow从1到2 | 第三章 深度学习革命的开端：卷积神经网络\n装饰器 | Python高级编程\n今天不如来复习下Python基础\n点击“阅读原文”直接打开【北京站 | GPU CUDA 进阶课程】报名链接"}
