{"content2":"今日CS.CV计算机视觉论文速览Mon, 18 Mar 2019Totally 48 papersDaily Computer Vision Papers[1] Title: Adversarial Joint Image and Pose Distribution Learning for Camera Pose Regression and RefinementAuthors:Mai Bui, Christoph Baur, Nassir Navab, Slobodan Ilic, Shadi Albarqouni[2] Title: PifPaf: Composite Fields for Human Pose EstimationAuthors:Sven Kreiss, Lorenzo Bertoni, Alexandre Alahi[3] Title: Selective Kernel NetworksAuthors:Xiang Li, Wenhai Wang, Xiaolin Hu, Jian Yang[4] Title: Unsupervised and interpretable scene discovery with Discrete-Attend-Infer-RepeatAuthors:Duo Wang, Mateja Jamnik, Pietro Lio[5] Title: Inserting Videos into VideosAuthors:Donghoon Lee, Tomas Pfister, Ming-Hsuan Yang[6] Title: Multi-label Cloud Segmentation Using a Deep NetworkAuthors:Soumyabrata Dev, Shilpa Manandhar, Yee Hui Lee, Stefan Winkler[7] Title: Constrained Mutual Convex Cone Method for Image Set Based RecognitionAuthors:Naoya Sogi, Rui Zhu, Jing-Hao Xue, Kazuhiro Fukui[8] Title: Superpixel Contracted Graph-Based Learning for Hyperspectral Image ClassificationAuthors:Philip Sellars, Angelica Aviles-Rivero, Carola-Bibiane Schönlieb[9] Title: Age prediction using a large chest X-ray datasetAuthors:Alexandros Karargyris, Satyananda Kashyap, Joy T Wu, Arjun Sharma, Mehdi Moradi, Tanveer Syeda-Mahmood[10] Title: Alignment Based Matching Networks for One-Shot Classification and Open-Set RecognitionAuthors:Paresh Malalur, Tommi Jaakkola[11] Title: Multi-Representational Learning for Offline Signature Verification using Multi-Loss Snapshot Ensemble of CNNsAuthors:Saeed Masoudnia, Omid Mersa, Babak N. Araabi, Abdol-Hossein Vahabie, Mohammad Amin Sadeghi, Majid Nili Ahmadabadi[12] Title: Bringing Blurry Alive at High Frame-Rate with an Event CameraAuthors:Liyuan Pan, Richard Hartley, Cedric Scheerlinck, Miaomiao Liu, Xin Yu, Yuchao Dai[13] Title: Spiking-YOLO: Spiking Neural Network for Real-time Object DetectionAuthors:Seijoon Kim, Seongsik Park, Byunggook Na, Sungroh Yoon[14] Title: Noisy Supervision for Correcting Misaligned Cadaster Maps Without Perfect Ground Truth DataAuthors:Nicolas Girard (UCA, TITANE), Guillaume Charpiat (TAU), Yuliya Tarabalka (UCA, TITANE)[15] Title: GolfDB: A Video Database for Golf Swing SequencingAuthors:William McNally, Kanav Vats, Tyler Pinto, Chris Dulhanty, John McPhee, Alexander Wong[16] Title: Phenotypic Profiling of High Throughput Imaging Screens with Generic Deep Convolutional FeaturesAuthors:Philip T. Jackson, Yinhai Wang, Sinead Knight, Hongming Chen, Thierry Dorval, Martin Brown, Claus Bendtsen, Boguslaw Obara[17] Title: SceneCode: Monocular Dense Semantic Reconstruction using Learned Encoded Scene RepresentationAuthors:Shuaifeng Zhi, Michael Bloesch, Stefan Leutenegger, Andrew J. Davison[18] Title: DeepHuman: 3D Human Reconstruction from a Single ImageAuthors:Zerong Zheng, Tao Yu, Yixuan Wei, Qionghai Dai, Yebin Liu[19] Title: BLVD: Building A Large-scale 5D Semantics Benchmark for Autonomous DrivingAuthors:Jianru Xue, Jianwu Fang, Tao Li, Bohua Zhang, Pu Zhang, Zhen Ye, Jian Dou[20] Title: Quality-aware Unpaired Image-to-Image TranslationAuthors:Lei Chen, Le Wu, Zhenzhen Hu, Meng Wang[21] Title: DFineNet: Ego-Motion Estimation and Depth Refinement from Sparse, Noisy Depth Input with RGB GuidanceAuthors:Yilun Zhang, Ty Nguyen, Ian D. Miller, hreyas S. Shivakumar, Steven Chen, Camillo J. Taylor, Vijay Kumar[22] Title: Did You Miss the Sign? A False Negative Alarm System for Traffic Sign DetectorsAuthors:Quazi Marufur Rahman, Niko Sünderhauf, Feras Dayoub[23] Title: Turbo Learning Framework for Human-Object Interactions Recognition and Human Pose EstimationAuthors:Wei Feng, Wentao Liu, Tong Li, Jing Peng, Chen Qian, Xiaolin Hu[24] Title: Unsupervised Deep Transfer Feature Learning for Medical Image ClassificationAuthors:Euijoon Ahn, Ashnil Kumar, Dagan Feng, Michael Fulham, Jinman Kim[25] Title: Flickr1024: A Dataset for Stereo Image Super-ResolutionAuthors:Yingqian Wang, Longguang Wang, Jungang Yang, Wei An, Yulan Guo[26] Title: Unsupervised Person Re-identification by Soft Multilabel LearningAuthors:Hong-Xing Yu, Wei-Shi Zheng, Ancong Wu, Xiaowei Guo, Shaogang Gong, Jian-Huang Lai[27] Title: SimulCap : Single-View Human Performance Capture with Cloth SimulationAuthors:Tao Yu, Zerong Zheng, Yuan Zhong, Jianhui Zhao, Qionghai Dai, Gerard Pons-Moll, Yebin Liu[28] Title: Pose Graph Optimization for Unsupervised Monocular Visual OdometryAuthors:Yang Li, Yoshitaka Ushiku, Tatsuya Harada[29] Title: Show, Translate and TellAuthors:Dheeraj Peri, Shagan Sah, Raymond Ptucha[30] Title: Distance Preserving Grid LayoutsAuthors:Gladys Hilasaca, Fernando V. Paulovich[31] Title: Graph Hierarchical Convolutional Recurrent Neural Network (GHCRNN) for Vehicle Condition PredictionAuthors:Mingming Lu, Kunfang Zhang, Haiying Liu, Naixue Xiong[32] Title: Mixture Modeling of Global Shape Priors and Autoencoding Local Intensity Priors for Left Atrium SegmentationAuthors:Tim Sodergren, Riddhish Bhalodia, Ross Whitaker, Joshua Cates, Nassir Marrouche, Shireen Elhabian[33] Title: Conditional GANs For Painting GenerationAuthors:Adeel Mufti, Biagio Antonelli, Julius Monello[34] Title: Hyperspectral Image Classification with Deep Metric Learning and Conditional Random FieldAuthors:Yi Liang, Xin Zhao, Alan J.X. Guo, Fei Zhu[35] Title: Unpaired image denoising using a generative adversarial network in X-ray CTAuthors:Hyoung Suk Park, Jineon Baek, Sun Kyoung You, Jae Kyu Choi, Jin Keun Seo[36] Title: Learning Robust Representations by Projecting Superficial Statistics OutAuthors:Haohan Wang, Zexue He, Zachary C. Lipton, Eric P. Xing[37] Title: Active Transfer Learning for Persian Offline Signature VerificationAuthors:Taraneh Younesian, Saeed Masoudnia, Reshad Hosseini, Babak N. Araabi[38] Title: Demonstration of Vector Flow Imaging using Convolutional Neural NetworksAuthors:Thomas Robins, Antonio Stanziola, Kai Reimer, Peter Weinberg, Meng-Xing Tang[39] Title: Object tracking in video signals using Compressive SensingAuthors:Marijana Kracunov, Milica Bastica, Jovana Tesovic[40] Title: Learning Representations from Persian Handwriting for Offline Signature Verification, a Deep Transfer Learning ApproachAuthors:Omid Mersa, Farhood Etaati, Saeed Masoudnia, Babak N. Araabi[41] Title: SuperTML: Two-Dimensional Word Embedding and Transfer Learning Using ImageNet Pretrained CNN Models for the Classifications on Tabular DataAuthors:Baohua Sun, Lin Yang, Wenhan Zhang, Michael Lin, Patrick Dong, Charles Young, Jason Dong[42] Title: Application-level Studies of Cellular Neural Network-based Hardware AcceleratorsAuthors:Qiuwen Lou, Indranil Palit, Tang Li, Andras Horvath, Michael Niemier, X. Sharon Hu[43] Title: TinBiNN: Tiny Binarized Neural Network Overlay in about 5,000 4-LUTs and 5mWAuthors:Guy G.F. Lemieux, Joe Edwards, Joel Vandergriendt, Aaron Severance, Ryan De Iaco, Abdullah Raouf, Hussein Osman, Tom Watzka, Satwant Singh[44] Title: Technically correct visualization of biological microscopic experimentsAuthors:Ganna Platonova, Dalibor Stys, Pavel Soucek, Petr Machacek, Vladimir Kotal, Renata Rychtarikova[45] Title: MFAS: Multimodal Fusion Architecture SearchAuthors:Juan-Manuel Pérez-Rúa, Valentin Vielzeuf, Stéphane Pateux, Moez Baccouche, Frédéric Jurie[46] Title: Integrating NVIDIA Deep Learning Accelerator (NVDLA) with RISC-V SoC on FireSimAuthors:Farzad Farshchi, Qijing Huang, Heechul Yun[47] Title: Stitching Videos from a Fisheye Lens Camera and a Wide-Angle Lens Camera for Telepresence RobotsAuthors:Yanmei Dong, Mingtao Pei, Lijia Zhang, Bin Xu, Yuwei Wu, Yunde Jia[48] Title: Learning to Generate the “Unseen” via Part Synthesis and CompositionAuthors:Nadav Schor, Oren Katzir, Hao Zhang, Daniel Cohen-OrPapers from arxiv.org更多精彩请移步主页Interesting:📚, (from):pic from pixels.com"}
