{"content2":"《人工智能》李开复，王永康著     出版时间：2017-05第一章 AI概念1.  Alpha Go（阿尔法狗）于2016年初出问世，是一种人机大战的围棋游戏，在它问世之前，围棋是一种机器无法战胜人类的唯一棋类比赛。当时，阿尔法狗与围棋世界冠军李世石对战，结果4比1大胜，它是第一个战胜人类职业围棋手的人工智能程序，由Google旗下的公司开发设计，主要原理是“深度学习”，利用大数据训练多层人工神经网络模型（ANNs数据处理中心）。2017年初后，升级版的Alpha Go更名为Master再次复出，对战中日韩顶尖的围棋手以60:0的绝对优势胜利，可谓笑傲棋坛、独孤求败。2.  人工智能无处不在人工智能跟我们的生活息息相关，已经成为我们生活的一部分，就存在于我们离不开的智能手机中，手机许多应用程序都是以人工智能技术为核心驱动力。比如美图秀秀、谷歌相机，利用人工智能技术进行图像检索，美化照片、具有补光、瘦脸等功能；滴滴出行使用人工智能技术定位用户所在位置，规划车辆调度方案并帮助司机选择最佳路线，更好地服务用户。在不久的将来，自动驾驶技术还将重新定义智能出行、智能交通和智能城市；淘宝、亚马逊等电商购物网站通过人工智能技术根据用户日常的搜索信息和订单信息推荐最适合使用的商品，而物流管理利用此技术操控仓储机器人、物流机器人和物流无人机帮助电商企业进行繁重的货物分拣工作；还有谷歌的翻译助手、实线多种语言之间的互译；再比如，手机浏览热点新闻是人们每天都要做的事。像今日头条、网易新闻等新闻类应用之所以如此火爆，就是其采用了人工智能技术，它能根据用户日常浏览的信息，很聪明地归纳出用户的个人喜好从而推送一些可能感兴趣的话题，甚至有大量的新闻稿件是人工智能程序自动撰写的。那智能推荐功能做的越好，用户就会感觉这款应用十分顺手，就像是量身定做的新闻管家。3.  一个机器自动撰写新闻稿件的真实例子2014年的清晨洛杉矶地面发生轻微晃动，这是一次震级不大但震源较浅的小地震。在不到三分钟的时间，当地时报就在网络上发布了关于这次地震的详细报道，由不眠不休的人工智能程序自动撰写的。地震瞬间，计算机就从地震台的数据接口中获取了所有数据，然后飞速生成全文，记者快速审阅后点击发布，一篇自动生成并经过人工复检的新闻稿就在第一时间问世了。4.  AI小百科：人工智能的科学的定义？智能搜索引擎、智能小助理（微软小冰、苹果Siri、谷歌Allo、亚马逊Alexa）、机器翻译、机器视觉（人脸识别）、自动驾驶、机器人等属于人工智能的范畴，但浏览器、手机操作系统、媒体播放器等不属于人工智能。以下的定义太片面：① 让人觉得不可思议的计算机程序：主观性太强。② 与人类思考方式相似：人脑是十分复杂的，人类自己都不清楚。③ 深度学习：可以作为一种精神。我理解：人工智能是帮助人类解决问题、提高生活质量的一种商业化技术手段。第二章 深度学习+大数据=AI1. 三次AI热潮① 西洋跳棋：1962年大战盲人跳棋高手② 国际象棋：1997年IBM公司的深蓝大战卡斯帕罗夫③ 围棋：2016年Alpha Go大战世界桂军李世石3:1前两次AI热潮与第三次有什么不同：前者是提出问题+学术研究主导，后者是解决实际问题+商业需求为主导。2.    (1). 机器视觉、人脸识别、自动驾驶、语音识别...因为人们一度觉得人工智能这个词是被过分夸大但实际却不怎么管用的技术，所以设计者经常回避这个词，替换成机器视觉、自动驾驶、语音识别、只能挖掘等具体应用领域的术语。(2). 绝对阈值：能引起人类感知反应（接受新事物）的最小刺激。3. 高德纳技术成熟度曲线绝大多数高新技术的发展历程：萌芽期-泡沫膨胀期-低谷期-稳定上升期-成熟期。技术人员和投资者也会根据高德纳曲线判断技术潮流和投资方向。4. 第一次AI热潮：艾伦·图灵（开创计算机科学和人工智能的科学巨匠）(1). 图灵奖：计算机领域的诺贝尔奖(2). 图灵测试：判断及其是否具有人类智慧测试过程：多位人类评判员通过键盘和屏幕同时与一个计算机程序和真人对话，5分钟后做出判断哪个是计算机，若这些评判员的错误率超过30%，则计算机程序视为通过图灵测试。人机对话本质是程序根据人类对话内容启动智能搜索引擎从海量的互联网知识库中搜索可能的问题与回答的组合，然后进行快速排序，这已经是一种非常成熟的技术了。5. 第二次AI热潮：语音识别苹果内置的语音输入法、科大讯飞语音输入法（400字/min，支持方言）深度学习原理是AI发展的一种核心技术，计算模型是多层人工神经网络。它首先应用在机器视觉，人脸识别、图形识别和识别视频中的物体等，随后在语音识别、自动驾驶、机器翻译等所有AI领域大展宏图。近几年，微软、IBM和谷歌等公司已用两三年的时间将识别错误率从20%降到6.3%。6. AI小百科：深度学习(1). 深度学习离不开大规模计算和大数据分析。(2). 理论定义：一种机器学习方法，利用数学模型对真实世界的特定问题进行建模，以解决该领域的相似问题。简单解释：小孩学认字。计算机经过反复看图训练，在CPU中总结规律（数学建模），下次看到类似图案就搜索之前总结的规律，就会“认字”了。(3). 专业解释：把计算机程序要学习的东西看成一大堆数据，经过数据处理网络（多层人工神经网络）检查是否符合条件，若符合就将其作为目标模型，若不符合就反复调整参数设置，直到符合条件。(4). 训练深度学习时，神经网络的可视化。7. AI小百科：大数据(1). 大数据就是有某种规律的海量数据，即训练样本，是深度学习最贵部分。(2). 大数据的三大支柱：信息储存、信息处理、信息交换。(3). 具有很强的时效性。(4). 实际应用：交通视频监控、图像中的人脸识别、电商平台交易（销售量和销售额）、售后智能客服等。(5). 潜在危害：为了推送精准的广告信息，程序会自动采集用户的个人喜好、购物习惯等数据，这些可能包含许多个人隐私。"}
