{"content2":"http://blog.csdn.net/douglax/article/details/9528297视觉引导的运动 如果你的应用需要一个视觉系统来引导机器人，那么必须知道视觉系统与运动系统是如何集成的。对于校准和操作，没集成的运动系统与视觉系统是初步的系统，机械人或机构和视觉系统是分开校准的。在操作中，一台独立的视觉系统根据在视觉坐标系统中的已知位置计算出零件位置的偏移量，然后发指令给机器人的手臂在离初始化编程的拾取位置的偏移量处拾取零件。由于机器视觉系统可以快速获取大量信息，而且易于自动处理，也易于同设计信息以及加工控制信息集成，因此，在现代自动化生产过程中，人们将机器视觉系统广泛地用于装配定位、产品质量检测、产品识别、产品尺寸测量等方面。机器视觉系统的特点是提高生产的柔性和自动化程度。在一些不适合于人工作业的危险工作环境或人工视觉难以满足要求的场合，常用机器视觉来替代人工视觉；同时在大批量工业生产过程中，用人工视觉检查产品质量效率低且精度不高，用机器视觉检测方法可以大大提高生产效率和生产的自动化程度。而且机器视觉易于实现信息集成，是实现计算机集成制造的基础技术。使用机器视觉系统五个主要原因：重复性——机器可以以相同的方法一次一次的完成检测工作而不会感到疲倦。与此相反，人眼每次检测产品时都会有细微的不同，即使产品时完全相同的。精确性——由于人眼有物理条件的限制，在精确性上机器有明显的优点。即使人眼依靠放大镜或显微镜来检测产品，机器仍然会更加精确，因为它的精度能够达到千分之一英寸。速度机器能够更快的检测产品。特别是当检测高速运动的物体时，比如说生产线上，机器能够提高生产效率。客观性——人眼检测还有一个致命的缺陷，就是情绪带来的主观性，检测结果会随工人心情的好坏产生变化，而机器没有喜怒哀乐，检测的结果自然非常可观可靠。成本——由于机器比人快，一台自动检测机器能够承担好几个人的任务。而且机器不需要停顿、不会生病、能够连续工作，所以能够极大的提高生产效率。工业相机作为机器视觉系统中的核心部件，对于机器视觉系统的重要性是不言而喻的。按照分类的不同，相机又分为很多种：1、彩色相机、黑白相机：黑白相机直接将光强信号转换成图像灰度值，生成的是灰度图像；彩色相机能获得景物中红、绿、蓝三个分量的光信号，输出彩色图像。彩色相机能够提供比黑白相机更多的图像信息。彩色相机的实现方法主要有两种，棱镜分光法和Bayer滤波法。棱镜分光彩色相机，利用光学透镜将入射光线的R、G、B分量分离，在三片传感器上分别将三种颜色的光信号转换成电信号，最后对输出的数字信号进行合成，得到彩色图像。2、CCD相机、CMOS相机芯片主要差异在于将光转换为电信号的方式。对于CCD传感器，光照射到像元上，像元产生电荷，电荷通过少量的输出电极传输并转化为电流、缓冲、信号输出。对于CMOS传感器，每个像元自己完成电荷到电压的转换，同时产生数字信号。3、按靶面类型分类：面阵相机、线阵相机相机不仅可以根据传感器技术进行区分，还可以根据传感器架构进行区分。有两种主要的传感器架构：面扫描和线扫描。面扫描相机通常用于输出直接在监视器上显示的场合。线扫描相机用于连续运动物体成像或需要连续的高分辨率成像的场合。线扫描相机的一个自然的应用是静止画面（Web Inspection）中要对连续产品进行成像，比如纺织、纸张、玻璃、钢板等。同时，线扫描相机同样适用于电子行业的非静止画面检测。像德国Kappa相机根据它CCD的规格也会有线阵、面阵之分。4 按输出模式分类：模拟相机、数字相机根据相机数据输出模式的不同分为模拟相机和数字相机，模拟相机输出模拟信号，数字相机输出数字信号。模拟相机和数字相机还可以进一步细分，比如德国Kappa相机按数据接口又包括：USB 2.0接口、EE 1394 a / Fire Wire、Camera Link 接口、千兆以太网接口。模拟相机分为逐行扫描和隔行扫描两种，隔行扫描相机又包含EIA、NTSC、CCIR、PAL等标准制式。有关接口技术的详细介绍请参考采集卡及采集技术部分。在选择一款工业数字相机时，物体成像的速度必须充分考虑好。例如，假设在拍摄过程中，物体在曝光中没有移动，可用相对简单和便宜的工业相机；对于静止或缓慢移动的物体，面阵工业相机最适合于对静止或移动缓慢的物体成像。因为整个面阵区域必须一次曝光，在曝光时间当中任何的移动会导致图像的模糊，但是，运动模糊可以通过减少曝光时间或使用闪光灯来控制；对于快速移动的物体，当对运动的物体使用一个面阵工业相机时，需要考虑在曝光时间当中处于工业相机当中的运动对象数量，还需要考虑物体上能用一个像素表征的最小特征，也就是对象分辨率，在采集运动物体的图像的拇指规则就是曝光必须发生在采集物体移动量小于一个像素的时间内。如果你采集的物体是在以1厘米/秒的速度匀速移动，而且物体分辨率已经设置为1 pixel/mm，那么需要的最大曝光时间是1/10每秒。因为物体移动一个距离恰好等于相机传感器中的一个像素，当使用最大曝光时间时这里会有一定数量的模糊。在这种情况下，一般倾向于将曝光时间设置的比最大值要快，比如1/20每秒，就能保持物体在移动半个像素内成像。如果同样的物体以1厘米/秒的速度移动，物体分辨率为1 pixel/微米，那么一秒中所需要的最大曝光是1/10000.曝光设置的对快取决于所采用的相机，还有你是否能够给物体足够的光来获得一幅好的图像。机器视觉在中国的发展已有十余个年头。过去十年是机器视觉产业在中国市场发展最快的十年，经过一定时期的普及与推广，机器视觉已逐渐为广大客户所熟知，而且应用范围，也逐渐开始扩大，大规模的应用领域由起初的电子、制药等行业，逐步扩展到包装、印刷等各大领域。机器视觉市场在发展，机器视觉技术在进步，在以不断满足客户发展需求的同时，最基本需求的满足也是不容忽视的。一直以来，我国的科技水平都处于不断发展的阶段，机器视觉技术作为科技发展的产物，为了更好的适应行业需求，也在不断的优化升级。纵观行业发展，国内机器视觉市场机遇与挑战并存，而行业技术的升级更显得尤为必要了。为顺应行业发展趋势，国内的机器视觉技术就需要通过以下四大要素来升级。一、系统操作简单方便技术参数简单化、处理技术方便化，是系统操作最为关键也是核心的要素。机器视觉技术虽然属于高科技技术，在运作过程中，还需要依靠不断调整各种参数来达到最好的效果。但是目前来说，操作人员大都技术水平有限。因此，系统简化是大多数客户的较价格与质量之后的基本需求，而系统简化主要包括的是检测操作的简化与图像处理的简化。二、系统长期可维护性一个好的系统不仅要考虑使用性还应考虑其在长期运做中的可维护性，机器视觉技术的稳定性、可靠性足以使系统在实际应用中，更好的发挥功能优势，提供有力的技术支持。三、检测技术稳定可靠在工业生产过程中，由于被测物体的多样化以及机械的误差影响，使得整个检测过程很难是维持在平稳的状态。因此，这就需要机器视觉技术有很高的稳定性，从光源照明、图像采集到图像存储与处理都要有可以在任何环境下持续运作的适应能力，同时，还要尽量能采集到突出检测对象的图像，这样才能给出最为稳定、准确、清晰的检测结果，才能为生产或质检工作提供技术支持。四、系统性价比值高在保障质量的基础上，客户最为关心的莫过于价格问题。机器视觉技术不断升级本是件对客户有益的事，但如果只是一味的使用昂贵的部件，就会造成价格的大幅提升，对于大部分的用户来说，无疑增添了负担。性能好、价格低的系统才是能满足最基本需求的，因此性价比是衡量一个系统的重要标志，也是客户选择产品最重要的指标之一。中国是世界的制造工厂，目前全球几乎所有的知名企业都把生产工厂放在中国，机器作业代替人员操作已成为市场优胜劣汰的必然选择。机器视觉产业在中国有着非常广阔而光明的前景，也使中国机器视觉市场成为全球机器视觉企业的竞争焦点，因此我们要抓住时机，不断引进各项高新技术，促进行业的快速发展。在机器视觉系统中,获得一张高质量的可处理的图像是至关重要。系统之所以成功，首先要保证图像质量好，特征明显,。一个机器视觉项目之所以失败，大部分情况是由于图像质量不好，特征不明显引起的。要保证好的图像，必须要选择一个合适的光源。光源选型基本要素：   对比度：对比度对机器视觉来说非常重要。机器视觉应用的照明的最重要的任务就是使需要被观察的特征与需要被忽略的图像特征之间产生最大的对比度，从而易于特征的区分。对比度定义为在特征与其周围的区域之间有足够的灰度量区别。好的照明应该能够保证需要检测的特征突出于其他背景。亮度：当选择两种光源的时候，最佳的选择是选择更亮的那个。当光源不够亮时，可能有三种不好的情况会出现。第一，相机的信噪比不够；由于光源的亮度不够，图像的对比度必然不够，在图像上出现噪声的可能性也随即增大。其次，光源的亮度不够，必然要加大光圈，从而减小了景深。另外，当光源的亮度不够的时候，自然光等随机光对系统的影响会最大。鲁棒性：另一个测试好光源的方法是看光源是否对部件的位置敏感度最小。当光源放置在摄像头视野的不同区域或不同角度时，结果图像应该不会随之变化。方向性很强的光源，增大了对高亮区域的镜面反射发生的可能性，这不利于后面的特征提取。好的光源需要能够使你需要寻找的特征非常明显，除了是摄像头能够拍摄到部件外，好的光源应该能够产生最大的对比度、亮度足够且对部件的位置变化不敏感。光源选择好了，剩下来的工作就容易多了。具体的光源选取方法还在于试验的实践经验1、环形光源提供不同照射角度、不同颜色组合，更能突出物体的三维信息；高密度LED阵列，高亮度；多种紧凑设计，节省安装空间；解决对角照射阴影问题；可选配漫射板导光，光线均匀扩散。应用于：PCB基板检测，IC元件检测，显微镜照明，液晶校正，塑胶容器检测，集成电路印字检查。2、背光源用高密度LED阵列面提供高强度背光照明，能突出物体。的外形轮廓特征，尤其适合作为显微镜的载物台。红白两用背光源、红蓝多用背光源，能调配出不同颜色，满足不同被测物多色要求。应用于：机械零件尺寸的测量，电子元件、IC的外型检测，胶片污点检测，透明物体划痕检测等。3、条形光源较大方形结构被测物的首选光源；颜色可根据需求搭配，自由组合；照射角度与安装随意可调。应用于：金属表面检查，图像扫描，表面裂缝检测，LCD面板检测等。4、同轴光源  光的一致性好可以消除物体表面不平整引起的阴影，从而减少干扰；部分采用分光镜设计，减少光损失，提高成像清晰度，均匀照射物体表面。应用于：系列光源最适宜用于反射度极高的物体，如金属、玻璃、胶片、晶片等表面的划伤检测，芯片和硅晶片的破损检测，Mark点定位，包装条码识别。5、AOI专用光源不同角度的三色光照明，照射凸显焊锡三维信息；外加漫射板导光，减少反光；不同角度组合；应用于：电路板焊锡检测。6、球积分光源具有积分效果的半球面内壁，均匀反射从底部360度发射出的光线，使整个图像的照度十分均匀。应用于：合于曲面，表面凹凸，弧形表面检测，或金属、玻璃表面反光较强的物体表面检测。7、线形光源超高亮度，采用柱面透镜聚光，适用于各种流水线连续检测场合。:阵相机照明专用，AOI专用。8、点光源大功率LED，体积小，发光强度高；光纤卤素灯的替代品，尤其适合作为镜头的同轴光源等；高效散热装置，大大提高光源的使用寿命。应用于：适合远心镜头使用，用于芯片检测，Mark点定位，晶片及液晶玻璃底基校正。9、组合条形光源四边配置条形光，每边照明独立可控；可根据被测物要求调整所需照明角度，适用性广。应用案例:CB基板检测，IC元件检测，焊锡检查，Mark点定位，显微镜照明，包装条码照明，球形物体照明等。10、对位光源对位速度快；视场大；精度高；体积小，便于检测集成；亮度高，可选配辅助环形光源。是全自动电路板印刷机对位的专用光源。工业镜头的选型镜头的选择过程，是将镜头各项参数逐步明确化的过程。作为成像器件，镜头通常与光源、相机一起构成一个完整的图像采集系统，因此镜头的选择受到整个系统要求的制约。一般地可以按以下几个方面来进行分析考虑。一、波长、变焦与否镜头的工作波长和是否需要变焦是比较容易先确定下来的，成像过程中需要改变放大倍率的应用，采用变焦镜头，否则采用定焦镜头就可以了。关于镜头的工作波长，常见的是可见光波段，也有其他波段的应用。是否需要另外采取滤光措施？单色光还是多色光？能否有效避开杂散光的影响？把这几个问题考虑清楚，综合衡量后再确定镜头的工作波长。二、特殊要求优先考虑结合实际的应用特点，可能会有特殊的要求，应该先予明确下来。例如是否有测量功能，是否需要使用远心镜头，成像的景深是否很大等等。景深往往不被重视，但是它却是任何成像系统都必须考虑的。三、工作距离、焦距工作距离和焦距往往结合起来考虑。一般地，可以采用这个思路：先明确系统的分辨率，结合CCD像素尺寸就能知道放大倍率，再结合空间结构约束就能知道大概的物像距离，进一步估算镜头的焦距。所以镜头的焦距是和镜头的工作距离、系统分辨率（及CCD像素尺寸）相关的。四、像面大小和像质所选镜头的像面大小要与相机感光面大小兼容，遵循“大的兼容小的”原则——相机感光面不能超出镜头标示的像面尺寸——否则边缘视场的像质不保。像质的要求主要关注MTF和畸变两项。在测量应用中，尤其应该重视畸变。五、光圈和接口镜头的光圈主要影响像面的亮度。但是现在的机器视觉中，最终的图像亮度是由很多因素共同决定的：光圈、相机增益、积分时间、光源等等。所以为了获得必要的图像亮度有比较多的环节供调整。镜头的接口指它与相机的连接接口，它们两者需匹配，不能直接匹配就需考虑转接。六、镜头的其它类别：线阵镜头：配合线阵相机使用的镜头。采用扫描式的工作方式，需要镜头与目标相对运动，每次曝光成像一条线，多次曝光组成一幅图像。线阵扫描成像的特点：CCD线阵方向的图像分辨率固定，而在目标的运动方向上，空间采样频率与运动的相对速度有关。从成像的角度讲，线阵镜头和其它类型的镜头并没有本质的差异。只是对镜头的使用方式不同而已。显微镜头：为了看清目标的细节特征，显微镜头一般使用在高分辨率的场合。它们基本的特点是工作距离短，放大倍率高，视场小。远心镜头：物方主光线平行于光轴主光线的会聚中心位于物方无限远，称之为物方远心光路。作用：可以消除物方由于调焦不准确带来的测量误差。机器视觉光源的作用机器视觉光源是机器视觉系统中不可或缺的一部分，它的选择直接影响输入数据的质量和应用效果。由于没有通用的机器视觉照明设备，所以针对每个特定的应用实例，要选择相应的照明装置，以达到最理想的应用效果。照明系统是机器视觉系统最为关键的部分之一，直接关系到系统的成败。好的打光设计能够使我们得到一幅好的图象，从而改善整个系统的分辨率，简化软件的运算，而不适合的照明，则会引起很多的问题。1、照亮目标，提高亮度2、用作测量的工具或参照物3、克服环境光干扰，保证图象稳定性；4、 形成有利于图象处理的效果；机器视觉光源的选择1、物体表面：如使机器视觉照明复杂化的是物体表面的变化造成的。如果所有物体表面是相同的，在解决实际应用的时候就没有必要采用不同的光源技术了。但由于物体表面的不同，因此需要观察视野中的物体表面，并分析光源入射的反映。2、控制反射：如果反射光可以控制，图像就可以控制。在涉及机器视觉应用的光源设计时，最重要的原则就是控制好哪里的光源反射到透镜及反射的程度。机器视觉的光源设计就是对反射的研究。在视觉应用中，当观测一个物体以决定需要什么样的光源的时候，首先要弄清楚如何才能让物体显现？我如何才能应用光源使必须的光反射到镜头中以获得物体外表？3、光源可预测： 当光源入射到物体表面的时候，光源的反映是可以预测的。光源可能被吸收或被反射。光可能被完全吸收(黑金属材料，表面难以照亮)或者被部分吸收(造成了颜色的变化及亮度的不同)。不被吸收的光就会被反射，入射光的角度等于反射光的角度，这个科学的定律大大简化了机器视觉光源，因为理想的想定的效果可以通过控制光源而实现。一幅好的图象具备以下条件：1.  对比度明显，目标与背景的边界清晰2.  背景尽量淡化而且均匀，不干扰图象处理；3.  与颜色有关的还需要颜色真实，亮度适中，不过度曝光。4.  整体亮度均匀，整体不均匀灰度差不影响图象处理；工业相机是机器视觉系统中的一个关键组件，其最本质的功能就是将光信号转变成小型高清工业相机为有序的电信号。工业相机又俗称摄像机，相比于传统的民用相机（摄像机）而言，它具有高的图像稳定性、高传输能力和高抗干扰能力等，目前市面上工业相机大多是基于CCD或CMOS芯片的相机。CCD是目前机器视觉最为常用的图像传感器。它集光电转换及电荷存贮、电荷转移、信号读取于一体，是典型的固体成像器件。CCD的突出特点是以电荷作为信号，而不同于其它器件是以电流或者电压为信号。这类成像器件通过光电转换形成电荷包，而后在驱动脉冲的作用下转移、放大输出图像信号。典型的CCD相机由光学镜头、时序及同步信号发生器、垂直驱动器、模拟/数字信号处理电路组成。CCD作为一种功能器件，与真空管相比，具有无灼伤、无滞后、低电压工作、低功耗等优点。CMOS图像传感器的开发最早出现在20世纪70 年代初，90 年代初期，随着超大规模集成电路 (VLSI) 制造工艺技术的发展，CMOS图像传感器得到迅速发展。CMOS图像传感器将光敏元阵列、图像信号放大器、信号读取电路、模数转换电路、图像信号处理器及控制器集成在一块芯片上，还具有局部像素的编程随机访问的优点。目前，CMOS图像传感器以其良好的集成性、低功耗、高速传输和宽动态范围等特点在高分辨率和高速场合得到了广泛的应用。由于光电二极管不能检测精确的颜色，颜色信息通过与滤色镜或棱镜结合被再现。颜色信息能通过使用红色(R)，绿色(G)，蓝色(B)基色滤色镜的基色模式或者通过使用蓝绿色(C)，紫红色(M)，黄色(Y)，绿色(G)的四色滤色镜经过计算创建图像的补色滤色镜模式获得。总之，基色模式创建的图像比较暗，但是由于它更高的色彩饱和度表现出更精确的颜色。这个特点即高度的色彩再现能力。工业相机与民用相机的区别在于：1、工业相机的快门时间非常短，可以抓拍快速运动的物体： 举个例子，把一张名片贴在电风扇扇叶上，以最大速度旋转，用工业相机抓拍一张图像，能清晰的辨别名片上的字体。然而用一般的相机来拍摄，是根本不可能达到这样效果的。2、工业相机的图像传感器是逐行扫描的，而一般摄像机的图像传感器是隔行扫描的，甚至是隔三行扫描的：逐行扫描的图像传感器生产比较困难，成品率低，出货量也少，世界上只有少数几个公司能够提供这类产品，例如Dalsa、Sony，而且价格昂贵。百万级逐行扫描CCD的价格，从人民币4000元到3万元不等，其中的技术参数也颇为繁多。只有采用逐行扫描的图像传感器，才有可能清晰抓拍快速运功物体。3、工业相机的拍摄速度远远高于一般相机：工业相机每秒可以拍摄十幅到几百幅的图片，而一般相机只能拍摄2-3幅图像，相差甚远。4、工业相机输出的是裸数据，其光谱范围也往往比较宽，比较适合进行高质量的图像处理算法，普遍应用于机器视觉系统中。而一般相机（DSC）拍摄的图片，其光谱范围只适合人眼视觉，并且经过了MPEG压缩，图像质量也较差。机器视觉工作原理机器视觉检测系统采用CCD照相机将被检测的目标转换成图像信号，传送给专用的图像处理系统，根据像素分布和亮度、颜色等信息，转变成数字化信号，图像处理系统对这些信号进行各种运算来抽取目标的机器视觉特征，如面积、数量、位置、长度，再根据预设的允许度和其他条件输出结果，包括尺寸、角度、个数、合格 / 不合格、有 / 无等，实现自动识别功能。机器视觉特点1、机器视觉是一项综合技术，其中包括数字图像处理技术，机械工程技术，控制技术，电光源 照明技术，光学成像技术，传感器技术，模拟与数字视频技术，计算机硬件技术，人机接口技术 等这些技术在机器视觉中式并列关系，相互协调 应用才能构成一个成功的工业机器视觉应用系统。2、机器视觉更强调实用性，要求能够适应工业生产中恶劣的环境，要有合理的性价比，要有通用的工业接口，能够由普通工作来操作，有较高的容错能力和安全性，不会破坏工业产品，必须有较强的通用性和可移植性。3、对机器视觉工程师来说，不仅要具有研究数学理论和编制计算机软件的能力，更需要的是光、机、电一体化的综合能力。4、机器视觉更强调实时性，要求高速度和高精度，因而计算机视觉和数字图像处理中的许多技术目前还难以应用于机器视觉，他们的发展速度远远超过其在工业生产中的实际应用速度。在设计工业机器视觉系统时，使用数字相机还是模拟相机是最重要的决定之一。二者各有其优缺点，但归根结底要根据成本和一些关键操作因素来选择，如时了这些因素，哪一项技术更有优势就会明朗化了。对于一项应用，选择什么样的相机合适，取决于机器视觉系统想要达到什么目的，为机器视觉系统选择相机时要认真考虑相机的性能和成本，虽然模拟相机远比数字相机便宜，但它们的分辨率和图像质量较低，所以可能会被局限在要求不太高的应用中，数字相机比模拟相机昂贵，但它们的高成本可能值得为要求高速度、高准确度、高精度的应用而付出。机器视觉被应用于视觉检测、物体识别、自动质量检验、工艺控制、参数测量和自动组装等等许多领域。在这些系统中，相机是决定着成本、速度和精度的关键组件，模拟相机和数字相机都可以用在这些系统中，而了解相机的性能规格及其在各种视觉任务中的重要性，对于把机器视觉存诸工业控制是最基本的一步。机器视觉系统包括三个主要部分：相机、采集卡、和存储并分析图像以提取信息的计算机（或图像处理器）。图像处理器和采集卡属于相对容易选择的电子装置，它们的主要参数是存储能力和处理速度。相机是这些系统中情况最为复杂的部分，现代的模拟和数字相机采用电荷耦合器件（CCD）或互补金属氧化物半导体（CMOS）芯片来捕猎图像并生成电子信号发送给计算机进行处理。CCD和CMOS芯片在内部都生成模拟信息，因此，模拟相机和数字相机之前主要区别在于图像是在哪里被数字化的。数字相机在相机里将信号数字化，并且通过串行总线接口（比如（fireWire,USB,Camera Link,Gigabit Ethernet）将信号以数字方式传输给计算机（或图像处理器）。面在另一方面，模拟相机系统并不是在其内部将图像信号数字化（数字化是邮计算机完成的），所以，模拟信息是通过同轴电缆而进行传输的。尽管两种方法都能够有效地传输信号，但模拟可能会由于工厂内其他设备的电磁干扰而造成失真，随着噪声水平的提高，模拟相机的动态范围（原始信号与噪声之比）会降低。动态范围决定了有多少信息能够被从相机传输给计算机。数字信号不受电器声影响，因此，数字相机的动态范围更高，能够向计算机传输更精确的信号。数字相机的典型动态范围在55分贝到60分贝左右，而模拟相机为45分贝到50分贝左右。所以电缆的长度和类型也影响信号的精度，模拟相机的电缆简单而且便宜，在电噪声导致信号严重失真之前能够将信号可靠地300米以上，由于数字相机传输的是高带宽信号，电缆的长度受电缆中信号良师衰减损失的水平的限制，根据使用的通信协议的不同。LED光源的颜分主要分为四种：红色、蓝色、绿色、白色。其他颜色：橙色、红外、紫外用户可以根据使用环境及使用范围的不同，选择合适的光源种类、颜色以及照明方式，使得检测系统达到最佳的性能，获得最优的检测结果。一般有红、绿、蓝、白、红外。其中红色用得最多，因为红色LED成本低,并且黑白CCD 芯片对660nm光线最敏感。兰色适合检测物体表面质量，因为波长短。当然，紫外的散射性更好，因为波长更短。而白色是中性颜色，适合拍彩色图片，或着被测物体的颜色在变化的。绿色的亮度很高，且波长和兰色接近，所以有时可用绿色代替兰色。红外用于半透明等的物体检测，波长越长，穿透力越强；波长越短，扩散性越好。蓝色光源下，白色、紫色、蓝色等表现较亮，有效反射蓝光。从中也可以发现，白色，无论在什么光照下，都成成明显的白色，是因为其本身不吸收光谱，任何光谱照射到其表面上都会被反射；相反，黑色材料则无论什么光照射上去都不反光成黑色。另外，光的衍射中，衍射条纹的宽度与波长是成正比的，如单缝衍射中央明纹的半角宽度为sinθ=λ / a ，λ为波长，a为单缝宽度。而我们拍摄物体时，其表面通常都不是十分光滑，总是会产生衍射，所以，使用红光时，衍射会比使用蓝光时的衍射要强。因此通常用红光能得到更多的表面细节，而使用蓝光，会得到更大的对比度。如果进行彩色成像，则通常考虑使用白色光源。白色LED光源的制造有几种方法，一种是使用白色LED制造，发光管内部有蓝色发光芯片与受到激发后发出黄色的荧光粉，发出的光按一定比例叠加到一起，看起来形成了白色，这是最为觉常见的形式。这种光源只能通过调节供电电压或电流来改变发光强度、颜色是恒定的。另一种方法是使用红绿蓝三种不同颜色的LED，按某种顺序或方式在光源上进行排列，并分别控制每种颜色的度，使用相对方便。此种方法通常使用四个单色RGGB颗粒进行排列，所以其中的绿色分量通常会比较足。我们通常所见的彩色显示器、彩色电视机、手机屏等显示设备，也是基于RGGB此种方式进行排列的。之所以多加一个绿色的G通量，是因为人眼对绿色光源（波长555nm）最敏感。机器视觉应用中注意目标颜色与光源颜色的搭配。我们看到某个物体成某种颜色，是因为其反射了对应的光谱。即如果目标是红色的，如果是白色的光照射或者是红色的光照射，都有红色的光返回，那么在黑白相机中将会是白色的，如果是蓝色的光来拍摄，则没有红色的光可以反射，那么其将会是黑色的。基于这样的理论，我们拍摄物体时，如果要将某种颜色打成白色，那么就得使用与此颜色相同或相似的光源（光的波长一样或接近），而如果要打成黑色，则需要选择与目标颜色波长差较大的光源而在镜头的分辨率（能分别最小两点之间的距离）公式δ=0.61λ/NA，λ为波长，NA为数值孔径。从中可以知道，当NA固定时，使用不同波长颜色的光时，镜头的分辨率是不一样的。因此在使用光源时，同一支镜头在蓝色光照下的分辨率通常会高于红色光照条件。使用机器视觉LED光源，一般都提供几种供电方式可供选择，常见的有5V、12V、24V直流电源，功率根据所用LED的数量多少而定，电压不同会引起什么区别呢？这和LED的特性有关。一般LED的工作电流在10mA~25mA，特别亮的LED可达50mA甚至更高，而LED的电压降一般为1.8V到3.3V，因此通常每个LED上都串联一个电阻（分压电阻），这样才能保证LED发光均匀，而且在电压波动时不易损毁。那么，由于LED上的电压降和通过的电流都是恒定的，供电电源的电压不同时，多余的电压是串联的电阻所承担的，例如给一颗1.8V、15mA的LED用24V供电时，需要串联1.48KΩ[(24-1.8)/0.015=1480]，此时电阻的功耗是0.015*0.015*1480=0.333W，如果使用多个LED颗粒组合成光源，光源会发出很高的热量 ，这时必须采用风扇等强制散热手段，否则光源的寿命会很短。而同样的LED使用5V供电时，串联电阻R=213Ω，电阻的功耗为0.048W，和24V供电时差了近7倍。这时仅仅靠对流产生的散热效应就足够了，不必用强制散热的方法。既然用低电压有好处，为什么还使用12V、24V呢？原因很简单，由于机器视觉用于工业生产线上，一般24V是标准配置；另外电压高时，搞干扰能力强，而低压则对电源和工作环境提出了更高的要求。是使用恒流源还是恒压源，环境温度有何影响等，均需要考虑。常亮还是闪亮图片亮暗的控制，除了快门、光圈、增益外，还可以控制光源的亮暗以及亮的时间来控制，我们先来看一下常亮光源和闪光的优缺点。如果保持稳定的供电，那么光源的亮度基本不变，如果供电使用脉冲，脉冲的时间宽度和LED本身的响应时间决定了发光时间，若是这个时间小于相机快门开启的时间，那么相机的曝光程度是由光源发出的光通量决定的，如果大于快门时间，则由快门决定。一般情况下，如果需要频闪光源（时间小于快门速度），传统上使用普通的照相机闪光灯，使用LED强度不够，所以以往针对于LED光源来讲，闪光是指光源开启时间大于快门时间的情况。频闪控制器，通常采用的是超电流的方法，即控制通过LED的电流超出标定的值多少倍，而使亮度增加，但是这种高负荷的工作状态由于功率过大，发热严重，对光源的寿命影响很大，所以通常通电时间都很短，减少光源的工作时间，以此来延长光源的使用时间。使用频闪控制器，可以获得高亮的光源，可以减少环境的影响，可以减少快门时间从而减少动态拍摄时的拖尾现象，而且如果只需要平常的亮度时，可以使用低亮度的LED发光管，可以降低成本。但是使用频闪时，电源的成本会提高，而且同步问题也必须考虑，频闪控制器可以从外部输出触发信号来触发光源，也可以从外部输出触发信号来触发频闪控制器，本身输出触发信号同时触发光源与相机，这样能达到光源与相机触发的同步。机器视觉光源的选择是为了将被测物体与背景尽量明显分别，获得高品质、高对比度的图像。而且视觉光源的正确选择，直接影响系统的成败，处理精度和速度。荣旭机器视觉光源，具有亮度可调、低温、均衡、无闪烁、无阴影，亮度、色温一致，使用寿命长等优点。本公司致力于不断开发新的产品和完善其功能，提供多种机器视觉光源产品，免费提供测试，并协助提供整体解决方案它已广泛应用于各个行业。光源的种类视觉系统使用的光源主要有三种，高频荧光灯、光纤卤素灯、LED（发光二极管）照明。理想的视觉光源应该是明亮，均匀，稳定的，高频荧光灯：发光原理和日光灯类似，只是灯管是工业级产品，并且采用高频电源，也就是光源闪烁的频率远高于相机采集图象的频率，消除图像的闪烁。适合大面积照明，亮度高，且成本较低。但需要隔一定时间换灯管一定要进口的才过关，国内的高频做的不行，老有闪烁，国外最快可做到60KHz。光纤卤素灯：卤素灯也叫光纤光源，因为光线是通过光纤传输的，适合小范围的高亮度照明。它真正发光的是卤素灯炮，功率很大，可达100多瓦。高亮度卤素灯炮，通过光学反射和一个专门的透镜系统，进一步聚焦提高光源亮度。卤素灯还有一个名字叫冷光源，因为通过光纤传输之后，出光的这一头是不热的。适合对环境温度比较敏感的场合，比如二次元量测仪的照明。但它的缺点就是卤素灯炮寿命只有2000小时左右。LED灯：使用寿命约10000－30000小时，可以使用多个LED达到高亮度，同时可组合不同的形状，响应速度快，波长可以根据用途选择。机器视觉LED光源的性能优势可制成各种形状、尺寸及各种照射角度；可根据需要制成各种颜色，并可以随时调节亮度；通过散热装置，散热效果更好，光亮度更稳定；使用寿命长（约3万小时，间断使用寿命更长）；反应快捷，可在10微秒或更短的时间内达到最大亮度；电源带有外触发，可以通过计算机控制，起动速度快，可以用作频闪灯；运行成本低、寿命长的LED，会在综合成本和性能方面体现出更大的优势；可根据客户的需要，进行特殊设计。工业相机由两大基本部件组成：图像感光芯片和数字化的数据接口。 图像感光芯片由数十万至数百万个像素组成。 像素把光线的强度转换为电压输出。 这些像素的电压被以灰度值的形式输出，所有像素放在一起就形成了图像，发送给计算机。 数据接口主要有USB 2.0、1394和千兆以太网三种。CCD、CMOS是现在普遍采用的两种图像工艺技术，它们之间的主要差异在于传送方式的不同。虽然CCD在影像品质、分辨率大小、灵敏度等方面优于CMOS，而CMOS具有低成本、低功耗以及高整合度的特点。随着CCD与CMOS技术的不断进步，两者之间的差异将逐步减小。1、分辨率差异：由于CMOS的每个像素都比CCD复杂，且其像素尺寸很难达到CCD的水平，因此，当我们比较相同尺寸的CCD与CMOS时，CCD的分辨率通常会优于CMOS传感器的水平。同尺寸大小，CCD的分辨率要高于CMOS，也就是说成像质量要优于CMOS。2、噪声差异：由于CMOS的每个感光二极管都需要搭配一个放大器，若以百万像素计算的话，那就需要上百万个的放大器，然而放大器属于模拟电路，很难让所得的每个结果都保持一致。而CCD只需要一个放大器放在芯片边缘，与CMOS相比，它的噪声相对减少很多，大大提高了图像品质。3、灵敏度差异：因为CMOS信号是以点为单位的电荷信号，而CCD是以行为单位的电流信号，读取信号时 CMOS是点直接读取信号，CCD则是行间接读取信号，因此在像素尺寸相同的情况下，CMOS的灵敏度要低于CCD。4、耗电量差异：CMOS采用主动式图像采集方式，感光二极管所产生的电荷会直接由旁边的电晶体放大输出；而CCD为被动式采集方式，必须外加12~18V的电压以使每个像素中的电荷移送到传输通道。因此CCD就必须设计更精密的电源线路和耐压强度，这样使得CCD的耗电量远远高出CMOS，根据计算CMOS的耗电量仅是CCD的1/8~1/10。5、成本差异：由于CMOS与现有的大规模集成电路生产工艺相同，可以一次全部整合周边设施到传感器芯片中，大大节省了外围芯片的成本；而CCD采用电荷传递的方式输出数据，只要其中有一个像素传送出现故障，就会导致一整排的数据无法正常传送，因此控制CCD的成品率比CMOS困难许多，因此，CCD的制造成本就相对高于CMOS传感器。印刷包装行业品种繁多，印刷品颜色与形状多样。部分产品的材质具有极高的反射度并且表面印制了彩色图案。如：易拉罐瓶盖的综合检测一直存在着打光难的问题。因此对产品的检测要求都是十分严格。运用机器视觉技术，能迅速准确的发现印刷品的各种缺陷。机器视觉用于印刷行业中的质量检测，其基本的工作原理是用摄像机拍摄（采集）印刷品上的图像，在计算机中与该印品的标准图像（模板）相匹配比较，如果发现差异并超出设定的公差范围，即判定为不合格产品。采用检测系统进行质量检测可以提供检测全过程的实时报警和详尽、完善的分析报告外，现场操作者还可以根据全自动检测系统的实时报警及分析报告，对工作中出现的问题进行相应的调整。并且管理者还可以依据检测结果的分析报告，对生产过程进行跟踪，更有利于生产技术的管理。也就是说，质量检测设备不仅可以提升成品的合格率，还能够协助生产商改进工艺流程，建立质量管理体系，达到一个长期稳定的质量标准。 检测印刷制品颜色缺陷检测（如露印检测、浅印检测、偏色检测、露白检测等）；材质缺陷检测（如孔洞检测、异物检测）；印刷缺陷检测（如残缺检测、刀丝检测、飞墨检测、露印检测、套印误差检测）；二维码缺陷检测（如重号检测、偏位检测、不匹配检测等）。远心工业镜头主要是为纠正传统工业镜头的视差而特殊设计的镜头，它可以在一定的物距范围内，使得到的图像放大倍率不会随物距的变化而变化，这对被测物不在同一物面上的情况是非常重要的应用。普通工业镜头目标物体越靠近镜头（工作距离越短），所成的像就越大。在使用普通镜头进行尺寸测量时，会存在如下问题：1、由于被测量物体不在同一个测量平面，而造成放大倍率的不同；2、镜头畸变大3、视差也就是当物距变大时，对物体的放大倍数也改变4、镜头的解析度不高；5、由于视觉光源的几何特性，而造成的图像边缘位置的不确定性。而远心镜头就可以有效解决普通镜头存在的上述问题，而且没有此性质的判断误差，因此可用在高精度测量、度量计量等方面。远心镜头是一种高端的工业镜头，通常有比较出众的像质，特别适合于尺寸测量的应用。无论何处，在特定的工作距离，重新调焦后会有相同的放大倍率，因为远心镜头的最大视场范围直接与镜头的光栏接近程度有关，镜头尺寸越大，需要的现场就越大。远心测量镜头能提供优越的影像质素，畸变比传统定焦镜头小，这种光学设计令影像面更对称，可配合软件进行精密测量普通镜头优点：成本低，实用，用途广。普通镜头缺点：放大倍率会有变化，有视差。普通镜头应用：大物体成像。远心镜头的优点：放大倍数恒定，不随景深变化而变化，无视差。远心镜头的缺点：成本高，尺寸大，重量重。远心镜头的应用：度量衡方面，基于CCD方面的测量，微晶学镜头的焦距分为像方焦距和物方焦距。像方焦距是像方主面到像方焦点的距离，同样，物方焦距就是物方主面到物方焦点的距离。是像方焦距,入射光线为平行线时通过透镜光线的交点到透镜的距离.当点光源距透镜某一距离时折射光线为平行线,这个距离叫物方焦距.物方远心镜头及像方远心镜头介绍在测量系统中，物距常发生变化，从而使像高发生变化，所以测得的物体尺寸也发生变化，即产生了测量误差；另一方面，即使物距是固定的，也会因为CCD敏感表面不易精确调整在像平面上，同样亲会产生测量误差。为了解决上述问题，可以采用远心镜头。其中像方远心镜头可以消除物距变化带来的测量误差，而物方远心镜头则可以消除CCD位置不准带来的测量误差。1）物方远心镜头物方远心镜头是将孔径光阑放置在光学系统的像方焦平面上，示出，当孔径光阑放在像方焦平面上时，即使物距发生改变，像距也发生改变，但像高并没有发生改变，即测得的物体尺寸不会变化；清楚地显示出物方远心光路的原理，其中孔径光阑位于像方焦面上，物方主光线平行于光轴。如果物体B1B2正确地位于与CCD表面M共轭的位置A1上，那么它在CCD表面上的像为M1M2。如果由于物距改变，物体B1B2不在位置A1而在位置A2，那么它的像B´1B´2偏离CCD表面，B´1和B´2点在CCD表面上投影为一个弥散斑，其中心仍为M1和M2点，按此投影像读出的长度仍为M2M1。这就是说，上述物距改变并不影响测量精度。2）像方远心光路像方远心光路是将孔径光阑放置在光学系统的物方焦平面上，而像方的主光线平行于光轴。如所示。如果物体B1B2的像B´1B´2不与CCD表面M重合，则在CCD表面M上得到的是B´1B´2的投影像，其散斑中心距离M1M2＝B´1B´2。因此，不管CCD表面M是否和B´1B´2相重合，它和标尺所对应的长度总是B1B2，所以没有测量误差。双侧远心镜头曝光时间 Exposure time 为了将光投射到照相感光材料的感光面上，快门所要打开的时间。视照相感光材料的感光度和对感光面上的照度而定。 相机曝光时间是指从快门打开到关闭的时间间隔，在这一段时间内，物体可以在底片上留下影像 曝光时间是看需要而定的，没有长短好坏的说法只有需要的讲法。比如你拍星星的轨迹，就需要很长的曝光时间（可能是几个小时），这样星星的长时间运动轨迹就会在底片上成像。如果你要拍飞驰的汽车清晰的身影就要用很短的时间（通常是几千分之一秒）。 曝光时间长的话进的光就多，适合光线条件比较差的情况。曝光时间短则适合光线比较好的情况。有的是0.04ms—93ms，有的是1/71000s—2s，有的是1/7000s—7s等等曝光时间主要是指底片的感光时间，曝光时间越长底片上生成的相片越亮，相反越暗。在外界光线比较暗的情况下一般要求延长曝光时间（比如说夜景）。1. 分辨率（Resolution）：相机每次采集图像的像素点数（Pixels），对于数字相机机一般是直接与光电传感器的像元数对应的，对于模拟相机机则是取决于视频制式，PAL制为768*576，NTSC制为640*480。2. 像素深度（Pixel Depth）：即每像素数据的位数，一般常用的是8Bit，对于数字相机机一般还会有10Bit、12Bit等。3. 最大帧率（Frame Rate）/行频（Line Rate）：相机机采集传输图像的速率，对于面阵相机机一般为每秒采集的帧数（Frames/Sec.），对于线阵相机为每秒采集的行数（Lines/Sec.）。4. 曝光方式（Exposure）和快门速度（Shutter）：对于线阵相机机都是逐行曝光的方式，可以选择固定行频和外触发同步的采集方式，曝光时间可以与行周期一致，也可以设定一个固定的时间；面阵相机机有帧曝光、场曝光和滚动行曝光等几种常见方式，数字相机一般都提供外触发采图的功能。快门速度一般可到10微秒，高速相机机还可以更快。可以看到ccd芯片的工业相机外观5. 像元尺寸（Pixel Size）：像元大小和像元数（分辨率）共同决定了相机机靶面的大小。目前数字相机机像元尺寸一般为3μm-10μm，一般像元尺寸越小，制造难度越大，图像质量也越不容易提高。6. 光谱响应特性（Spectral Range）：是指该像元传感器对不同光波的敏感特性，一般响应范围是350nm－1000nm，一些相机机在靶面前加了一个滤镜，滤除红外光线，如果系统需要对红外感光时可去掉该滤镜。工业镜头倍率及视场范围的计算方法一、工业镜头光学放大倍率的计算方法二、工业镜头对应视场范围的计算方法附：常见工业相机传感器尺寸大小1/4″：3.2mm×2.4mm；1/3″：4.8mm×3.6mm；1/2″：6.4mm×4.8mm；2/3″：8.8×6.6mm；1″：12.8mm×9.6mm机器视觉系统中，工业镜头相当于人的眼睛，其主要作用是将目标的光学图像聚焦在图像传感器（相机）的光敏面阵上。视觉系统处理的所有图像信息均通过工业镜头得到，工业镜头的质量直接影响到视觉系统的整体性能。下面对机器视觉工业镜头的相关专业术语做以详解。一、远心光学系统：指主光线平行于工业镜头光学轴的光学系统。而光从物体朝向镜头发出，与光学轴保持平行，甚至在轴外同样如此，则称为物体侧远心光学系统。二、远心镜头：远心镜头指主光线与镜头光源平行的工业镜头。有物方远心，像方远心，双侧远心。普通工业镜头主光线与镜头光轴有角度，因此工件上下移动时，像的大小有变化。双侧远心境头主物方，像方均为主光线与光轴平行光圈可变，可以得到高的景深，比物方远心境头更能得到稳定的像最适合于测量用图像处理光学系统，但是大型化成本高物方远心境头只是物方主光线与镜头主轴平行工件上下变化，图像的大小基本不会变化使用同轴落射照明时的必要条件，小型化亦可对应像方远心境头只是像方主光线与镜头光轴平行相机侧即使有安装个体差，也可以吸收摄影倍率的变化用于色偏移补偿，摄像机本应都采用这种镜头三、远心光学系统的特色：优点：更小的尺寸。减少镜头数量，可降低成本。缺点：上下移动物体表面时，会改变物体尺寸或位置。优点：上下移动物体表面时，不会改变物体尺寸或位置。使用同轴照明时。可使用更小的尺寸缺点：未使用同轴照明时，大于标准镜头的尺寸四、远心：远心度是指物体的倍率误差。倍率误差越小，远心度越高。远心度有各种不同的用途，在镜头使用前，把握远心度很重要。远心镜头的主光线与镜头的光轴平行，远心度不好，远心镜头的使用效果就不好；远心度可以用下图进行简单的确认。五、分辨率（μm）：光学系能力的尺度，表示黑白格状图案通过镜头观察时，1mm中可以分辨观察到黑白条纹的最多对数。分辨率为两点间在无法识别前，能靠近的最近距离测量值，例如1μm的分辨率代表两点间在无法识别前，能靠近的最近距离为1μm。以下为根据镜头的无相差光衍射情况计算理论分辨率的公式。六、分辨力(Lines／mm)：分辩力指黑白网线图镜头里影像内1mm面积，可识别的黑白两色条纹数。分辨力的单位为线条/mm，例如100线条/mm代表可识别黑白间距1/100mm(10μm)。黑白线条的宽度为1/200mm(5μm)。七、水平TV分辨率（TV线条）：宽度里的黑白水平线总条数，相当于电视机屏幕垂直高度的高度值。屏幕的垂直与水平长度比率通常为3:4，因此水平宽度里的总条数为3/4。电视机水平分辨率为240TV条线，电视机屏幕水平宽度的总条数为320条线。测量镜头的分辨率时，一组黑色与白色线条应视为一条线，但是在电视机分辨率线条方面，一组视为2TV线条。八、失真（%）：失真为光学轴外的直型物体，呈现曲线时的镜头像差。镜头失真也称为镜头畸变，即光学透镜固有的透视失真的总称，可分为枕形失真和桶形失真，直线朝向中心的失真情况为枕形失真(Pincushion Distortion），向外扩张的失真称为桶形失真(Barrel Distortion)。如下图示：九、TV失真（%）：TV屏幕上的影像失真。数值越接近零，牲能越高。十、电视失真：实际边长的歪曲形状与理想的形状的百分比算出的值。十一、孔径效率边际光量（%）：孔径效率为使用镜头拍摄均匀亮度的物体时，成像盘光学轴与四周区域之间的亮度差异，单位为百分比（%），假设中央亮度为100，为镜头的光学特征之一。十二、遮蔽（%）：遮蔽为使用镜头与CCD-TV镜头拍摄均匀亮度的物体时，电视机屏幕中央与边缘之间的亮度差异，单位为百分比（%）。通常使用受光组件与CCD组件的功率比计算此百分比。遮蔽意指镜头与TV镜头的整体表现，可使用远心光学系统以缩小遮蔽的情况。十三、色差：在镜头光学统中，形成影像的位置与影像放大倍率随光线波长的不同而不同。不同波长的光线有不同的颜色，这叫做色彩失真。光学轴上的失真叫做色彩失真。放大倍率的差异则叫做放大倍率色彩失真。十四、工作距离（WD）（mm）：工作距离指镜头第一个工作面到被测物体的距离。十五、物像间距离O/I（Object to Imager）OI指物体到结像平面的距离。十六、焦距f（mm）后焦距/前焦距焦距为光学系统的主光点到焦点的距离。从最后一片镜头的顶点到后焦点的距离，为后焦距。从第一片镜头的顶点到前焦点的距离，为前焦距。十七、景深：深度为与物体从最佳焦点前后移动时．出现最锐利焦点的最近点与最远点之间的距离。物体侧的深度范围称为景深。同样，照相机侧的范围称为焦点深度。具体的景深的值多少略有不同。景深（Depth of Field）可以用以下的计算式计算出来：景深 = 2 x Permissible COC x 实效F / 光学倍率2 = 允许误差值 / (NA x 光学倍率)(使用的是0.04mm的Permissible COC)通过镜头的影像理论土会形成点状。清晰影像上出现可接受的摸糊情况，称为可接受的弥散圆。十八、焦深：深度为当CCD从最佳焦点前后移动时，出现最锐利焦点的最近点与最远点之间的距离。影像侧的深度范围称为焦深。十九、后截距（mm）：从镜头安装座盘前端到影像的距离。二十、C安装座规格：名称标准外径螺丝螺纹数(25.4mm用)后截距U125.4000mm32Threads17.526mm二十一、数值孔径 NA，NA'：当物体在入射光孔上产生的半角为u，且折射率为n，n x sinu为物体侧数值孔经（NA）。当物体在出射光孔上产生的半角为u'，且折射率为n'，n' x sinu' 为影像侧数值孔径{NA'）。NA=n x sinu　　　　　　NA'=n' x sin u'NA越高，镜头的分辨率与亮度越佳。如下图所示 入射角度 u, 物体侧折射率n, 成像侧的折射率' n'：NA = NA' x 放大率对于Macro镜头，NA =M/2 xF　NA' = 1/2 xF　NA=NA' x光学倍率　NA'=NA x光学倍率二十二、F值F No：此值指镜头的亮度。将镜头对焦距离除以物体侧的有效直径（入射光孔直径Dmm)，即可得到此数值，也可使用NA与镜头的光学放大倍率(β)计算。数值越小，镜头越明亮。F No=焦距/入射孔径或有効口径=f／D二十三、有效F No：此值为具体在有限距离内的镜头亮度，指实际操作时的亮度。光学放大倍率越高(β)，镜头越暗。实效F = (1 +光学倍率) x F#，实效F = 光学倍率 / 2NA二十四、光学放大倍率β：物体尺寸与影像尺寸的比例。β=y'／y=b／a=NA／NA'=CCD镜头元件尺寸／视野实际尺寸二十五、光学倍率：放大倍率（Magnification）指的是通过镜头的调整能够改变拍摄对象原本成像面积的大小。光学倍率就是通过光学镜头变倍的放大倍率。主要点与成像的关系：放大率是指成像大小与物体的比。二十六、电子放大倍率：电子放大倍率为影像在显示器屏幕上显示时与在CCD上显示相比的放大倍率。二十七、显示器放大倍率：显示器放大倍率为通过镜头在显示器呈现物体的放大倍率。显示器放大倍率=(光学放大倍率β) x (电子放大倍率)(计算范例) 光学放大倍率=02x，CCD尺寸1/2\"(对角线8mm)，显示器1/4\"：电子放大倍率=14 x25.4/8=44.45显示器放大倍率=0.2x44.45=8.89(倍) (1英寸=25.44mm)※有时根据TV监视器的扫描状态，以上的简易计算将有一些变化。二十八、视野(FOV)：视野指使用照相机以后看到的物体侧的范围。照相机有效区域的纵向长度（V）/光学倍率（M）＝视野（V）照相机有效区域的横向长度（H）/光学倍率（M）＝视野（H）照相机有效区域的纵向长度（V）or（H）=照相机一个画素的尺寸×有効画素数（V）or（H）来计算。（计算范例)　　光学放大倍率=0.2x，CCD尺寸1／2\"（长4.8mm，宽6.4mm}：视野尺寸 长度=4.8／0.2=24(mm)宽度=6.4／0.2=32{mm)二十九、解析度：表示了所能见到了2点的间隔0.61x 使用波长(λ)/ NA=解析度(μ),以上的计算方法理论上可以计算出解析度，但不包括失真。※使用波长为550nm三十、解像力：１mm中间可以看到黑白线的条数。单位（lp）/mm三十一、MTF（Modulation Transfer Function）：成像时再现物体表面的浓淡变化而使用的空间周波数和对比度。三十二、成像圈：成像尺寸φ，要输入相机感应器尺寸。三十三、照相机 Mount：C-mount: 1\" diameter x 32 TPI: FB: 17.526mm，CS-mount: 1\" diameter x 32 TPI: FB: 12.526mm，F-mount: FB:46.5mm，M72-Mount: FB 厂家各有不同。三十四、边缘亮度：相对照度是指中央的照度与周边的照度的百分比。三十五、通风盘及解析度：Airy Disk（通风盘）是指通过没有失真的镜头在将光集中一点时，实际上形成的是一个同心圆。这个同心圆就叫做Airy Disk。Airy Disk的半径r可以通过以下的计算公式计算出来。这个值称为解析度。ｒ= 0.61λ/NA Airy Disk的半径随波长改变而改变，波长越长，光越难集中于一点。 例：NA0.07的镜头 波長550nm r=0.61*0.55/0.07=4.8μ三十六、 MTF 及解析度：MTF（Modulation Transfer Function) 是指物体表面的浓淡变化，成像侧也被再现出来。表示镜头的成像性能，成像再现物体的对比度的程度。测试对比性能，用的是具有特定空间周波数的黑白间隔测试。空间周波数是指１mm的距离浓淡变化的程度。所示，黑白矩阵波，黑白的对比度为100%.这个对象被镜头摄影后，成像的对比度的变化被定量化。基本上，不管什么镜头，都会出现对比度降低的情况。最终对比度降低至0%。，不能进行颜色的区别。、显示了物体侧与成像侧的空间周波数的变化。横轴表示空间周波数，纵轴表示亮度。物体侧与成像侧的对比度由A、B计算出来。MTF由A,B的比率计算出来。解析度与MTF的关系：解析度是指2点之间怎样被分离认识的间隔。一般从解析度的值可以判断出镜头的好坏，但是实际是MTF与解析度有很大的关系。显示了两个不同镜头的MTF曲线。镜头a 解析度低但是具有高对比度。镜头b对比度低但是解析度高。三十七、微距镜头：不用近接环或特写镜头而实现扩大摄影，为近接摄影而设计的镜头，有限远（=从物镜出射的光，在一定距离处聚焦）三十八、CCTV镜头：适合于广范围的扩大观察，需要严格精度时不适合，无限远（=从物镜出射的光，不聚焦，平行前进）三十九、变倍镜头：焦距可变镜头，倍率，摄像范围等可以简单改变。适合于需要寻找最合适摄影条件（摄影距离，镜头的焦距）以便于操作的场合使用。不产生聚焦位置移动的称为变倍镜头，产生焦距位置移动的称为变焦镜头。四十、成像圆：光学系统中成像圆的尺寸，成像圆的尺寸=CCD对角尺寸，和CCD尺寸同样意义。四十一、后变倍镜头：安装在CCD前面，不改变工作距离，扩大视野范围。F值下降，分辨率、对比度下降，聚焦会有些不准。四十二、前变倍镜头：安装在镜头前面，工作距离会变化，亮度不变，扩大视野范围。如果把工业相机比喻为人的眼睛，工业镜头就好比是眼球，它直接关系到监看物体的远近、范围和效果。工业镜头的选用应考虑一下几点：1）工业镜头尺寸应等于或大于工业相机成像面尺寸。例如：1/3″工业相机可选1/3″～1″整个范围内的工业镜头，但水平视角的大小都是一样的。只是使用大于1/3″的工业镜头能够更多地利用成形，更精确了工业镜头中心光路，所以可提高图像质量和分辨率。2）选用合适的工业镜头焦距。焦距越大，监看距离越远，水平视角越小，监视范围越窄；焦距越小，监看距离越近，水平视角越大，监视范围越宽。工业镜头焦距可按照以下公式估算。f=A×L/H(f--镜头焦距；A--摄像机CCD垂向尺寸；L--被摄物体到镜头距离；H--被摄物体高度)格式1英寸2/3英寸1/2英寸1/3英寸1/4英寸CCD垂向尺寸9.6㎜6.6㎜4.8㎜3.6㎜2.7㎜3）考虑环境光线的变化,光线对图像的采集效果起着十分重要的作用。一般来说，对于光线变化不明显的环境，常选用手动光圈镜头，将光圈手调到一个比较理想的数值后就可不动了；如果光线变化较大，如室外24小时监看，应选用自动光圈，能够根据光线的明暗变化自动调节光圈值的大小，保证图像质量。但需注意的是，如果光线照度不均匀，特别是监视目标与背景光反差较大时，采用自动光圈镜头效果不理想。4）考虑最佳监看范围。因为工业镜头焦距和水平视角成反比，因此既想看得远，又想看得宽阔和清晰，这是无法同时实现的。每个焦距的镜头都只能在一定范围内达到最佳的监看效果，所以如果监看的距离较远且范围较大，最好是增加摄像机的数量，或采用电动变焦镜头配合云台安装。5）工业镜头接口与工业相机接口要一致。现在的工业相机和工业镜头通常都是CS型接口，CS型摄像机可以和CS型、C型镜头配接，但和C型镜头接配时，必须在工业镜头和工业相机之间加接配环，否则可能碰坏CCD成像面的保护玻璃，造成CCD工业相机的损坏。C型工业相机不能和CS型工业镜头配接。近年来利用影像量测物品尺寸已经成为行业发展的趋势。由于相机，影像软件及照明组件等设备的进步，让影像量测物品尺寸的精准度能媲美或更胜于手动或雷射光的量测。整合光学系统工程的应用，我们可发现光学产品的优劣决定了系统的品质，而远心镜头能执行各种形式的光学量测。软件工程需要具高分辨率、高对比性和低几何变形特性的拍摄影像来判断出精准的量测数据。除了光学设备本身的要求，视角的选择也具相当的重要性，在不适当的观测点下量测物体，会造成物体拍摄影像的扭曲。除了影像处理过程中会造成的干扰，系统设计者也同时将光学配备本身会影响光学量测精准性的几个限制纳入考虑：1．由于物体摆放位置而造成的不正常放大2．影像的变形3．视角选择而造成的误差4．低影像分辨率5．不适当光源干扰下造成边界的不确定性远心镜头能有效降低甚至消除以上的问题，因此远心镜头也成为精密光学量测系统决定性的因素。图一：不同镜头的光学原理接下来我们简要的介绍远心镜头是如何有效降低噪声及变形等问题。一、放大倍率的一致性光学量测系统通常会自物体正上方拍摄(不纪录物体侧面)以测量其直径或直线距离。由于许多机械零组件无法精准定位或具有高度差或厚度等问题，工程师需要可靠光学量测系统来判定影像与物体的实际间距。左上图为利用远心镜头拍摄圆柱形零件上的齿条；左下图为利用普通镜头拍摄同样对象的影像；右上图为两个同样对象置于相距100 mm下利用远心镜头拍的影像；右下图为同样情形下利用普通镜头捕捉的影像。左图：在一般标准镜头下，物体的影像大小会因为与镜头的距离(标记为“s”)不同而改变。同样的，不同大小的对象可能会受距离的影响而看起来相同。反观远心镜头能容许一定程度的距离改变，在＂限定景深＂或＂远心度区间＂内，影像不会因物体与镜头间距离的改变而放大或缩小。此特性是由于在光学系统中，只有与光轴平行的光束会被接收，因此远心镜头必须大于或等于被摄物体的直径。“Telecentric”这个单字是来自于希腊前缀”tele-”(遥远)以及字根”center”(中心，在此代表着光学系统的轴心)，代表此光学系统的入射光线在通过远心镜头时是与镜头的中央轴心平行，而成像点会在远心镜头的焦点平面上。左图：在远心系统内，唯有与轴心平行或接近平行的光束会被接受。在此我们举个简单的例子来说明两种光学系统的差异性。首先我们使用一个焦距为12毫米的标准镜头 (f = 12 mm) 及以1/3吋的侦测器为接口来测定放置于200毫米 (s = 200 mm) 外的20毫米 (H = 20 mm) 对象。当对象位移1毫米 (ds = 1mm)时，其成像大小将会有约略0.1毫米的差异(如以下公式)。dH = (ds/s) x H = (1/200)x 20 mm = 0,1 mm在telecentric光学系统下，成像的大小的变化取决于” telecentric 曲线”，一个高品质远心镜头的曲线角度(theta)能趋近于0.1°(0,0017 rad)，代表当物体同样移动1毫米 (ds = 1mm) 时，其成像将只会有0.0017毫米的改变。dH = ds x theta= 1 x 0,0017 mm = 0,0017 mm因此相较于标准镜头，远心镜头能将放大倍率的误差缩小至1/10或甚至1/100。上图：远心曲线决定了物体被移动时成像改变的倍率。“Telecentric range”或是” telecentric depth”代表在维持放大倍率下能摆设物体的范围。然而当物体不在telecentric range中并不代表镜头功能就不具远心的特性，影像的变异程度主要是由镜头的”远心曲线” (由前文的” theta”所定出来的) 或 ”远心度”所决定，这个曲线决定了物体在移动时造成的影像误差大小，然而当主要入射光束与光轴”平行”时，成像的大小就不会因物体置放的距离而影响。由于远心镜头必须接收与光轴平行的入射光源，远心镜头的尺寸必须比拍摄物体还大，因此远心镜头会比一般镜头大且厚重，成本也比一般镜头高。二、低失真度 (Distortion)影像的变形是限制光学量测准确性的重要因素之一，再好的镜头都还是无法避免。然而有时候一或数个像素的错误可能具决定性的影响。 失真度也可以说是影像与实际画面的差异度。失真度是利用影像点与影像中心位置的距离和在标准影像(未失真影像)的实际距离之间的差异来计算。举例来说，一个与画面中心距离200像素的标的在影像画面中只有和中心点间隔198个像素，其失真度则为：distortion = (198-200)/200 = -2/200 = 1%正向放射性失真 (Positive radial distortion) 也被称为 “pincushion” 性失真，负向放射性失真 (negative radial distortion) 可被另称为 “barrel” distortion。此类的变形和影像中心的距离大小有绝对的关联性。“pincushion” type distortion “barrel” type distortion影像的失真可被视作真实画面经过二维几何性变形的结果，由于通常不是线性改变而是二或三度的多项式的变形，影像会被些许的拉扯及扭曲。一般的镜头具有数度或数十度的失真度，不过由于大部分的影像镜头是用在一般监测系统或普通摄影中，些许的影像失真是能被容许的，但此瑕疵让精密影像测量变的困难。高品质的远心镜头只具有低于0.1%失真度的特性，虽然这个数次听起来很小，但在高分辨率的摄影机下仍能造成将近一个像素的误差。因此许多失真的影像会利用软件做校正：将校正用图样(此图样的精密度必须比)置于镜头下方拍摄，之后利用软件计算影像校正公式，将失真影像做校正。由于影像的失真程度与物体和镜头的距离有极高的关联性，因此必须格外留意物体在被摄影时与镜头的距离。除了与远心镜头的距离以外，物体和远心镜头之间必须尽量保持垂直以避免” non-axially symmetric distortion effects”，所谓的梯形性失真(或称” Keystone” or thin prism effect”) 是另一个影像测量系统中必须克服的问题，如果拍摄物体没有被放置于中心点，此类的影像通常据非对称性也很难利用软件校正。左图：为一张使用远心镜头所拍摄的不失真影像；中图为同一个画面但具放射性变形的影像；右图为同一个画面但具有梯形性失真的影像。三、视角误差使用一般光学镜头拍摄非平面物体时，物体的大小会因为距离而改变。因此拍摄管柱形物体时，管柱顶端与底端会成被拍摄成像为同心圆而非同样的双圆。而在远心镜头下，圆柱底端则会与柱顶的圆完全重叠。左图：为一般镜头下常见的视角误差。右图由远心镜头所拍摄的影像能不会出现此问题。这个现象是因为光束路径的特殊性而造成的，在一般光学镜头下，没有与光轴平行的纵向光束会在感光源件上投射成平行距离，然而只些接收平行光束的远心镜头则不会有同样的问题。一般镜头通常会将3D物体的立体影像(包括空间距离)转换成2D影像，而远心镜头只会纪录2D平面影像而不受物体的立体距离影响，这个特性在影像量测系统中具有极大的优势。一般镜头会将光束(镜头左边)的纵向距离投射成平行影像，而远心镜头不会有这种情形四、高影像分辨率影像的分辨率是利用CTF(contrast transfer function)将影像的对比清晰度量化。使用不同分辨率镜头拍摄USAF test pattern的结果：左图高分辨率影像，右图低分辨率影像。很多影像系统是利用多个低画素相机搭配低分辨率的便宜镜头，因而只得到非常模糊的影像。而远心镜头的高分辨率让它能搭配低像素高分辨率的相机而依然得到良好的影像品质。五、锐利的边缘影像影像拍摄时，背景光线常常会让物体的轮廓变的难以界定(border effects)，主要是因为背景的强光会与物体边缘的阴影重叠，除此之外，当光线自不同角度投射于物体上时，某些光源被物体反射后仍然被镜头所接收(如下图十一所示)，这种光线常常会被误判来自物体背后，造成边缘判定上的误差，因此当物体具有高度立体特性时容易会出现误差。在一般镜头下常见的Border effects能在远心镜头下有明显的改善这个问题在远心镜头下能被明显的改善，当光圈缩的够小时，只有与光轴平行的光束能通过镜头，因此被物体反射的光线就不会被接收，影像的精准性也就能明显提升。如果想要更进一步的提升影像的品质，可利用collimated (或称 “telecentric”) 照明设备搭配远心镜头，在这种配备能让相机与光源互相配合，让所有自collimated光源发出的光都能是被镜头所接收的平行光束，让噪声与曝光时间都能大幅的降低。除此之外，边缘定位的问题也因光源的控制而有明显的改善。Collimated (telecentric)光源设备只提供与光轴接近平行的光束。一、对工业镜头的选择，我们首先必须确定客户需求：•1、视野范围、光学放大倍数及期望的工作距离：在选择工业镜头时，会选择比被测物体视野稍大一点的工业镜头，以有利于运动控制。•2、景深要求：对于对景深有要求的项目，尽可能使用小的光圈；在选择放大倍率的工业镜头时，在项目许可下尽可能选用低倍率工业镜头。如果项目要求比较苛刻时，倾向选择高景深的尖端工业镜头。•3、芯片大小和相机接口 ：例如2/3”工业镜头支持最大的工业相机耙面为2/3”,它是不能支持1英寸以上的工业相机。•4、注意与光源的配合，选配合适的工业镜头。•5、可安装空间：在方案可选择情况下，让客户更改设备尺寸是不现实的。二、典型案例：齿轮项目•1、该项目的基本要求是：检测齿轮滚轴的安装质量（缺失）和滚轴的直径公差200微米。在线检测速度为2个/秒。•2、相机的选择：客户需求200um，根据精度 = FOV / Resolution，测量齿轮实际大小       为48mm，加上边缘宽度，以60mm作为FOV(H)，以此数据算的相机Resolution=FOV(H)/精度=60/0.2=300, 故选择640*480分辨率,曝光时间至少1/2 S的工业相机。•3、工业镜头的选择由于这个项目上对检测环境没有特殊要求，人为设定WD=200mm，CCD Size根据相机参数1/4”(对角线长度),乘16转换为4mm，再根据4:3的比例，勾股定理算出水平的直角边为3.2mm。根据Focus level/WD=CCD Size / FOVf=CCD Size*WD/FOV=3.2*200/60=10.6mm，故选择12mm定焦可满足需求。综上所述选择640*480分辨率、曝光时间为1/10000 S到30 S的工业相机，12mm定焦CCTV镜头。品牌产地镜头类型施耐德Schneider德国定焦、远心卡尔蔡司Zeiss德国定焦、远心μTron日本定焦、定倍、远心、连续变倍Moritex日本定焦、定倍、远心、连续变倍SPACECOM日本百万像素定焦COMPUTAR日本百万像素定焦宾得PENTAX日本百万像素定焦腾龙TAMRON日本百万像素定焦精工日本百万像素定焦VST日本定焦、定倍、远心、连续变倍KOWA日本百万像素定焦视清VICO日本远心、定倍、定焦、百万像素定焦1、远心镜头运用目的远心镜头目的就是消除由于被测物体（或CCD芯片）离镜头距离的远近不一致，造成放大倍率不一样。分为：物方远心镜头、像方远心镜头和双侧远心镜头。物方远心镜头，通过在像方焦平面上放置孔径光阑，使物方主光线平行于光轴，从而虽然物距改变，但成像位置不变。像方远心镜头，通过在物方焦平面上放置孔径光阑，使像方主光线平行于光轴，从而虽然CCD芯片的安装位置有改变，在CCD芯片上投影成像大小不变。双侧远心镜头，则是兼有以上两种特点，但结构相对复杂。Q:远心镜头为何价格高，有何优点？A:  远心镜头的设计是采Telecentric原理，低失真、无视角误差，较适合工业上量测应用，所以价位较一般CCTV镜头高。远心镜头另有同轴镜头设计，提供不同工作距离,不同放大倍率供选择。Q:  远心镜头为何低倍率镜头价格反而高？A: 因为Telecentric镜头为了要减少失真，让平行光进入，所以镜头设计必须比被照体大，所以低倍率镜头通常口径都很大，所需的镜片材料成本较高，所以价格较高。Q: 同轴光镜头打同轴光时，中间亮度较亮旁边整暗，是何原因？如何补救？A: 因为同轴光镜头的投射光线集中于中心5~6㎜左右，如果看的范围较大，边缘附近光线较暗，这是低倍率同轴光镜头常有的现象。可以外加环形光源来补足光线不够地方。Q:  远心镜头可否搭配CCTV用的2倍镜使用？A: 可以，但是影像质量变差，所需光强度更强，不建议使用。Q:  远心镜头规格上，标示镜头分解能(解析力)是代表什么意思？A: 镜头解析力的定义是镜头能看清楚最小物体边缘的能力，如果低于此分解能，就无法看清楚了。须另外找解析力更高的镜头，如高倍显微物镜。Q:  远心镜头景深为何不能很长？A:  远心镜头设计时即考虑到景深、倍率、光圈、工作距离等参数取得最佳点，所以景深均为固定的数值，如要增长景深，而牺牲别的参数，会影响镜头质量。Q: 如果要看到1μm的物体可用何种镜头？A: 要看到小于1μm以下物体，必须用高倍显微物镜，但工作距离变得很小(约7㎜)，景深变得很浅了。Q: 用远心镜头所放大的影像到底是多少倍？A: 影像实总际放大倍率是等于镜头光学倍率×Monitor放大倍率，Monitor放大倍率是Monitor对角线除上CCD Sensor对角线(1/3〞CCD Sensor投射到14吋Monitor是59.3倍)。Q:  远心镜头除了C-mount之外，可否提供其它mount选择？A: 除了C-mount之外，还有直径φ17㎜及直径φ12㎜二种mount供选择，这些mount是针对笔型CCD专用的镜头。三、像方远心光路原理及作用像方主光线平行于光轴主光线的会聚中心位于物方无限远，称之为：像方远心光路作用：可以消除像方调焦不准引入的测量误差，用途：大地测量仪器四、双侧远心光路原理及作用综合了物方/像方远心的双重作用。主要用于视觉测量检测领域。优势：1、大景深；2、景深范围内物像倍率不变3、低畸变通常<1%（全幅画面）4、垂直成像时，无投影现象劣势：1、体积大、重量沉，由于平行光路入射，镜头的口径要大于被摄物体2、焦距固定，变焦困难3、工作距离相对较短4、光阑小，需要更强的照明在设计工业机器视觉系统时，使用工业数字相机还是工业模拟相机是最重要的决定之一。二者各有其优缺点，但归根结底要根据成本和一些关键操作因素来选择。如果考虑了这些因素，哪一项技术更有优势就会明朗化了。机器视觉基础机器视觉被应用于自动质量检验、工艺控制、参数测量和自动组装等等许多领域。在这些系统中，相机是决定着成本、速度和精度的关键组件。工业模拟相机和工业数字相机都可以用在这些系统中，而了解工业相机的性能规格及其在各种视觉任务中的重要性，对于把机器视觉付诸工业控制是最基本的一步。机器视觉系统包括三个主要部分：工业相机、采集卡和存储并分析图像以提取信息的计算机（或图像处理器）。图像处理器和采集卡属于相对容易选择的电子装置，它们的主要参数是存储能力和处理速度。工业相机是这些系统中情况最为复杂的部分。现代的工业模拟相机和工业数字相机采用电荷耦合器件（CCD）或互补金属氧化物半导体（CMOS）芯片来捕获图像并生成电子信号发送给计算机进行处理。CCD和CMOS成像器由一系列方形光电池组成，它们将收集到的光子转化为电子，并将生成的电荷积蓄起来。在CCD中，当从芯片中每次读取一个像素时，电荷被转换成电压；而在CMOS中，每个光敏器件旁边的电路将光能转化成电压。二者在图像质量上没有明显的优劣之分。基于CMOS的工业相机需要的部件较少，电耗较低，提供数据的速度也比基于CCD的相机快； 但CCD则是更为成熟的技术，能够以较低的噪声提供质量更好的图像，而弱点是数据传输速度较慢，不太灵活，部件较多和电耗较高。信号精度CCD和CMOS芯片在内部都生成模拟信号，因此，模拟相机和数字相机之间的主要区别在于图像是在哪里被数字化的。数字相机在相机里将信号数字化，并且通过串行总线接口（比如FireWire, USB, Camera Link, Gigabit Ethernet）将信号以数字方式传输给计算机（或图像处理器）。而在另一方面，模拟相机系统并不是在其内部将图像信号数字化（数字化是由计算机完成的），所以，模拟信息是通过同轴电缆而进行传输的。尽管两种方法都能够有效地传输信号，但模拟信号可能会由于工厂内其他设备（比如电动机或高压电缆）的电磁干扰而造成失真。随着噪声水平的提高，模拟相机的动态范围（原始信号与噪声之比）会降低。动态范围决定了有多少信息能够被从相机传输给计算机。数字信号不受电噪声影响，因此，数字相机的动态范围更高，能够向计算机传输更精确的信号。数字相机的典型动态范围在55分贝到60分贝之间，而模拟相机则为45分贝到50分贝左右。所用电缆的长度和类型也影响着信号的精度。模拟相机的电缆简单而且便宜，在电噪声导致信号严重失真之前能够将信号可靠地300米以上。由于数字相机传输的是高带宽信号，电缆的长度受电缆中信号良师衰减（损失）水平的限制。根据使用的通信协议的不同，电缆的典型长度如下：·    FireWire：            大约10米到20米·    USB：                    大约10米到 20米·    Camera Link：             大约10米现在，市场上有了采用千兆位以太网标准电缆的新系统。这些电缆能够将数字图像数据传输100米左右而不发生损失。分辨率和捕获速度分辨率是描述相机性能的重要参数之一，它包括两个方面：·    阵列中传感单元或称像素的数量·    每个传感单元的大小模拟相机通常是基于视频图形阵列（VGA）成像格式，分辨率被限制在大约640×480像素。这只是机器视觉系统要求的下限。而在另一方面，数字相机能够达到80兆像素甚至更高。模拟相机和数字相机典型的像素大小在3微米到20微米范围内。第二个重要参数是帧速，或者说相机连续提供图像的速度。帧速越高，在给定时间内能够完成的检验、测量或识别工作就越多。像素数和帧速之间存在着相互影响，所以，相机的像素数越多，其帧速越低。但是，这并非是一成不变的规则，因为尺寸越小的半导体转换速度通常就越快，所以像素数相同的两台相机可能具有差别很大的帧速。640×480像素模拟相机的典型帧速为每秒30帧，而分辨率为2兆像素（1600×1200像素）的数字相机能够达到相同的帧速。16兆像素的数字相机帧速约为每秒3帧。另外，相机传感器可采用多端口设计，将图像分解成片段以同时读出。还可以在软件的控制下只读取图像中“感兴趣”的部位而不是读取全部传感器阵列，同样能够缩短传输时间。其他因素除了分辨率和帧速，其他重要的设计因素还包括动态范围和灵敏度。动态范围或图像每个像素的字节数决定着采集卡需要的存储容量以及图像处理器需要的算法精度。它也影响着传感器的曝光宽容度。每像素只有几个字节的相机将无法像字节数更高的相机那样满足很宽的照明条件范围。一般来说，数字相机的动态范围指标更好一些，因为它们的抗噪声性能更好。传感器灵敏度也决定着可靠地使用相机所需要的照明条件。在光线不好或者为防止运动图像模糊而提高快门速度的情况下，要求相机具有更高的灵敏度。同波长有关的相机灵敏度也许非常重要。根据应用的不同，可能需要采用发光二极管甚至红外或紫外照明，相机的波长灵敏度也应当匹配。最后，相机生成彩色或者单色图像的能力也十分重要。关于总成本的考虑各个设计参数共同影响着相机的成本。典型情况下，由于传感器尺寸的原因，像素数越高的相机就越昂贵。与此类似，在一定的分辨率下，帧速提高，成本也趋向于增加。同时提高帧速和分辨率通常要求相机具有多端口读出，这使系统的复杂程度增加，因而提高了成本。从上世纪七十年代起，许多供应商都开始提供基于CCD和CMOS技术的模拟相机。典型的价位在200美元左右。模拟相机采集卡的价位也在200美元左右。相比之下，数字相机的价位在1,000美元到20,000美元范围内大幅度变化，数字相机采集卡的价位在1,000美元到2,000美元之间。但是，随着数字相机和采集卡变得越来越普及，它们的价位也在逐渐降低。在对成本进行比较时，设备的价格还只是问题的一个方面。设计人员还必须考虑软件、硬件、安装、维护和升级等方面的成本，还有，给定的相机技术是否能够达到要求的性能。完成特定任务所需要的工业相机数量在安装成本中占到了一定比例。举例来说，从1毫米见方的检验区域中解析出1微米见方的片段，可能需要用到5台模拟相机和采集卡，而这些制备必须保持同步以获得清晰的图像。只使用1台百万像素的工业数字相机和采集卡就可以解析同样大小的区域，而且无需在计算机中同步处理多幅图像。例如，一家汽车制造商的保险杠检验系统需要12台模拟相机、12片采集卡12套软件和3台计算机。公司发现，就算可能，使所有相机的图像同步化以获得一幅保险杠的可靠图像也是难度相当大的。用1台百万像素的数字相机、1片采集卡和1台计算机取代了这个相机阵列后，系统的安装和维护都变得十分简单和方便。一般来说，典型的数字相机需要更长的时间进行安装和设定，但对于前述应用实例而言，需要的数字相机数量大为减少。因此，维护成本也将大幅度降低。另外，数字相机的功能性和灵活性都更强，能够快速重新编程，在系统运行过程中即可进行现场固件升级。而相比之下，模拟相机则必须被送回制造厂才能进行性能升级。最后一项成本因素是功率消耗。典型的模拟相机需要5瓦到10瓦操作功率，而分辨率指标相当的数字相机则不到1瓦。应用要求对于一项应用，选择什么样的工业相机合适，取决于机器视觉系统想要达到什么目标。视觉检验、非接触式测量、物体识别和定位是三个常见的应用，每一个都有不同的要求。典型的检验系统将图像同模板或者“已知合格品”图像进行对比以检查偏差。高质量的图像一般需要用图像处理器来进行可靠的对比。这意味着，工业相机必须同时具有高分辨率和每像素足够的字节数。可能也需要彩色成像能力。非接触式测量计算一个物体占据的像素数量，并将计数结果转化成尺寸数值。这样的系统可能需要高分辨率，而每像素的字节数要求可能不必太高。图像处理器通常只提取图像的边缘或外形轮廓信息，所以，一般并没有很高的动态范围和彩色能力要求。物体识别和定位有各种各样的要求。在许多情况下，图像处理系统在图像中搜寻以识别出基准特征。需要的分辨率取决于这些特征相对于整个图像尺寸的大小。识别系统可能会需要彩色成像能力。为机器视觉系统选择相机时要认真考虑工业相机的性能和成本。虽然工业模拟相机远比工业数字相机便宜，但它们的分辨率和图像质量较低，所以可能会被局限在要求不太高的应用中。数字相机比模拟相机昂贵，但它们的高成本可能值得为要求高速度、高准确度和高精度的应用而付出。四种工业相机接口技术的比较接口技术GigEFirewireUSBCamera Link标准类型CommercialConsumerConsumerCommercial连接方式点对点或LAN link(Cat 5 TP - RJ45)点对点– 共享总线主/从– 共享总线点对点– (MDR 26 pin)带宽<1000Mb/s连续模式<400Mb/s连续模式<12Mb/s USB1 <480Mb/s USB2 突发模式<2380Mb/s (base) <7140Mb/s (full)连续模式距离:-max w/switch-max w/fiber<100m(no switch)No LimitNo Limit<4.5m72m200m<5m30m<10m可连接设备数量Unlimited631271PC InterfaceGigE NICPCI cardPCI cardPCI Frame grabber1、模拟相机&&数字相机模拟相机必须带数字采集卡，标准的模拟相机分辨率很低，另外帧率也是固定的。这个要根据实际需求来选择。另外模拟相机采集到的是模拟信号，经数字采集卡转换为数字信号进行传输存储。模拟信号可能会由于工厂内其他设备（比如电动机或高压电缆）的电磁干扰而造成失真。随着噪声水平的提高，模拟相机的动态范围（原始信号与噪声之比）会降低。动态范围决定了有多少信息能够被从相机传输给计算机。数字相机采集到的是数字信号，数字信号不受电噪声影响，因此，数字相机的动态范围更高，能够向计算机传输更精确的信号。2、相机分辨率根据系统的需求来选择相机分辨率的大小，下面以一个应用案例来分析。应用案例：假设检测一个物体的表面划痕，要求拍摄的物体大小为10*8mm,要求的检测精度是0.01mm。首先假设我们要拍摄的视野范围在12*10mm,那么相机的最低分辨率应该选择在：(12/0.01)*(10/0.01)=1200*1000,约为120万像素的相机，也就是说一个像素对应一个检测的缺陷的话，那么最低分辨率必须不少于120万像素，但市面上常见的是130万像素的相机，因此一般而言是选用130万像素的相机。但实际问题是，如果一个像素对应一个缺陷的话，那么这样的系统一定会极不稳定，因为随便的一个干扰像素点都可能被误认为缺陷，所以我们为了提高系统的精准度和稳定性，最好取缺陷的面积在3到4个像素以上，这样我们选择的相机也就在130万乘3以上，即最低不能少于300万像素，通常采用300万像素的相机为最佳(我见过最多的人抱着亚像素不放说要做到零点几的亚像素，那么就不用这么高分辨率的相机了。比如他们说如果做到0.1个像素，就是一个缺陷对应0.1个像素，缺陷的大小是由像素点个数来计算的，试问0.1个像素的面积怎么来表示？这些人以亚像素来忽悠人，往往说明了他们的没有常识性)。换言之，我们仅仅是用来做测量用，那么采用亚像素算法，130万像素的相机也能基本上满足需求，但有时因为边缘清晰度的影响，在提取边缘的时候，随便偏移一个像素，那么精度就受到了极大的影响。故我们选择300万的相机的话，还可以允许提取的边缘偏离3个像素左右，这就很好的保证了测量的精度。3、CCD&CMOS如果要求拍摄的物体是运动的，要处理的对象也是实时运动的物体，那么当然选择CCD芯片的相机为最适宜。但有的厂商生产的CMOS相机如果采用帧曝光的方式的话，也可以当作CCD来使用的。又假如物体运动的速度很慢，在我们设定的相机曝光时间范围内，物体运动的距离很小，换算成像素大小也就在一两个像素内，那么选择CMOS相机也是合适的。因为在曝光时间内，一两个像素的偏差人眼根本看不出来(如果不是做测量用的话)，但超过2个像素的偏差，物体拍出来的图像就有拖影，这样就不能选择CMOS相机了。4、彩色&黑白如果要处理的是与图像颜色有关，那当然是采用彩色相机，否则建议你用黑白的，因为黑白的同样分辨率的相机，精度比彩色高，尤其是在看图像边缘的时候，黑白的效果更好。5、帧率根据要检测的速度，选择相机的帧率一定要大于或等于检测速度，等于的情况就是你处理图像的时间一定要快，一定要在相机的曝光和传输的时间内完成。6、线阵&面阵对于检测精度要求很高，面阵相机的分辨率达不到要求的情况下，当然线阵相机是必然的一个选择。7、传输接口根据传输的距离、稳定性、传输的数据大小（带宽）选择USB、1394、Camerlink、百兆/千兆网接口的相机。8、CCD靶面靶面尺寸的大小会影响到镜头焦距的长短，在相同视角下，靶面尺寸越大，焦距越长。在选择相机时，特别是对拍摄角度有比较严格要求的时候，CCD靶面的大小，CCD与镜头的配合情况将直接影响视场角的大小和图像的清晰度。因此在选择CCD尺寸时，要结合镜头的焦距、视场角一起选择，一般而言，选择CCD靶面要结合物理安装的空间来决定镜头的工作距离是否在安装空间范围内，要求镜头的尺寸一定要大于或等于相机的靶面尺寸。9、相机的价格同样参数的相机，不同的厂家价格各不相同，这就靠大家与厂家沟通和协商了。一般说来，如果你有量的话，整体价格跟你单买一个的价格是差别很大的。工业相机到传感器对应放大倍率工业相机像幅传感器尺寸( 对角线 )9’’12’’13’’20’’27’’1/4’’57.2x76.2x82.6x127x171.5x1/3’’38.1x50.7x55.0x84.6x114.1x1/2’’28.6x38.1x41.3x63.5x85.7x2/3’’20.8x27.7x30.0x46.2x62.3x1’’14.3x22.2x23.8x31.8x42.9x1. 什么是CCD摄像机？CCD是Charge Coupled Device(电荷耦合器件)的缩写，它是一种半导体成像器件，因而具有灵敏度高、抗强光、畸变小、体积小、寿命长、抗震动等优点。2. CCD摄像机的工作方式被摄物体的图像经过镜头聚焦至CCD芯片上，CCD根据光的强弱积累相应比例的电荷，各个像素积累的电荷在视频时序的控制下，逐点外移，经滤波、放大处理后，形成视频信号输出。视频信号连接到监视器或电视机的视频输入端便可以看到与原始图像相同的视频图像。3. 分辨率的选择评估摄像机分辨率的指标是水平分辨率，其单位为线对，即成像后可以分辨的黑白线对的数目。常用的黑白摄像机的分辨率一般为380-600，彩色为380-480，其数值越大成像越清晰。一般的监视场合，用400线左右的黑白摄像机就可以满足要求。而对于医疗、图像处理等特殊场合，用600线的摄像机能得到更清晰的图像。4. 成像灵敏度通常用最低环境照度要求来表明摄像机灵敏度，黑白摄像机的灵敏度大约是0.02-0.5Lux(勒克斯)，彩色摄像机多在1Lux以上。0.1Lux的摄像机用于普通的监视场合；在夜间使用或环境光线较弱时，推荐使用0.02Lux的摄像机。与近红外灯配合使用时， 也必须使用低照度的摄像机。另外摄像的灵敏度还与镜头有关，0.97Lux/F0.75相当于2.5Lux/F1.2相当于3.4Lux/F1.5. 参考环境照度：夏日阳光下 100000Lux 阴天室外 10000Lux电视台演播室 1000Lux 距60W台灯60cm桌面 300Lux室内日光灯 100Lux 黄昏室内 10Lux20cm处烛光 10-15Lux 夜间路灯 0.1Lux6. 电子快门电子快门的时间在1/50-1/100000秒之间， 摄像机的电子快门一般设置为自动电子快门方式，可根据环境的亮暗自动调节快门时间，得到清晰的图像。有些摄像机允许用户自行手动调节快门时间，以适应某些特殊应用场合。7. 外同步与外触发外同步是指不同的视频设备之间用同一同步信号来保证视频信号的同步，它可保证不同的设备输出的视频信号具有相同的帧、行的起止时间。为了实现外同步，需要给摄像机输入一个复合同步信号(C-sync)或复合视频信号。外同步并不能保证用户从指定时刻得到完整的连续的一帧图像，要实现这种功能，必须使用一些特殊的具有外触发功能的摄像机。8. 光谱响应特性CCD器件由硅材料制成，对近红外比较敏感，光谱响应可延伸至1.0um左右。其响应峰值为绿光(550nm)。夜间隐蔽监视时，可以用近红外灯照明，人眼看不清环境情况，在监视器上却可以清晰成像。由于CCD传感器表面有一层吸收紫外的透明电极，所以CCD对紫外不敏感。彩色摄像机的成像单元上有红、绿、兰三色滤光条，所以彩色摄像机对红外、紫外均不敏感。9. CCD芯片的尺寸CCD的成像尺寸常用的有1/2\"、1/3\"等， 成像尺寸越小的摄像机的体积可以做得更小些。在相同学镜头下，成像尺寸越大，视场角越大。机器视觉系统是指通过机器视觉产品(即图像摄取装置，分为CMOS摄像头和CCD摄像头两种)将被摄取目标转换成图像信号，传送给专用的图像处理系统，根据像素分布和亮度、颜色等信息，转变成数字化信号；图像系统对这些信号进行各种运算来抽取目标的特征，进而根据判别的结果来控制现场的设备动作。在机器视觉系统中，包含独立的工业摄像头，采用业界标准的电气接口，如火线IEEE1394接口摄像头、USB接口摄像头或千兆以太网GigE摄像头(GigE Vision interface)等。机器视觉摄像头的典型应用可分为离线处理功能的摄像头和在线处理功能的摄像头。离线处理功能的摄像头可单独对摄像头供电，并可通过电气接口将原始数据传送至主机。视频传输既可以是连续帧，也可以是单帧数据，具体取决于应用的需要。单帧捕获与视频传输被称作触发模式，需要外部系统通常以CMOS级向摄像头系统发送电子脉冲。摄像头逻辑将启动一个帧集成，并通过电气接口将扫描的数据发送至主机。在某些情况下，原始数据通过总线与同步信号、时钟和数据一起发送给帧接收器等终端数据采集系统。帧接收器在存储器中存储数据，随后可由主机应用软件对数据进行存取以处理和控制。离线处理的一大优势在于，单靠一个主机就能满足摄像头操控与系统控制两者之需。但是由于视频数据从摄像头每帧传输存在一定的延迟，因此这种处理方式不适用于实时处理的应用，比如器件生产过程中传送带上的产品检查。由于近来DSP处理器发展非常快，已经具备实时执行复杂算法的计算功能，因此也使得摄像头的在线处理成为可能。在线处理功能的摄像头包括感应器与DSP处理器，二者可通过非粘接逻辑、也可通过某种粘接逻辑连接。DMA 将感应器扫描的视频直接发送至DSP 存储器，并进行逐帧处理。控制函数的最终结果由处理器在被控制的系统中直接启动，或在主机上作为命令启动。在线处理功能的摄像头进行视频处理的优势在于，数据处理可实时进行，而且在火线、USB 或千兆以太网接口上没有分组处理的负担。可采用字节优化型汇编代码，在时钟频率超过300 MHz的DSP处理器上加快实时处理速度。图像算法的实时处理对检查应用至关重要，例如，能够检查出传送带上移动过快的的器件。一个帧图像的计算完成并采取相应行动后，才可以继续向系统传输下一个图像帧。在实际应用中，应依据具体的应用环境来选择摄像头，不管是离线处理功能的摄像头还是在线处理功能的摄像头，都具有各自的技术特点，选择合适合理的摄像头才能更好的体现出机器视觉系统的优越性。CMOS(Complementary Metal Oxide Semiconductor)是互补式金属氧化物半导体的英文缩写，它将NMOS和PMOS二个相反极性的MOS半导体串起来，形成了集成电路中广泛使用的一个基本单元。例如计算机中用量最大的内存——动态存储器，就是用CMOS工艺制造的。CMOS的摄像机并不比CCD摄像机出现的时间晚多少，CCD在六十年代末，而CMOS在七十年代初相继开发出来，后来之所以CCD占了统治地位，是因为在当时的工艺制造技术条件下，CMOS的图像质量太差了。直至1990年，新工艺的发展，使开发人员再一次对CMOS产生了兴趣，主要是看到了CMOS的低功耗、高集成(整个摄像机集成在一片晶体内)、低制造成本(基于不需重新建立新的生产线，可以在已有的主流的逻辑和存储器CMOS流水线中进行)。经过大量的投入和努力，CMOS摄像机在近几年已获得了极大的成功，已形成了对CCD的强大挑战。形成了CCD和CMOS二个激烈竞争的发展方向和阵营。在过去，CMOS图像传感器给人的印象是低端产品，例如商务用传真机、复印机、扫描仪，到今日，以娱乐为主的摄像机、手机拍摄组件，直至大紫大红的网上摄像机也多为CMOS传感器。同时，CMOS摄像机在图像质量上已取得长足的进步，即使在对图像质量要求较高的投影仪上也获得了使用。无论是CMOS还是CCD，它们都是用光敏像元阵列将入射的光图像转换成像元内的电荷，所不同的是将这些像元中的电荷取出，并转换成电压的方式和途径不同。CCD是用电荷量来载荷图像信息的，而CMOS是用电压量来载荷图像信息的。CMOS和CCD的工作过程如下图所示，从图可以看出，CCD像元将光转换为电荷后，用电荷耦合的方法，将电荷逐点、逐行地用电荷移位寄存器移出，直至电荷/电压转换器，图像信息用电荷的形式在芯片内移动输出；而CMOS则以完全不同的方式将图像信息送出像元阵列，从图(b)可以看出，每一个像元光敏单元都有一个电荷/电压转换单元与之相伴，所以像元电荷马上转换成为电压，再通过与之对应的矩阵开关，将电压送出阵列，所以CMOS的图像信息是以电压的形式传送输出的。由于这种完全不同的结构，为它们带来了各自的长处和短处。CCD和CMOS工作过程示意图CMOS摄像机有超强的集成度、低功耗和小尺寸的优势；但在图像质量，特别在低照度下和灵活性方面就要逊色多了。所以CMOS适合于批量大、有空间和重量限制，而图像质量要求不是太高的领域，例如保安、生物测量仪等领域使用，包括机器视觉系统中对图像质量要求不严的场合，例如数字或文学识别、易区分的缺陷检测、简单物体几何分类、简单场景自动导航等等。机器视觉就是用机器代替人眼来做测量和判断。机器视觉系统是指通过机器视觉产品将被摄取目标转换成图像信号，传送给专用的图像处理系统，根据像素分布和亮度、颜色等信息，转变成数字化信号；图像系统对这些信号进行各种运算来抽取目标的特征，进而根据判别的结果来控制现场的设备动作。由于机器视觉系统可以快速获取大量信息，而且易于自动处理，也易于同设计信息以及加工控制信息集成，因此，在现代自动化生产过程中，人们将机器视觉系统广泛地用于工况监视、成品检验和质量控制等领域。机器视觉系统的特点是提高生产的柔性和自动化程度。在一些不适合于人工作业的危险工作环境或人工视觉难以满足要求的场合，常用机器视觉来替代人工视觉；同时在大批量工业生产过程中，用人工视觉检查产品质量效率低且精度不高，用机器视觉检测方法可以大大提高生产效率和生产的自动化程度。而且机器视觉易于实现信息集成，是实现计算机集成制造的基础技术。半导体行业是最先利用机器视觉技术进行检测的行业，其他行业也随之而来。作为生产机械的OEM的设计工程师，最基本的问题就是：“我是要检测这个部件还是整个这个产品”。检测可以得到高质量的产品，但是也会有这样的事实存在：检测成本或者产品质量要求并不需要这样的检测。比如说牙签，假设在一个装有500个牙签的盒子里有一两个不合格，大多数人都不会怎么担心。但是对于很多产品，假如前面的盒子里装的不是牙签，而是针头，试想不合格品可能会带来什么样的后果，所以产品功能性的检测都是不可缺少的，即使只是外观检测，要证明内在的品质也必须要做到无缺陷。因此，为了达到这个目的，许多OEM将机器视觉应用到他们将要卖给用户的系统中。机器视觉能够为整个系统增值，表现在三个方面：提高生产效率，提高制造过程的精确性，减少成本。那么，对于一个设计工程师来说，怎么样才能知道机器视觉是否适合他的系统呢？尽管最早的最基本的机器视觉系统在20世纪70年代引入，工业就将其视为主流应用。这就导致设计工程师要考虑它是否合适他们的应用，同时要考虑利用机器视觉检测的成本与其所能带来的利润。高复杂度产品行业，比如说半导体行业和电子行业，由于它们的复杂性和小型化，从传统上推动着机器视觉市场的发展。但是如今，所有产业，包括自动化、制药、造纸等等都依靠机器视觉系统检测产品以提高产品质量。工业专家们预言：在未来的20年到50年，机器视觉将成为横跨所有行业的通用性技术，几乎所有出产的产品都会由机器视觉系统来检测。使用机器视觉系统有以下五个主要原因：精确性——由于人眼有物理条件的限制，在精确性上机器有明显的优点。即使人眼依靠放大镜或显微镜来检测产品，机器仍然会更加精确，因为它的精度能够达到千分之一英寸。重复性——机器可以以相同的方法一次一次的完成检测工作而不会感到疲倦。与此相反，人眼每次检测产品时都会有细微的不同，即使产品时完全相同的。速度——机器能够更快的检测产品。特别是当检测高速运动的物体时，比如说生产线上，机器能够提高生产效率。客观性——人眼检测还有一个致命的缺陷，就是情绪带来的主观性，检测结果会随工人心情的好坏产生变化，而机器没有喜怒哀乐，检测的结果自然非常可观可靠。成本——由于机器比人快，一台自动检测机器能够承担好几个人的任务。而且机器不需要停顿、不会生病、能够连续工作，所以能够极大的提高生产效率。一旦工程师决定使用机器视觉系统，就需要建立这个系统。其中要素包括：照明光源、工件放置（夹具）、工业镜头、工业相机、位置传感器、控制逻辑、以及图像采集卡，图像处理软件、技术支持。由于大多数厂商在这个领域都没有经验，机会来了。所以，寻找一个既了解核心技术又能为其提供系统所需产品的供应商就成为关键问题。典型的基于PC的视觉系统通常由如.1.1所示的几部分组成：.1.1   基于PC的视觉系统基本组成①工业相机与工业镜头——这部分属于成像器件，通常的视觉系统都是由一套或者多套这样的成像系统组成，如果有多路相机，可能由图像卡切换来获取图像数据，也可能由同步控制同时获取多相机通道的数据。根据应用的需要相机可能是输出标准的单色视频（RS-170/CCIR）、复合信号（Y/C）、RGB信号，也可能是非标准的逐行扫描信号、线扫描信号、高分辨率信号等。②光源——作为辅助成像器件，对成像质量的好坏往往能起到至关重要的作用，各种形状的LED灯、高频荧光灯、光纤卤素灯等都容易得到。③传感器——通常以光纤开关、接近开关等的形式出现，用以判断被测对象的位置和状态，告知图像传感器进行正确的采集。④图像采集卡——通常以插入卡的形式安装在PC中，图像采集卡的主要工作是把相机输出的图像输送给电脑主机。它将来自相机的模拟或数字信号转换成一定格式的图像数据流，同时它可以控制相机的一些参数，比如触发信号，曝光/积分时间，快门速度等。图像采集卡通常有不同的硬件结构以针对不同类型的相机，同时也有不同的总线形式，比如PCI、PCI64、Compact PCI，PC104，ISA等。⑤PC平台——电脑是一个PC式视觉系统的核心，在这里完成图像数据的处理和绝大部分的控制逻辑，对于检测类型的应用，通常都需要较高频率的CPU，这样可以减少处理的时间。同时，为了减少工业现场电磁、振动、灰尘、温度等的干扰，必须选择工业级的电脑。⑥视觉处理软件——机器视觉软件用来完成输入的图像数据的处理，然后通过一定的运算得出结果，这个输出的结果可能是PASS/FAIL信号、坐标位置、字符串等。常见的机器视觉软件以C/C++图像库，ActiveX控件，图形式编程环境等形式出现，可以是专用功能的（比如仅仅用于LCD检测，BGA检测，模版对准等），也可以是通用目的的（包括定位、测量、条码/字符识别、斑点检测等）。⑦控制单元（包含I/O、运动控制、电平转化单元等）——一旦视觉软件完成图像分析（除非仅用于监控），紧接着需要和外部单元进行通信以完成对生产过程的控制。简单的控制可以直接利用部分图像采集卡自带的I/O，相对复杂的逻辑/运动控制则必须依靠附加可编程逻辑控制单元/运动控制卡来实现必要的动作。机器视觉(Machine Vision)作为光电技术应用的一个特定领域，目前已经发展成为一个前景光明、活力无限的行业，年平均增长速度超过2O％ 。机器视觉广泛应用于微电子、电子产品、汽车、医疗、印刷、包装、科研、军事等众多行业。涉及技术一致，应用差异明显，是各种机器视觉应用系统的共同特点。机器视觉系统集成时，涉及到多门技术，最基本的系统也需要照明、成像、图像数字化、图像处理算法、计算机软件硬件等，稍微复杂一点的系统还会用到机械设计、传感器、电子线路、PLC、运动控制、数据库、SPC等等。要把这么多不同方面的技术和知识组合到系统里，使其相互完美配合并稳定地工作，对系统集成人员提出了很高的要求。作者根据多年的经验，讲解了机器视觉系统集成时所涉及的各种技术、需要综合考虑的因素以及评估机器视觉系统项目成功的可能性的方法。中国经济经过数十年的高速发展，在很多领域完成了从无到有、从不能到可以的跃变，现在已经到了提高生产效率和产品质量、残酷竞争的阶段，很多原来使用的人工工序正逐渐被机器所取代，从而对机器视觉系统产生了越来越多的需求。而机器视觉技术本来就是为了解决生产中的各种问题发展起来的。在人类的生产活动中，人的眼睛担负着很多重要的任务，例如放置和固定工件、观察和估计位置、检测外观尺寸、确定产品的一致性、检验产品质量等。这些工作正在越来越多地被机器视觉系统取代，一方面是随着对生产速度和产品质量的要求越来越高，对检测速度和精度的要求超过了肉眼的能力；另一方面是因为成像技术、计算机技术或图像处理技术的发展，机器视觉系统能够完成的任务越来越复杂，成本也越来越低。然而，机器视觉技术作为一门新兴技术，引人中国时间并不长，真正有经验的系统集成人员也不多，而机器视觉系统涉及到照明、成像、电子、自动控制、计算机软件硬件、机械设计、传感器、光学等各方面，把这些不同的技术集成到1个系统内，并使其相互完美配合工作，本身就是艰巨的任务。本文试图根据作者多年的经验，就机器视觉系统集成技术给出一些建议，期望能够帮助使用机器视觉系统的用户评估其系统并在做出合理决策时提供参考，给研制系统的技术人员和公司提供一些成功的经验。本文将介绍需求分析、资源配置、系统集成等几个方面的内容。A、 需求分析准确地描述机器视觉系统需要完成的功能和工作环境，对于整个机器视觉系统的成功集成是至关重要的。对于需求的描述，实际定义了视觉系统工作的场景，而围绕这个场景设计1个系统来获取合适的图像，并提取有用的信息或控制生产过程就是我们工作的目标。这个步骤看起来如此简单，以至于经常被忽略。有时候用户在生产过程中产生了某种需求，但是由于知识面和技术方面的原因，用户不知道自己需要什么样的视觉系统，或者不能准确描述自己的需求，而这时系统集成商自己经验不足或没有给以足够的重视，就不能帮助用户来明确系统的功能细节，这个系统集成开发过程注定要走弯路，甚至最终失败。所以，系统集成的第1步就是明确用户需求!一般情况下可以使用下面的表格来帮助我们实现此目标。问题说明检测什么东西?检测的目标物是什么?形状是什么样的?检测哪些指标?具体检测什么指标?有无?状态?尺寸?位置?粘连?差异?毛刺?颜色目标多大?物体具体尺寸是多少?工作距离?安装摄像机到被测物体的距离最大允许多远?能否自由调节?分辨率多高?测量尺寸精度要求是多高?检测速度多快?全自动测量还是手动?每分钟测量多少个?安装空间被测零件周围是否有安装光源的位置?是否有适合安装摄像头的位置?怎样固定比较合适?颜色?被测物体是什么颜色?我们是否需要对颜色判别?是否可以利用颜色差异帮助我们实现检测目的?材质物体是什么材料的，表面光学性质怎样?合格判据?合格／不合格的定义工位信号?有工位触发信号还是需要自动连续拍摄图像?剔除或控制方式是否需要自动剔除次品或控制机器动作?怎样对不合格品进行剔除?使用什么信号格式，在什么位置进行?工作环境工作环境的温度、湿度、粉尘、防水、杂散光线情况交货日期这是不言而喻的B、资源配置机器视觉系统集成时，涉及到多门技术，最基本的系统也需要照明、成像、图像数字化、图像处理算法、计算机软件硬件等，稍微复杂一点的系统还会用到机械设计、传感器、电子线路、PLC、运动控制、数据库、SPC等等。显而易见，要把这么多不同方面的技术和知识组合到1个系统里，使其相互完美配合并稳定地工作，对系统集成人员提出了很高的要求，需要根据具体的需求来确定所需要配置的资源和对策。B.1机械设计由于需求不同，对机械部分的要求差别很大，如果是全自动的机器视觉系统，机械部分一般需要完成的功能有理料、输送、定位、剔除、下料等功能，而有的机器视觉系统则只需要适当的固定支架来固定相机、镜头和计算机即可，差别很大。例如，制药生产线上使用的西林瓶灯检机，需要完成理瓶、输送、旋转、刹车急停、相机同步、快速归位、下料、分流剔除等多个动作，而且需要提供多达15个检测工位，以完成液体内部悬浮物、玻璃碎屑、瓶身破损、细菌群落、瓶口封装、瓶底等多项指标的检测，各种机械零件多达上千个，系统非常之复杂；而停车场使用的车牌识别系统的机械部分则非常简单，只需要相机固定和保护等安装配件即可。一般系统集成商不愿意介入特别复杂的机械设计，一方面是因为在用户的观念中，机械设计没有太多的技术含量；另一方面是机械加工周期较长，1个小小的设计错误也会导致返工，时间拖得较长。所以，虽然在很多情形下，机械设计在机器视觉系统中占了很大的比重，而且是关键部分，但投入相对较少，导致整个系统开发过程不顺利。有时候，和制造机械设备的公司合作是最好的选择。需要指出的是，对于需要复杂机械系统的全自动系统，由于大多数系统只能针对特定的产品工作，所以，除非生产量达到一定数量，或者该产品会生产很长时间，一般情况下，半自动系统就足够了。自动系统开发周期长，成本高，生产过程中换型困难，而半自动系统只需要更换1个夹具，重新设置检测指标和合格判据就可以了。B.2照明光源这个看似简单的照明系统是机器视觉系统最为关键的部分，直接关系到系统的成败，其重要性无论如何强调都是不过分的。好的设计能够使我们得到1幅好的图像，从而改善整个系统的分辨率，简化软件的运算，而不合适的照明，则会引起很多问题。例如花点和过度曝光会隐藏很多重要的信息；阴影则会引起边缘的误检；而信噪比的降低以及不均匀的照明会导致图像处理阈值选择的困难。在实际应用中，得到场景的图像很容易，但是得到1幅适合机器视觉算法要求的图像则很难，因为被测目标多种多样，形状大小不同，检测指标各异，而且各种材料的反光特性及颜色也不一样，要把所需要检测的特征突显出来，而对不需要的特征加以抑制，并不是简单的任务。这主要通过设计或选择合适的照明光源来解决。针对特定的物体和场景，设计／选取成本低廉、安装简单、照明效果好的照明系统，就是我们搭建机器视觉系统首先需要完成的任务。那么什么样的图像才是好的图像呢?一般说来，1幅好的图像需要满足以下条件：1、充分利用视场使被检测物体特征充满视场，从而可以最大限度地利用系统的分辨率；2、对比度合适灰度级的最大值接近255，而最小值接近0；3、焦距准确 图像没有因为景深或运动而不清晰；4、照明均匀，避免反光；5、图像畸变小；6、感兴趣的特征容易被检测识别，其他特征不显示或得到抑制。如果选择的光源，能使图像达到这些基本的要求，就完成了机器视觉系统集成的第1步。B.3成像系统从系统集成的角度，简单列举选择这些硬件的原则。由于相机镜头和板卡经过多年的发展，目前已经相当成熟，而且在国内市场上，选择的余地也不大，一般是本着经济的原则，够用就好。选择相机时，我的建议是，如果可能，就用USB接口或1394接口的相机，这样可以省掉1个板卡的费用，以后硬件或软件升级时工作量会小一些。对于高端的应用，除了CameraLink，似乎别无选择。最新开发的GigE接口相机，由于TCP／IP协议Packet传输的特性，在某些场合是不能保证数据的实时性的，但其最大的优点是，数据线距离可以很长，主机可以安装在办公室内，这样现场就只需要适当地安装和保护相机和镜头。镜头的可选择性更少，除了Computar，Nikon，Tamron，Navitar及Moritex几个制造商外，市场上也没有多少选择空间，当然大多数情况下，也就够用了。如果需要更好的成像效果，可以采用单反相机镜头，这样做一般需要转接口。Fujinon在厦门有生产，可是国内市场上未见销售。德国CarlZeiss镜头很好，可惜价格太贵，不太适合中国市场。B.4计算机系统机器视觉系统的最佳配置，是使用工控机还是使用嵌入式系统?在这个问题上，见仁见智，各有优缺点，主要还是看使用的场合和系统的需求。2种系统的主要特点见下表：项目工控机嵌入式图像处理能力高低扩展性好差体积大小现场安装难，需要机柜容易价格低高垄断程度低高度垄断稳定性较好非常好设置操作容易，键盘、鼠标或者触摸屏较难，一般用JOYstick运行操作自动自动维修简单原供货商才能维修通过这些对比可以看出，如果安装空间允许，选择基于工控机的视觉系统还是有更多的优点的。但是，如果现场必须使用体积很小的嵌入式系统，那么我们别无选择。各公司的成熟产品一般都采用了嵌入式主机，例~HKeyence，0mron，Siemens，Cognex等。这更多的是由于商业销售的考虑，因为这样做可以保证自己产品的独特性，给差异化销售找到借口；另一方面可以使用户自己不能更换零件，从而保证售后服务的利润。B.5图像处理图像处理作为机器视觉系统必不可少的部分，显得如此重要，以至于很多情况下，初学乍到的人会以为图像处理就是机器视觉。其实，我们所说的图像处理实际包含了图像增强和图像分析2个部分。图像增强是指经过某种处理，使图像改变，实现对比度提高、清晰度增加、特征突出等目的；而图像分析是指经过某种运算，来提取某种有用的信息，如有无、好坏、位置等，以便用来进行判断或控制。例如，如何使模糊的图像恢复到清晰，是典型的图像增强处理，只要得到清晰的图像就达到了目的；在繁忙的机场抓拍过往旅客的面孔，找到可疑恐怖分子，则是典型的图像分析过程。经过多年的发展，图像增强算法已经基本成熟，例如提高对比度的灰度拉伸、假彩色、边缘提取、滤波、傅立叶变换、小波变换等。在机器视觉系统集成时，这些一般都是在图像分析前作为图像预处理进行的，而图像分析算法才是机器视觉真正需要解决的问题。通过针对某个真实场景的图像，设计1种算法，来得到有用的信息，完全依赖于技术人员的经验和能力。在这个过程中，公司投入了大量时间和金钱来进行研究，而得到的算法往往具有经济价值，公司或个人都会严格保密。例如，如果机场候机厅里只有1个乘客，那么设计个算法来找到这个乘客的位置，是相对容易的，很多公司或个人都可以实现，而且使用的方法或者计算时间也差不多，而要在成千上万的游客中，找到具有某个特定特征的乘客，就不是那么容易了，各人设计出的算法肯定千差万别，谁能够在最短时间内最可靠地找到目标，就是最有价值的。这种情况下，除了经验之外，灵感和创造能力也很重要。也就是说，作为系统集成所需要的图像处理算法，需要很多的实践经验，而这些算法大多不是能够从书本或文章里学到的。B.6 自动控制作为1个子系统完美配合工作中的机器视觉系统，自然会用到光电传感器、数字IO接口、PLC、运动控制等工业控制元器件，这些方面的知识也是必不可少的。虽然如此，这些都是成熟的技术，有基本的知识直接拿来使用就可以了，不需要我们重新设计，而且零件供应商也会提供一定的技术支持。一般在整个系统的开发过程中，这方面花费的时间和精力是最少的。C、系统集成明确了我们的需求，估计了我们需要配置的资源，理解了各子系统需要完成的工作，就到了把这些知识综合考虑组成1个整机系统的时候了。把这些不同领域里得到的零部件组合在一起，希冀打开电源时就能够完美的工作，是不太现实的。这个过程里有很多意想不到的问题需要解决。一般情况下，我们需要遵循一定的原则，才能使出现的问题最少。这里根据我们的经验给出一些建议。1、尽量使用能够采购的零件(off—the—shelfcomponents)：在可能的情况下，应当尽可能使用现成的备件，如镜头、相机、板卡等，能够买到的东西就不要自己做。我已经多次看到不同的公司和研究室为了节省成本，自己设计制造很容易买到的零件，结果浪费了很多时间，走了很多弯路。例如，有1个公司咨询为什么成像效果不好，我去现场一看，他们使用了1个直径20毫米的凸透镜作为镜头，为了节省成本，15元人民币买来的，可想而知成像效果如何，岂不知连SONY 也不得不向CarlZeiss采购镜头！2、分而治之(divide and conquer)：把系统分割成多个模块，把每1部分集成到一起，确保能够正确地工作，然后再把这些模块组成1个大系统。这和软件开发常用的方法是一样的，只有把1个大的系统分割成小到我们能够很容易处理的小块，才能够有效的完成。这也需要富有经验的项目负责人来完成这项工作。3、充分考虑现场条件：在实验室里开发的系统，安装到使用现场后常常碰到问题。这主要是环境光、电磁干扰和振动几个方面的原因造成的。机器视觉系统毕竟使用了光学系统，安装现场的照明情况或自然光的影响，有时会导致我们设计的算法根本无法工作，从而致使系统失败；工厂的供电一般是带有各种电磁干扰的，很容易从电源线或其他地方进入计算机系统，从而导致系统不能稳定工作。如果系统时而工作正常，时而死机，一般都是这个原因造成的。另外，工业现场各种机器同时工作，有时振动会导致问题。例如，如果算法采用两幅图像相减的方法，肯定不能正常工作，因为振动导致的图像移位，使得图像已经对不准了。这种情况下，尺寸测量也会产生误差。所以，系统集成的过程中，最好能够模拟现场情况，否则很难1次成功。4、把困难乘2：在新产品开发过程中，往往会遇到意想不到的问题。例如，有时候1根电线接触不良就会导致整个系统不工作，而查找这个问题并不是1件容易的事；有时软件有小小的问题，改成正确的代码只需要几分钟，但是也许2个星期也找不到问题所在。所以，整个系统集成时，碰到的问题和解决问题需要的时间往往比预计的要多。越是复杂庞大的系统，越是如此。一般我们需要把已知需要解决的问题总数乘以2或3，才能真正地做出切合实际的工作计划。机器视觉技术是计算机学科的一个重要分支，它综合了光学、机械、电子、计算机软硬件等方面的技术，涉及到计算机、图像处理、模式识别、人工智能、信号处理、光机电一体化等多个领域。自起步发展至今，已经有20多年的历史，其功能以及应用范围随着工业自动化的发展逐渐完善和推广，其中特别是目前的数字图像传感器、CMOS和CCD摄像机、DSP、FPGA、ARM等嵌入式技术、图像处理和模式识别等技术的快速发展，大大地推动了机器视觉的发展。简而言之，机器视觉就是利用机器代替人眼来作各种测量和判断。在生产线上，人来做此类测量和判断会因疲劳、个人之间的差异等产生误差和错误，但是机器却会不知疲倦地、稳定地进行下去。一般来说，机器视觉系统包括了照明系统、镜头、摄像系统和图像处理系统。对于每一个应用，我们都需要考虑系统的运行速度和图像的处理速度、使用彩色还是黑白摄像机、检测目标的尺寸还是检测目标有无缺陷、视场需要多大、分辨率需要多高、对比度需要多大等。从功能上来看，典型的机器视觉系统可以分为：图像采集部分、图像处理部分和运动控制部分。一个完整的机器视觉系统的主要工作过程如下：1、工件定位检测器探测到物体已经运动至接近摄像系统的视野中心，向图像采集部分发送触发脉冲。2、图像采集部分按照事先设定的程序和延时，分别向摄像机和照明系统发出启动脉冲。3、摄像机停止目前的扫描，重新开始新的一帧扫描，或者摄像机在启动脉冲来到之前处于等待状态，启动脉冲到来后启动一帧扫描。4、摄像机开始新的一帧扫描之前打开曝光机构，曝光时间可以事先设定。5、另一个启动脉冲打开灯光照明，灯光的开启时间应该与摄像机的曝光时间匹配。6、摄像机曝光后，正式开始一帧图像的扫描和输出。7、图像采集部分接收模拟视频信号通过A/D将其数字化，或者是直接接收摄像机数字化后的数字视频数据。8、图像采集部分将数字图像存放在处理器或计算机的内存中。9、处理器对图像进行处理、分析、识别，获得测量结果或逻辑控制值。10、处理结果控制流水线的动作、进行定位、纠正运动的误差等。从上述的工作流程可以看出，机器视觉是一种比较复杂的系统。因为大多数系统监控对象都是运动物体，系统与运动物体的匹配和协调动作尤为重要，所以给系统各部分的动作时间和处理速度带来了严格的要求。在某些应用领域，例如机器人、飞行物体导制等，对整个系统或者系统的一部分的重量、体积和功耗都会有严格的要求。机器视觉系统的优点有：1、非接触测量，对于观测者与被观测者都不会产生任何损伤，从而提高系统的可靠性。2、具有较宽的光谱响应范围，例如使用人眼看不见的红外测量，扩展了人眼的视觉范围。3、长时间稳定工作，人类难以长时间对同一对象进行观察，而机器视觉则可以长时间地作测量、分析和识别任务。机器视觉系统的应用领域越来越广泛。在工业、农业、国防、交通、医疗、金融甚至体育、娱乐等等行业都获得了广泛的应用，可以说已经深入到我们的生活、生产和工作的方方面面。在使用机器视觉系统进行检测的具体应用环境中，会有持续进料的应用，或者间歇进料的应用，即目标物会停止一段时间进行检测。这时就需要知道检测目标物的速度能达到多快、目标物的数量以及每分钟进行检测的最大数量，这些数据可以根据视觉系统的处理速度进行计算。其计算方法如下：每分钟检测的最大数量= 60 (sec.) ÷视觉系统的处理速度(sec.)例如：如果视觉系统的处理速度是20ms，那么每分钟检测的最大数量= 60sec.÷0.02sec. = 3000times/min.(= 50 times/sec.)但是实际处理速度根据视觉系统的相机类型和检测设置会有所不同。虽然大多数简单的应用能以20ms的速度运行，在具体应用中最好还是用实际目标物测试一下检测的情况。如果在具体应用中对视觉系统的处理速度有一定要求，可用以下计算方法获得：视觉系统被要求的处理速度(ms)= 1(sec.)÷要求的检测次数(times/sec.)x 1000同时，在实际应用中，被检测目标物在相机的视野范围内持续移动时，还需要考虑相机快门的速度，否则会出现模糊不清的图像，无法达到检测要求。例如，相机在持续移动的生产线上捕捉电子部件的图像时，如果快门速度(曝光时间)对于生产线速度来说不够快，图像就会模糊。为了防止模糊，快门速度需要进行设置，使得相机捕捉图像时，物体移动速度不超过1/10的要求容差值。如下图所示，目标物在相机的视野范围内持续移动。高速快门图像 低速快门图像相机快门速度计算方法：快门速度 = 要求容差[mm]÷生产线速度[mm/sec.]例)检测容差 = 0.2mm生产线速度 = 200mm/sec.快门速度= 0.2mm÷10÷200mm/sec. = 1/10000因此此项应用中理想的快门速度要快于1/10000。如果视觉系统的处理速度较快，在高速生产线上进行检测就一定可行。那么，典型的尺寸检测处理时间需要多久呢?此检测时间根据视觉系统的处理能力以及针对个别应用的设置会有很大的差异，下表提供了捕捉和处理图像所需时间(参考值)的估计底线，用户可根据自己的实际应用进行参考使用。瑕疵检测、污垢检测或芯片检测都是非常典型的机器视觉系统检测的应用方式。根据工件和生产线的状况不同，每种检测都需要不同的功能。本文对机器视觉污点检测工具的原理及使用方法做以简介。1、区段视觉系统透过CCD图像传感器将强度资料的变化检测为污点或边缘。但是，逐个处理像素需要花费大量的时间，并且噪声会对检测结果产生影响。因此，视觉系统使用由数个像素组成的小区域的平均强度，该小区域被称为“区段”，并透过比较这些区段的平均强度来检测污点。如上图中所示将区段(4 x 4 像素)的平均强度与周边地区的平均强度作比较，图中的红色区段被检测出污点。2、污点检测工具的算法(区段的比较和计算方式)检测原理：(1)将 X 方向指定为检测方向时：污点检测工具测量指定区域(区段)的平均强度，并以四分之一个区段为间距改变区段位置。它可确定四个区段中的最大和最小强度之间的差值，其中包括标准区段(下图中的①95)。该差值被视为标准区段的污点等级。当污点等级超过当前阈值时，标准区段被视为污点。被测区域中超过预设阈值的次数被称为“污点范围”。该过程反复进行，从而不断改变标准区段在被测区域中的位置。在圆形工件上检测污点的原理PET 瓶、轴承或O型圈等多种圆形工件需要对圆形区域进行视觉检测。当搜索圆形区域时，程序同时执行极坐标转换。为了检测污点，它将圆形窗口(检测区段)转换为长方形，并在圆形方向和半径方向上比较区段的强度。机器视觉划痕检测的基本分析过程分为两步：首先，确定检测产品表面是否有划痕，其次，在确定被分析图像上存在划痕之后，对划痕进行提取。划痕检测是工业生产中经常遇到的问题，在工业中许多设备的零部件都是在高温、高压的环境中工作的，所受载荷复杂，使用环境恶劣，故障率高，造成的后果也非常严重，因此，对相关部件的缺陷、疲劳裂纹的产生、扩展进行视觉检测就显得尤为重要。划痕通常可分为三大类：第一类划痕，部分灰度值变化并不明显，整幅图像灰度比较平均，划痕面积也比较小，只有几个像素点，灰度也只比周围图像稍低，很难分辨。可以对原图像进行均值滤波，得到较平滑的图像，并与原图像相减，当其差的绝对值大于阈值时就将其置为目标，并对所有的目标进行标记，计算其面积，将面积过小的目标去掉，剩下的就标记为划痕。第二类划痕，各部分灰度差异较大，形状通常呈长条形，如果在一幅图像上采取固定阈值分割，则标记的缺陷部分会小于实际部分。由于这类图像的划痕狭长，单纯依靠灰度检测会将缺陷延伸部分漏掉。对于这类图像，根据其特点选择双阈值和缺陷形状特征相结合的方法。第三类划痕，从外观上较易辨认，同时灰度变化跟周围区域对比也比较明显。可以选择较小的阈值精缺陷部分直接标记。由于在工业检测中图像的多样性，对于每一种图像，都要经过分析综合考虑各种手段来进行处理达到效果。一般来说，划痕部分的灰度值和周围正常部分相比要暗，也就是划痕部分灰度值偏小;而且，大多都是在光滑表面，所以整幅图的灰度变化总体来说非常均匀，缺乏纹理特征。因此，划痕的检测一般使用基于统计的灰度特征或者阈值分割的方法将划痕部分标出。数字相机传输接口比较"}
