{"content2":"iiMedia Research（艾媒咨询）数据显示，2017年中国计算机视觉行业市场规模为68亿元，预计2020年市场规模达到780亿元，年均复合增长率达125.5%。2018年，计算机视觉行业获得了大批融资，企业对行业的研发投入加强，技术获得了突破。\n(欢迎加v：iimediaLucy，参与更多行业交流。)\n以下为报告节选内容：\n2018Q1行业热点：手机厂商跟进AI摄影\n2018年4月，华为发布HUAWEIP20系列，提出“AI智慧摄影”。除了华为，小米、vivo、OPPO、一加等手机厂商也推出了带有AI摄影功能的手机。艾媒大数据舆情监控系统监测显示，“AI摄影”言值数据为61，整体舆论偏正向。艾媒咨询分析师认为，AI摄影能有效缩小普通用户与专业摄影人员的差别，提升手机用户的拍摄体验以及照片质量，网民对AI摄影的评价偏友好。\n2018Q1计算机视觉热点：3D结构光技术\n3D结构光的基本原理是结构光投射特定的光信息到物体表面后，由摄像头采集，根据物体造成的光信号的变化来计算物体的位置和深度等信息，进而高分辨率、高精确度地复原整个三维空间。3D结构光技术运用于人脸识别当中，能够提高识别的精确度和实用性。此前苹果手机已突破这一技术并运用到iPhoneX当中。目前，中国加快3D结构光技术的研发，未来落地市场广阔。2018年2月，云从科技正式在国内首发“3D结构光技术”，打破了苹果FaceID的垄断，成为中国最早一批将结构光技术应用在人脸识别系统的企业。\n计算视觉在广东的讨论度最高，网民舆论偏正向\n艾媒大数据舆情监控系统显示，在系统监测期间，“计算机视觉”在广东地区的讨论度最高，网民评论偏正向。\n预计到2020年中国计算机视觉市场规模达780亿元\niiMediaResearch（艾媒咨询）数据显示，2017年中国计算机视觉行业市场规模为68亿元，预计2020年市场规模达到780亿元，年均复合增长率达125.5%。艾媒咨询分析师认为，计算机视觉商业落地场景广阔，能够有效解决应用行业的痛点，助力应用行业提升运营效率，实现行业升级，市场发展空间巨大。另外，国家政策的扶持也为计算机视觉的发展提供有利的环境，未来计算机视觉市场规模将迎来高速发展。\n人脸识别技术落地应用受网民期待\niiMediaResearch（艾媒咨询）数据显示，均有超过七成的网民表示对照片美化、人脸解锁手机或APP了解过，其中超四成的网民体验过照片美化，近三成的网民体验过人脸解锁手机或APP。艾媒咨询分析师认为，照片美化在网民的渗透率高，能够优化用户拍照体验，受到网民的认可，大众的体验程度高。另外，随着3D结构光人脸识别技术的突破和应用，未来人脸解锁在手机的渗透率将会提升。\n银行业务是网民最为了解的人脸识别技术应用场景\niiMediaResearch（艾媒咨询）数据显示，60.6%的网民表示听过人脸识别技术在银行自主办理业务中的使用，其次是手机解锁、APP应用和安防领域。艾媒咨询分析师认为，金融业、手机应用和安防领域是目前人脸识别技术应用渗透率较高的领域，网民体验程度高、对其认知程度度高。\n交通关卡人脸识别应用的操作简单性最受网民认可\niiMediaResearch（艾媒咨询）数据显示，在体验过高铁、机场、火车等交通关卡人脸识别应用的网民当中，对应用的操作性体验最好，而对稳定性的体验最差。目前交通关卡的人证对比、刷脸进站等服务操作简单，不需复杂的步骤，能使用户快速通过关卡，用户对应用的操作简单性体验良好。\n人脸识别技术的精确性还需提高\niiMediaResearch（艾媒咨询）数据显示，有59.2%网民认为人脸识别技术存在识别不够准确的问题，仅有17.1%的网民认为成本昂贵。\n超过四成网民认为人脸识别技术存在风险\niiMediaResearch（艾媒咨询）数据显示，35.1%的网民认为人脸识别技术安全，44.3%的网民则认为存在风险。而定时更新面部信息资料库、提高辨别精确度则是网民认为提高人脸识别技术安全性的主要途径。\n过半网民看好人脸识别技术的发展\niiMediaResearch（艾媒咨询）数据显示，过半的网民认为人脸识别技术未来发展前景好，将会成为科技发展的主流，仅9.5%的网民认为不够实用，可能会被淘汰。艾媒咨询分析师认为，人脸识别技术日趋成熟，应用场景不断拓展，未来的发展前景广阔。\n网民普遍认为AI摄影能提升拍照体验\niiMediaResearch（艾媒咨询）数据显示，超半数受访网民认为AI摄影能够优化用户拍照体验，只有15.1%的认为AI摄影实际效果不好。\n网民对AI摄影的前景看好\niiMediaResearch（艾媒咨询）数据显示，48.9%的网民认为AI摄影或成为手机未来的发展趋势，34.4%的网民则表示观望的态度。\n商汤科技：多款新品发布\n2018年4月，商汤科技在人工智能峰会发布多个最新产品：增强现实黑科技SenseAR，智能图片视频审核平台SenseMedia，智慧城市、平安城市解决方案SenseFace3.0和SenseFoundry，以及智能汽车产品驾驶员监控系统SenseDriveDMS。较于以往，商汤从技术更多地将关注点转到落地行业、赋能行业上面。\n商汤科技：强化上下游产业链\n2018年4月，商汤科技宣布完成由阿里巴巴集团领投，新加坡主权基金淡马锡、苏宁等投资机构和战略伙伴跟投6亿美元C轮融资。一方面，商汤科技通过融资强化在安防、手机、自动驾驶及互动娱乐等行业应用，另外一面，商汤通过加强于上下游企业的合作，拓展更丰富的应用场景，加速AI技术落地。\n云从科技：专注计算机视觉技术研发和应用\n云从科技成立于2015年3月，是一家孵化于中国科学院重庆研究院、专注于计算机视觉与人工智能的高科技企业。云从科技搭建的“三层研发体系”，覆盖了从前沿科学到市场应用的全过程，为云从聚集技术人才。同时，云从科技利用平台资源、大数据资源，不断实现数据积累、算法迭代、技术更新。\n云从科技：专注计算机视觉技术研发和应用\n2018年以来，云从科技跨镜追踪技术和3D结构光人脸识别技术取得突破。艾媒咨询分析师认为，技术是计算机视觉企业发展基础，提高技术的准确性、加快关键技术的研发，有利于技术商业落地，迅速占领市场份额。\n云从科技：深耕重点行业，推动AI+商业落地\n2017年11月，云从科技宣布完成并由顺为资本、元禾原点、普华资本联合领投B轮5亿元人民币融资，加上此前广州市政府对云从科技的20亿政府资金支持，此次总计获得25亿元发展资金。云从科技凭借自身技术优势，深耕银行、机场、安防等重点行业，并拓展电信业等其它细分市场，为应用行业提供技术赋能。计算机视觉是人工智能发展较为成熟的技术，商业落地机会多，拥有广阔的应用前景和市场机遇。艾媒咨询分析师认为，云从科技聚焦计算机视觉，加速技术在重点行业商业落地，并拓展其他细分领域，不断完善AI布局，有利于加强自身综合竞争能力。\n云从科技：精耕用户需求，不断优化产品\n云从科技为用户提供软、硬件以及一体化的服务。云从科技深入银行、安防等行业，了解客户真正的需求，结合场景不断做出新的产品和解决方案，进而解决应用场景的痛点，提升应用场景的运营效率，实现理论创新到产业应用，从而赢得用户口碑，实现企业持续健康发展。\n中国计算机视觉行业未来发展趋势\n头部公司战略投资、收购相关领域初创公司或成常态\n头部公司面临业务快速扩张，但存在技术和商业落地场景欠缺等问题。在多轮融资后，头部公司手握大量资金，通过战略投资的方式能够解决技术短板和商用实现周期长的问题，并推出可快速复制的产品或者服务，进而扩大自身现有优势。而对产业上下游的初创公司来说，当前行业市场竞争加剧，要自建技术团队、自研出较高水平技术，拓展应用场景，难度高投入大，接受头部公司的投资能够增强自身技术水平、提高竞争力。头部玩家通过战略投资、收购相关领域初创公司等方式，加强与产业上下游企业的合作，将是未来计算机视觉行业发展的一个趋势。\n应用场景进一步渗透，形成AI+\n当前，计算机视觉技术在金融领域、安防领域、手机端、广告领域应用比较广泛，并向新零售、智能工厂、无人驾驶、智能医疗等领域拓展，计算视觉技术的延伸和应用逐渐体现出其可持续发展的重要价值。随着计算机视觉技术成熟，行业应用解决方案的建立和完善，应用行业智能化转型需求的增长，以及政府政策对计算机视觉行业的扶持和对人工智能教育的普及，计算机视觉行业的应用场景将进一步渗透，形成AI+，将助力各应用行业解决行业痛点，提高运营效率，实现行业转型和升级。\n5G时代加速到来，计算视觉产业迎来发展机遇\n当前，5G技术取得突破，有望在2020年实现大规模商用。5G网络速率量级提升和时延降低的特点，将给计算机视觉技术在垂直行业应用带来突破性增长，如在工业自动化、机器人、自动驾驶等领域，计算视觉产业将迎来新的发展机遇。比如，在交通出行上，5G的低时延+大带宽将确保远程操控安全，满足各种自动驾驶场景诉求，提升自动驾驶在通行中的安全性，实现自动驾驶的规模化商用。在智慧安防的打造上，5G技术将为安防提供数据基础，促进安防神经系统的构建，助力公共部门实现高效运营和维护公共安全。5G时代的到来，将给计算视觉行业带来更大的市场机遇，形成新的增长点。\n关于艾媒咨询\niiMedia Research(艾媒咨询)是全球知名的新经济产业第三方数据挖掘和分析机构，2007年诞生于广州，在广州、香港、北京、上海、硅谷设有运营和分析机构。艾媒咨询致力于输出有观点、有态度、有结论的研究报告，以权威第三方实力，通过艾媒大数据决策和智能分析系统，结合具有国际化视野的艾媒分析师观点，在产业数据监测、调查分析和趋势发展等方向的大数据咨询具有丰富经验。艾媒每年公开或定制发布新经济前沿报告超过2000份，覆盖了人工智能、新零售、电商、教育、视频、生物、医疗、音乐、出行、房产、营销、文娱、传媒、金融、环保与公共治理等领域，通过深入数据挖掘，通过数学建模，分析推理与科学算法结合，打造有数据、有理论支撑的大数据分析成果。艾媒咨询的数据报告、分析师观点平均每天被全球超过100家主流媒体，1500家(个)自媒体、行业KOL广泛引用，覆盖语言类型包括中、英、日、法、意、德、俄、阿等约二十种主流官方版本。\n基于公司独立自主研发的“中国移动互联网大数据挖掘与分析系统(CMDAS)”，艾媒咨询建立了互联网运营数据、企业舆情和商情、用户属性和行为偏好、零售数据挖掘、广告投放效果、商业模式等多维度的数据监测体系，可视化还原“数据真相”，实现市场趋势的捕捉和用户信息的洞察，提升品牌的行业竞争和影响力。"}
