{"content2":"版本：0.1\n本文是知识的综述，内容基本来源于网络和以前学到的东西。欢迎补充和更正。\n对于标题的三个定义，大部分情况下不需要分清楚。但当我们提到强人工智能时，有必要把相关的定义解释清楚，以便更准确的理解和交流。其实随着人工智能的不断发展，每个定义也在不停地变化。\n人工智能\n人工智能是一个基本的概念。从广义上来说，计算机实现的都可以算作人工智能，因为计算、记忆等就是智能的一部分。最开始，人类还没有计算机的时候，其实很多人就在考虑意识和智能到底是什么了，当时这还算是个哲学问题。到了机械制造较发达以后，有些人就觉得大脑就是一堆齿轮。当然还有把大脑想成别的东西的。从有了一定的制造能力后，人们还是很想制造出智能的，这时候应该是人工智能这个概念产生的时候。顺便提一句，人类也是最近一两百年才理解大脑才是思维的中心，而不是心脏。\n后来，计算机的产生与发展来源于军事的解密，后来造原子弹之类的。当时的计算机就是纯粹完成一些人类的需要几个月，一堆人才能做出来的数学题。（参考《暗算》的场景，中国的人海战术）这时候的机器有了记忆和计算的能力。\n再后来，随着计算机的硬件和软件的越来越通用，科学家们开始考虑如何将人类的知识和判断用计算机来实现，甚至实现和人一样的智能。如果这个目标实现了，理所当然可以叫做“人工智能”。当然最初的时候，大家以为写一堆if...else...就能把医学专家，石油勘探专家复制出来了，或者让计算机能够理解自然语言。这个过程中有很多成功的例子，可能有些现在还在解决实际的问题。但这个方向之算是一个捷径吧，有些专业的问题在人的逻辑认识复杂度之内的，都可以用这个方法来解决。但是很多模糊的，或者太庞杂的问题，就很难写出足够的if...else来解决了。这样的系统也无法解决通用问题。\n神经网络和机器学习\n差不多在专家系统发展的同时，现在所称的人工智能就出现了。一个方向是研究神经细胞，并模仿神经细胞的方式来解决问题，叫做人工神经网络（可简称神经网络）；另外一个方向是建模，并用统计的方法来解决问题，叫做机器学习。这时候，基本上专家系统就被排除在人工智能的概念之外了。因为一堆硬编码的if...else...已经不能体现出计算机系统的优越性了（半开玩笑，专家系统不容易解决更多通用的问题，开发成本也相对较高）。\n神经网络和机器学习这两个概念其实是相互重叠的，但又不完全相同。神经网络是从其结构来说的，类似于人类的神经结构，有神经细胞，树突和轴突，它们之间还会形成突触。另外还有整合、激发等特点。而机器学习是从其功能上来说的。主要是指计算机通过已知数据的训练，对逻辑有了统计上的认知，从而能够对需要解决的问题给出答案，甚至是未知问题。这里的“未知问题”不表示所有的未知问题，而是很多我们看起来是未知问题，但其抽象的结果还是一个已知问题，也可叫做元问题。\n现在很多机器学习的算法都是基于神经网络的，也有一些不是神经网络的算法用于机器学习。（我读书少，就不列举了。）大部分神经网络（也许所有）的算法都可以转化为矩阵。无外乎是节点及其之间的联系。有些神经网络几乎不需要学习，所以也不能管它们叫做机器学习。但大部分这类算法只能解决有限类型的问题，实际应用范围比较窄。\n当今的人工智能一般是灰盒的，知道输入和输出，但不一定能看懂里面的逻辑。其实我们日常的生活大部分都是这样的，告知需求，然后等待结果。这是人类活动和合作的模式。比如，一个软件项目，用户只关心功能方面的问题，不关心里面的代码和具体写出来的逻辑；理发的时候我们关心发型，不关心哪里要先剪，具体要剪多少。我们希望人工智能也是这样的，也只有这样才像个智能。但实际情况是，虽然解决了从输入到输出不需要对中间的逻辑过分关心的问题。但需要花大量时间来调整输入，以及整个模型的参数，直到给出的输出在一定输入范围内的答案满意为止。换句话说，虽然有了一个通用的模型可以解决很多问题，但还是要在每个具体的的问题上花很多时间去创建一个特定的模型。和人相比，计算机的优势是一旦模型创建出来，就能很稳定，且大规模、快速的解决问题。\n强人工智能\n大概从上世纪80年代的人工智能热以来，人工智能虽然有了很大的发展，发明了BP这样的能够处理复杂网络的算法，也解决了很多问题。但其智能仍然完全无法和人，甚至简单的虫子相提并论。（最近好像虫子项目已经能实现虫子级的智能了，等学了之后来更新。）所以，需要用个词语来区别于现有的人工智能。强人工智能和人工智能差了一个“强”字，以前我给这个概念用的“真”字。“强”当然是指的比现在的人工智能要强，其也是一个模糊的概念，到底是要强到像人这样呢，还是比人还强？这个概念随着人工智能的发展，会进一步变化。“真”指的就是和人一样的，真正的智能。（好吧，这也是相对的，没准儿某个智力发达的物种不认同我们是有真智能的物种。）有些地方还会用“超”人工智能的概念，指的是比人类还高的智能。\n现在的人工智能已经在各行各业广泛的应用起来，解决了很多实际的问题，也大大的解放了生产力。貌似人类也不需要更强人工智能。在没有电、没有手机之前，估计很多人也没觉得需要什么新东西。关于为什么需要强人工智能的问题，下一篇再讨论。"}
