{"content2":"文章发布于公号【数智物语】 （ID：decision_engine），关注公号不错过每一篇干货。来源 | 互联网周刊(ID:ciweekly)01人工智能标志着第四次工业革命按照 2017 年李开复与王咏刚先生合著的《人工智能》一书中的描述，人工智能是会学习的计算机程序。这种具有学习能力的计算机程序崛起以后，为什么能以迅雷不及掩耳之势影响各个行业呢？从教育到医疗，从金融到建筑，从安防到环保，到处都有人工智能的痕迹。要解释这个问题，还必须站在人类历史的长河中回望审视。人类与一般动物的区别在于：人类可以制造与使用工具。所以在人类的文明史上，工具代表着生产力的发展水平。人类钻木取火，有了火之后就学会了青铜器的烧制，随后就有了铁器，于是人类掌握了农业生产的工具，就可以开垦荒地播种粮食；到了文艺复兴之后，牛顿科学革命肇始，人类发明了蒸汽机，在这些工具的帮助下，人类进入了第一次工业革命时代。从此以后，人类开始告别田园牧歌的社会，正如恩格斯在《英国工人阶级状况》中写道的那样：“新生的工业能够这样成长起来，只是因为它用机器代替了手工工具，用工厂代替了作坊。”如果说蒸汽机的发明导致了第一次工业革命，而电动机的发明导致了第二次工业革命。那么以微软、苹果与 IBM 为代表的个人电脑的出现，标志着第三次工业革命。而人工智能技术的兴起，则表明第四次工业革命已经在路上了。人工智能是整个人类大历史发展的潮流，这种潮流不以任何个人的意志为转移，所以它能在各行各业找到应用场景。02中国企业在人工智能时代抓住了风口在前三次工业革命中，因为在中国没有诞生现代科学，并采取了闭关锁国的封闭政策，所以中国最终落后于当时的时代发展。落后就要挨打，在这段历史进程中，中国有了一部辛酸的现代史。但是，阳光总在风雨后，在 2016 年开启的“第四次工业革命”中，中国不但没有落后于时代，而且在一定程度上还领先于世界——这是中华民族伟大复兴的一个显著标志。目前中国已经涌现了大量的人工智能企业，而且在各行各业的产业化做得相当不错。据报道，截止到 2018 年 6 月，中国一共有 1000 余家人工智能企业，比软件强国印度还多出来 200 多家，企业总数量仅次于美国。而到了 2018 年末，全国人工智能企业数量进一步增长，相关企业共计 4000 余家。除了在企业方面，中国人工智能论文总量和高被引论文数量也占据世界第一的位置。以 2017 年为例，中国在人工智能领域论文的全球占比 27.68%，遥遥领先其他国家。在人工智能专利方面，中国已经成为全球人工智能专利布局最多的国家，数量略领先于美国和日本，而中美日三国占全球总体专利公开数量的 74%。人工智能需要有大数据作为原料，而中国有全球最多的人口，也有大量的工业传感器与互联网数据，基于这些基础条件，中国在大数据方面有独特的优势。这也为人工智能在中国的发展提供了坚实的基础。03人工智能铺就中国复兴之路中国在人工智能各个领域都有了一批代表性的企业。在人工智能计算机视觉领域，其落地应用遍地开花。在安防摄像头领域，主要有无人值守的场地看管、刷脸门禁、以及发现异常自动报警装置等，在这里主要的代表性公司有海康威视、大华股份等传统大公司与商汤科技、云从科技、依图科技以及旷视科技等独角兽企业，这四家公司被称为人工智能计算机视觉的“四小龙”，它们的产品在张学友演唱会上抓逃犯的过程中发挥了重要作用。在交通摄像头领域，主要是识别车辆车牌，进而进行车辆套牌分析、交通违章分析等智慧城市解决方案，在这个领域的人工智能计算机视觉的头部公司有格灵深瞳等。在金融领域，计算机视觉主要用于快速信贷审核、刷脸支付与刷脸开户等应用，在这个行业的代表性企业有商汤科技、旷视科技 Face++ 等。在医疗领域，计算机视觉主要用于智能诊断与疾病研究和精准医疗方面，在这个垂直领域的代表性企业有阿里云ET医疗大脑等。在汽车领域，计算机视觉主要用于无人驾驶，代表性的企业有百度等。百度最近与金龙汽车合作发布了阿波龙无人驾驶汽车。在无人机领域，计算机视觉主要应用于物流运输以及路径规划、地质灾害监控等，在这个领域的代表性企业是大疆科技。不久前，《科学美国人》与世界经济论坛发布了 2018 年十大新兴技术，人工智能辅助新药研发就是其中之一。目前，在全球有至少 100 家企业正在探索新药研发的人工智能方法，在国外，葛兰素史克、默克、强生与赛诺菲公司都已经布局人工智能新药研发。在中国，也涌现了深度智耀、零氪科技与晶泰科技等人工智能新药研发企业，药明康德也战略投资了美国的一家人工智能新药研发公司。在人工智能芯片领域，华为海思与寒武纪等公司纷纷布局相关芯片，云知声、出门问问、Rokid 等国内人工智能初创企业也纷纷推出了自己的芯片或模组。比如云知声发布了人工智能语音芯片雨燕以及面向智慧出行的车规级多模态人工智能芯片雪豹；而思必驰携手中芯国际，发布人工智能语音芯片 TAIHANG 。云米科技也发布了人工智能仿生芯片“悟空”。中国在人工智能金融服务中也涌现了大量优质企业。在中国出现了第四范式这类主攻银行业精准营销的人工智能公司。在教育领域，智能化的程度不断提升，近年来涌现出一批像松鼠AI、英语流利说这样充分利用人工智能技术的新型教育企业。对于中国这个在时间尺度上绵延了数千年的超级大国而言，实际上在汉唐宋以来的过去很长的一段历史内，中国在经济上与技术上领先于世界各国。只不过在工业革命以来，中国开始落后于西方。随后就有了清朝中叶开始的一系列战争赔款与“丧权辱国”的不平等条约，使得中华民族陷入了痛苦的深渊。不过，令人欣慰的是，在历经百余年的风雨洗礼之后，中华民族已经开启了复兴之路。2016 年以后，中国抓住了“人工智能”这个“第四次工业革命”的风口，中国企业积极参与到了这场新时代竞争之中。2016 年，国务院印发《新一代人工智能发展规划》，提出了面向 2030 年我国新一代人工智能发展的指导思想、战略目标、重点任务和保障措施，部署构筑我国人工智能发展的先发优势。规划提出，要建立财政引导、市场主导的资金支持机制，要利用天使投资、风险投资、创业投资基金及资本市场融资等多种渠道，引导社会资本支持人工智能发展。还要积极运用政府和社会资本合作等模式，引导社会资本参与人工智能重大项目实施和科技成果转化应用。04结语在如此大规模的支持下，人工智能产业不仅已经成为新的经济增长点，人工智能技术应用也成为改善民生的新途径，中华民族的伟大复兴也必将伴随着人工智能。* 本文经《互联网周刊》授权转载，如需转载，请联系出处。星标我，每天多一点智慧"}
