{"content2":"﻿﻿\n微软创投加速器最新成果展示：人工智能技术杀入时尚界\n发表于23小时前| 843次阅读| 来源CSDN| 1 条评论| 作者周建丁\n人工智能计算机视觉深度学习数据分析微软创投加速器\nwidth=\"22\" height=\"16\" src=\"http://hits.sinajs.cn/A1/weiboshare.html?url=http%3A%2F%2Fwww.csdn.net%2Farticle%2F2015-08-09%2F2825417&type=3&count=&appkey=&title=%E5%9C%A88%E6%9C%888%E6%97%A5%E7%9A%84%E5%BE%AE%E8%BD%AF%E5%88%9B%E6%8A%95%E5%8A%A0%E9%80%9F%E5%99%A8%E7%AC%AC%E5%85%AD%E6%9C%9F%E5%B1%95%E7%A4%BA%E6%97%A5%E5%B1%95%E7%A4%BA%E7%9A%84%E6%88%90%E6%9E%9C%E6%98%BE%E7%A4%BA%EF%BC%8C%E4%BA%BA%E5%B7%A5%E6%99%BA%E8%83%BD%E3%80%81%E6%95%B0%E6%8D%AE%E5%88%86%E6%9E%90%E5%92%8C%E4%BA%91%E5%B9%B3%E5%8F%B0%E4%BB%8D%E7%84%B6%E6%98%AF%E6%8A%80%E6%9C%AF%E5%88%9B%E4%B8%9A%E7%9A%84%E6%9C%80%E4%BD%B3%E6%96%B9%E5%90%91%EF%BC%8C%E8%80%8C%E4%B8%8E%E5%A4%A7%E4%BC%97%E7%94%9F%E6%B4%BB%E5%8F%8A%E5%AD%A6%E7%94%9F%E5%AD%A6%E4%B9%A0%E7%9B%B8%E5%85%B3%E7%9A%84%E9%A1%B9%E7%9B%AE%E6%9B%B4%E5%AE%B9%E6%98%93%E8%8E%B7%E5%BE%97%E6%8A%95%E8%B5%84%E4%BA%BA%E7%9A%84%E9%9D%92%E7%9D%90%E3%80%82&pic=&ralateUid=&language=zh_cn&rnd=1439212877348\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\">摘要：在8月8日的微软创投加速器第六期展示日展示的成果显示，人工智能、数据分析和云平台仍然是技术创业的最佳方向，而与大众生活及学生学习相关的项目更容易获得投资人的青睐。\n在8月8日的微软创投加速器第六期展示日展示的成果显示，人工智能、数据分析和云平台仍然是技术创业的最佳方向，而与大众生活及学生学习相关的项目更容易获得投资人的青睐。\n在第六期15家团队分享了各自的创新产品成果之后，投资人、媒体和历届创业团队代表的现场投票结果表明，用人工智能技术做时尚的码隆科技最受欢迎，做无人机的亿航和移动应用云服务提供商APICloud次之。此外，基于Docker技术打造的灵雀云也在互动中被投资人和媒体人屡屡提及。\n人工智能\n码隆科技创始人黄鼎隆介绍，码隆科技基于深度学习与计算机视觉打造“有时尚品味的视觉决策引擎”，其CTO是曾任微软高级研发主管的Matt Scott，麾下聚集来自Google、腾讯、百度的研发人才。借助CNN，其StyleAI系统能够“看懂”和“理解”任意照片里面（如商场模特、晚霞、宠物、美食）的时尚元素，对随手拍的照片进行颜色、花纹、材质的精准分析，随即通过时尚大数据获取相关时尚穿搭信息，提供实时决策建议。产品端的How-Fashion.net，则提供实时指数、五维时尚分析及社交功能，颇有微软How-Old.net的风格。\n码隆科技创始人黄鼎隆介绍深度学习与计算机视觉在时尚领域的应用\n据说，码隆科技未来还将用基于深度学习的自动化图片处理系统，完全取代人工来搜集、处理、管理和调用海量时尚数据。\n另外一家初创一搭科技，也有志于将人工智能引进到日常穿衣搭配，不过目前还需要更多人为干预。一搭科技创始人张扬正介绍，一搭通过技术算法以及时尚编辑的专业推荐，根据用户的身材、脸形、五官比例以及不同场合推荐适合的搭配。\n此前我们了解到的图片搜索引擎衣+（奇点大学中国区学员），同样也是面向时尚市场，通过无监督学习、有监督学习和梯度下降法的结合对服装商品属性进行自学习。可见时尚领域对人工智能技术的欢迎程度。\n记者还没有机会和码隆科技及衣+进行过详细的交流，不知道其深度学习和机器视觉的具体应用情况，但应用本身就是人工智能发展的一个重点，复杂背景下的人体检测和衣物分割，对光照的鲁棒性和对款式的识别，都不是简单的事情。\n正如中国科学院院士、中国人工智能学会副理事长谭铁牛在2015中国人工智能大会上预言，“人工智能技术的发展将对传统行业产生重大颠覆性影响，‘智能+X’将成为创新时尚”，相信“智能+时尚”的创业创新会推动人工智能技术的落地。\n如果说码隆科技及衣+的概念成分偏多，那么智齿科技通过大数据及自然语言处理技术打造的智慧客服，就已经是实在的应用，乐视、海尔、360都是他们的用户。通过智慧客服，这些企业可以把90%的问题交给机器客服解答，人工客服可以解答10%的最关键的问题，据说每年节省60%的客服成本，工作效率提升300%。智慧客服技术要点包括：采用谷歌算法进行语义分析，精准理解客户需求匹配最佳答案；机器学习自动分析用户问题，构建完整知识库，实现自我成长；以及多维度用户数据分析等。\n亿航公司做的是智能无人机，被问到“智能如何体现”时，亿航工作人员回答是“可以通过手机来控制”。亿航科技联合创始人熊逸放表示，亿航通过APP，有很多一键式的傻瓜操控，将操控飞机姿态的复杂操控变得非常简单，并研发了智能跟随等智能化的功能。其三款产品，分别可搭载便携相机、专业单反和行业拍摄器，后者可用于判断是否喷洒农药、森林失火急救。\n严格说来，亿航这种无人机其实距离人工智能还很遥远（当然亿航也没说自己是做人工智能的），甚至第三款产品也没有涉及图像处理。余凯也曾经表示，智能的本质是自我学习，通过遥控来操作的无人机不能算是人工智能。但在人工智能的初级阶段，即便是Google Project Wing，也还没有做到安全的自主飞行，所以目前来说APP操控未尝不是好的解决方案，可惜熊逸放没有谈到一个手机同时控制多个无人机的实现情况。\n此外，记者在展区看到了洋葱、数信互融和乐驾科技。洋葱做基于脸型、声音、指纹和二维码的身份认证，已经应用在UCloud、Worktile、美团云、UPYUN、明道、蘑菇街等。现场工作人员演示了嵌入第三方平台的刷新登录和支付，当被问及双胞胎、照片识别问题时，洋葱技术人员表示，目前动态形体识别的准确率还不够稳定，但多因素认证可以提升效果，如人脸+声纹。\n洋葱的人脸识别是内部研发的，声纹则采用了科大讯飞公司的声纹识别算法。人脸识别+声纹识别，这也是科大讯飞在2015年上半年极力推广的方案，可以跨平台。不过，洋葱技术人员表示，如果有别的声纹技术效果更好（目前看来可能性还很小），洋葱也会考虑更新，由此也可看到，人工智能领域竞争的十分激烈。\n数信互融借助大数据和机器学习做互联网金融风控，乐驾科技则研发了基于语音与手势操控的HUD智能车载机器人，语音交互技术来源于思必驰公司。期待半年之后可以看到他们更详细的应用介绍。\n数据分析\n数据分析方面想提日志易和IT桔子，面向运维监控和创业投资决策的很实用的项目。日志易针对的是来源和格式杂乱的机器数据，日志易创始人陈军表示，“日志易就是机器大数据的搜索引擎”，可以用于运维监控的实时分析、日志挖掘，通过日志分析发现APT攻击，对安全审计也有用。\n日志易的研发团队有来自BAT的成员，也有来自Splunk的工程师，其系统可以搜索、分析任何文本格式的日志，支持TB级的处理，已经申请12项技术发明专利，并且采用Spark大数据处理框架获得了Databricks的认证。\n日志易的实际应用速度也很快，陈军表示：\n日志易在去年10月份上线发布，已经有几十个大的企业用户，以及近千家中小企业。有陌陌、乐视、网宿这样的互联网企业，也有国家开发银行、平安集团这样的金融集团；另外日志易提供SaaS版，已经在小米云、京东云、金山云、腾讯云等国内主流云平台上面提供分析服务。\nIT桔子则是一个互联网创业投资信息数据服务平台，已收录和实时跟踪国内创业公司20,000多家，为创业者、投资人提供创业信息和数据支持服务。IT桔子创始人文飞翔表示，IT桔子的价值主要在2个方面：\n有最新的创业公司信息，包括团队、业务、竞争对手等等，让投资人可以快速的了解创业项目。\n可以帮助投资人挖掘细分行业的投资机会，IT桔子已经覆盖十多个大行业，通过大公司格局帮助大家快速了解投资重点行业。\n云平台\nAPICloud平台用户数已超过2000万，其创始人兼CEO刘鑫表示，APICloud的核心理念就是一个“快”字，支持移动应用快速迭代。APICloud采用的方式就是“云端一体”，为开发者从“云”和“端”两个方向提供API，简化移动应用开发，可以减少云应用开发过程中70%的工作量。APICloud提供了三个产品：跨平台应用引擎，移动平台，和模块STORE。\n跨平台应用引擎：将苹果和安卓应用大量复杂的、常用的功能进行平台化，将一个应用拆分成导航、菜单。\n移动PaaS平台：用来解决云平台和开发，包括数据存储、统一分析、版本管理以及一些创新性的云的功能。功能特色，比如数据存储，开发者不再需要关注代码，只需要在线设置数据库，数据表可以全自动帮助他生成服务器端，从而提升服务器的开发效率。\n模块STORE：APICloud第一款生态性的产品，可以让第三方的云服务在APP中落地更快更直接。比如即时通讯用到分享功能，APICloud都是一站式的提供。\n可见，中国云计算市场PaaS层企业过得相对艰难，或许面向移动和智能联网设备的PaaS是中国PaaS的福音。\n然而，PaaS还要面临新的CaaS（容器即服务）的挑战，那就是灵雀云在做的事情。灵雀云创始人兼CEO左玥表示，IaaS平台配置繁琐，PaaS平台有更多的限制，相对复杂的应用不能运行起来，灵雀云以Docker技术为核心，在这个平台上，开发人员只需要关注应用的服务器，以及连接的方式，彻底忘记虚拟机和配置服务，复杂应用也可以在灵雀云上使用。包括一键部署，负载均衡，自动报警等。灵雀云今年6月份上线，其客户包括微软、金山等世界级云平台，还有知名的O2O平台，以及千万用户的游戏交友平台。\n其他\n最后还想提一款社交型个人CRM——客脉，比较有意思的是，团队CEO是移动CRM公司纷享销客的创始人兼CEO罗旭，但客脉是面向个人的，围绕维护老客户和开发新客户的需求。通过客脉，销售人员可以随时在手机上查阅客户资料，维护客户信息，记录和客户沟通的过程，记录业绩和提成，查看费用。当然，更重要的是这些信息不会随着销售人员的工作变动而丢失。\n客脉还提供有数据查询功能，自动整合搜索引擎、招聘网站、工商数据网站等，帮助销售找到客户信息。如果这些信息不全，销售人员可以在“客脉圈”中通过匿名问答的形式进行沟通，在客脉圈中匹配客户，以及交流相同客户的需求与痛点。\n第七期入选初创企业名单公布\n与往常一样，微软创投加速器最后公布了第七期团队名单，从1000多家申请企业中杀出重围的20家企业，仍然不乏许多致力于将数据分析、人工智能、移动技术应用于金融、健康、环境、安全等不同领域的公司。\n现场公布微软创投加速器第七期入选初创企业\n20家初创企业名单及创业方向如下：\nGrowingIO：用数据驱动企业增长，提供全自动移动互联网数据分析决策系统\n禾赛科技：激光气体检测和智慧城市环境大数据平台\n云报销：解决企业报销、审批、费控等财务流程问题的 SaaS 应用\n助理“来也”：最贴心的私人助理，通过对话和推荐技术连接人和本地商业\n微猫：国内第一家服务APP的移动电商云平台\n众量网：众包式量化投资策略市场和基金\n万卡：下一代智能金融IC卡，移动支付的安全卫士\nVIPHRM：基于SaaS平台，免费为全国中小企业提供一站式HR云端服务\n欣兆阳科技：围绕企业的客户旅程，对营销活动进行自动化、个性化，跨渠道管理的营销云\n融云：开发者首选的即时通讯云服务\n乐驾科技：基于HUD+语音操控人机对话的智能车载机器人\nPing++：移动应用开发首选的支付 SDK\n洋葱：基于云和用户生物特征的身份验证服务\n赛福基因：基于人类全基因组大数据精准解析的疾病筛查、用药指导及个性化健康管理\nAbleCloud：支持智能联网设备开发与管理的的PaaS平台\n数信互融：为互联网金融行业提供精准的风险定价及资产量化服务，提升风控水平、促进资产流动\ne税客：全国中小企业的手机办税及发票服务\nMaxent：最准确最可信赖的设备指纹技术专家\n侯斯特：微信公众号应用商店\n玲珑沙龙：服务于城市女性的兴趣沙龙移动社区\n结语\n微软创投加速器自2012年7月在中国启动，到现在已是三周年，已经毕业的106家企业的产品及服务，覆盖5亿个人用户和过百万企业用户，整体估值达234亿人民币，可见上述技术方向的代表性"}
