{"content2":"英特尔人工智能圆桌论坛举行 四位大咖论道AI\n2017-04-01 17:57\n北京2017年4月1日电 /美通社/ -- 毫无疑问，人工智能已是最具变革力的发展趋势之一，在3月31日举行的2017英特尔中国媒体纷享会上，以“The NEXT：走进人工智能时代”为主题的圆桌论坛激起激烈的观点碰撞，诸多热点话题得到进一步的探讨和解读。\n在资深媒体人董军的主持下，英特尔中国研究院院长宋继强，新华网董事、副总裁申江婴，人工智能专家、清华大学计算机系教授、博士生导师邓志东以及通信专家、720健康科技有限公司创始人项立刚以独特视角和锐利洞察，为人工智能的发展建言献策。\n【金句集锦】\n申江婴新华网董事、副总裁\n在3月31日举行的2017英特尔中国媒体纷享会上，以“The NEXT：走进人工智能时代”为主题的圆桌论坛激起激烈的观点碰撞，诸多热点话题得到进一步的探讨和解读。\n现在谈数据洪流、谈大数据是恰逢其时。人工智能在今年处于非常重要的地位，也可以把它形容成进入一个爆发期，进入了快速发展期的元年。\n可能是需求最迫切的，又能得到国家政策认同的地方，往往是产业突破的机会。其中的关键点有两个非常重要，一个是信息的收集和感知能力，一个是信息的分析、挖掘、深度处理能力。\n邓志东人工智能专家、清华大学计算机系教授、博士生导师\n人工智能是数据驱动的，数据的价值需要深入的挖掘。人工智能其实现在还是处在弱人工智能的阶段，应该是非常初步的，就是起步阶段。如果没有大数据的支撑，没有数据洪流，现在人工智能是做不了太多事情，达不到人类水平，还没有革命性的进展。\n很多应用领域、垂直细分领域都需要布局人工智能的产品，人工智能前沿技术需要去探索。\n宋继强英特尔中国研究院院长\n人没有时间和能力处理这么多数据，必须依靠人工智能。要让机器以一种智能的方式对外界的反应做出相应的反馈，要求具备三个能力，一是要有采集外界刺激的能力，要有感知的能力，二是怎么做出对外界的反馈，三是有很多好的算法。\n人工智能现在处于爆发前夜，但是对整个发展长河来讲还属于早期。人工智能的突破点是靠深度学习推动了视觉领域的突破和自然语言识别的突破，这两个领域推动的产业会率先落地。\n项立刚通信专家、720健康科技有限公司创始人\n第七次信息革命是智能互联网、移动互联、智能感应、大数据和智能学习共同整合起来的一个新能力。\n人工智能还处在刺激和反应的阶段，在这个过程中需要大数据。通过大量的刺激、反应，这个过程中逐渐形成一个逻辑判断能力。再往后走就是生命密码，生命密码就可以迁移，这样的能力可以迁移到不同的产品或者技术里面去。\n谈数据洪流：人工智能释放数据价值\n人工智能的发展关键在于数据洪流的驱动，作为各个领域的专家，嘉宾们对数据洪流也有着深刻体会。\n“以前我们想产生数据挺不容易，现在仅仅用智能手机拍一张照片，就能轻松地把数据从物理世界带到数字世界。而现在数据的产生是源源不断的，人本身已经没有时间和能力处理这么多数据，就必须依靠人工智能，否则就会被数据淹没。”宋继强通俗易懂地讲出了自己的看法。\n记者出身的申江婴认为“数据洪流”这个词很有创意，他回忆起上世纪90年代在报道里常用的“信息爆炸”一词，并直言现在看起来这样的说法并不准确，而随着互联网等一系列新技术的发展，“信息爆炸”才真正产生，现在谈“数据洪流”恰逢其时。\n邓志东认为，信息化也就是数字化、网络化的发展，大数据的涌现是很明显的，而人工智能也是数据驱动的，所以数据的价值需要深入挖掘，“我有一个深刻印象，比如无人驾驶，激光雷达、毫米波雷达、摄像头以及导航数据等，这是非常庞大的数据，要应对这种挑战，就需要人工智能技术的发展。”\n“我们迎来第七次信息革命，它是智能互联网、移动互联、智能感应、大数据和智能学习共同整合的新能力，各种力量会像洪水一样汹涌而来”，项立刚表示，“这场革命到来的时候不仅生活方式会改变，我们的哲学、伦理、道德、文化等都会改变。“\n谈发展阶段：目前仍属初期\n数据洪流为人工智能提供丰沃的成长土壤，前景也非常广阔，而放眼当下，它究竟处于怎样的发展阶段？\n宋继强表示，不同的人对人工智能有不同的解读，从内部决策、对外界做出反馈这个维度讲，人工智能已经到达一个突破点，但整体而言，人工智能的发展还属于早期，还需要以技术升级实现产业升级。\n申江婴认为，人工智能处于快速发展期的元年。他从三个维度阐释自己的观点：大数据领域，目前处于信息过载状态，就需要精准分析和挑选；物联网的发展，对人工智能的需求愈发强烈；人工智能已经成为一个地区、一个行业甚至一个国家的战略竞争力。\n“人工智能还处在弱人工智能的阶段，是非常初步的”，邓志东表示，“如果没有数据洪流，人工智能做不了太多事情。如果有完备的大数据，选好特定的应用场景，它确实可以接近或者达到人类的水平和能力。”\n项立刚也认为人工智能还很初期，从技术的角度来说是刚刚开始，“但是从产业来说已经看到未来很多的机会，我一直相信未来是有巨大机会的，现在需要踏踏实实做好第一步。”\n谈应用领域：无人驾驶、智能家居、机器人、虚拟现实……\n虽然嘉宾们认为人工智能仍在初期，但前景毋庸置疑。人工智能到底会从哪儿率先落地？什么应用会成为人工智能的杀手级应用？\n“最重要的就是选好特定的应用场景，选有完备大数据的场景。具体来说，比如物联网或者人工控制环境的一些产业，以及无人驾驶，我觉得这是有可能成功的商业落地的应用场景”，邓志东表示。\n项立刚认为，“技术是帮助改变我们生活的，让我们生活效率更高、成本更低、服务更好，活得更幸福。”他认为，智能家居和医疗领域，或将迎来人工智能的率先突破。\n“产业突破和技术领先是两个概念”，申江婴表示，我们需要对产业、对需求有深度理解，“需求最迫切，又能得到国家政策认同的领域，可能往往是产业突破的机会。”\n宋继强表示目前人工智能的突破点是视觉和自然语言识别，这两个领域推动的产业会率先落地，对于新兴产业而言，虚拟现实、精准医疗等有着很大机会，以及无人驾驶、机器人等领域，都需要人工智能的突破和应用。\n谈如何突破：数据被多次“点名”\n广阔前景的实现离不开技术创新，哪些技术的突破能够帮助人工智能向前迈一大步？\n“人工智能的突破是靠很多有标记的数据训练出来的，训练好的模型只适合于这一件事，所以目前在技术方面突破一个是能够跨领域”，宋继强接着谈到，“另外要让人工智能真正走出计算机，现在有些应用还是捆绑在PC或者手机上，真正让人工智能去接触实际的各种设备就等于走出计算机，交互能力和真正环境中的适应能力都很需要。”\n申江婴认为重点在于产业链整合能力的突破，他特别点出两个关键，一个是信息的收集和感知能力，另一个则是信息的分析、挖掘、深度处理能力。\n邓志东认为一是要人工智能产品与产业的发展，这方面大数据与应用场景特别重要；二是要人工智能前沿技术的探索，比如要做认知智能，现在所谓的人工智能，只有识别能力没有理解能力。\n“人工智能还处在刺激和反应的阶段，在这个过程中需要大数据”，项立刚认为现在还是要踏踏实实做好这第一步。他认为，计算能力、存储能力和信息交互能力非常重要，需要凭此抽离出几个、几十个简单的规则，使之成为人工智能某种意义上放之四海而皆准的“生命密码”，从而推动人工智能的发展。\n作为英特尔中国研究院院长，宋继强最后表示，英特尔一直在人工智能的发展中扮演着重要角色，现在正从幕后走向台前，将凭借全栈实力，通过技术创新实现真正的产业升级，降低使用门槛，推动人工智能的民主化，并多方合作推动人工智能发挥正能量。"}
