{"content2":"在经历了蛮荒的PC互联网时代，混战的移动互联网时代，到现今最火的人工智能时代。大数据、云计算、机器学习的技术应用，已经使得IT从业者的门槛越来越高。套用一句樊登读书会的宣传口号“keep learning”，保持对新鲜技术的好奇心，保持对技术应用的责任心，持续关注、学习是每个IT从业者的必备技能。\n一、什么是人工智能？\n人工智能（Artificial Intelligence），英文缩写为AI。\n它是一个融合计算机科学、统计学、脑神经学和社会科学的前沿综合学科。\n它使得计算机像人一样拥有智能能力，可以代替人类实现识别、认知，分析和决策等多种功能。\n比如当你说一句话时，机器能够识别成文字，并理解你话的意思，进行分析和对话等。\n二、人工智能发展简史\n1956年，几个计算机科学家相聚在达特茅斯会议（Dartmouth Conferences），提出了“人工智能”的概念。其后，人工智能就一直萦绕于人们的脑海之中，并在科研实验室中慢慢孵化。\n之后的几十年，人工智能一直在两极反转，或被称作人类文明耀眼未来的预言；或者被当成技术疯子的狂想扔到垃圾堆里。坦白说，直到2012年之前，这两种声音还在同时存在。\n上世纪90年代，国际象棋冠军卡斯帕罗夫与”深蓝” 计算机决战，”深蓝”获胜，这是人工智能发展的一个重要里程碑。而 2016 年，Google 的 AlphaGo 赢了韩国棋手李世石，再度引发 AI 热潮。\n过去几年，尤其是2015年以来，人工智能开始大爆发。很大一部分是由于GPU的广泛应用，使得并行计算变得更快、更便宜、更有效。\n当然，无限拓展的存储能力和骤然爆发的数据洪流（大数据）的组合拳，也使得图像数据、文本数据、交易数据、映射数据全面海量爆发。\n三、人工智能发展条件\n1、硬件发展：AI 不断爆发热潮，是与基础设施的进步和科技的更新分不开的，从 70 年代 personal 计算机的兴起到 2010 年 GPU、异构计算等硬件设施的发展，都为人工智能复兴奠定了基础。\n2、数据发展：互联网及移动互联网的发展也带来了一系列数据能力，使人工智能能力得以提高。\n3、运算发展：计算机的运算能力从传统的以 CPU 为主导到以 GPU 为主导，这对 AI 有很大变革。\n4、算法发展：算法技术的更新助力于人工智能的兴起，最早期的算法一般是传统的统计算法，如 80 年代的神经网络，90 年代的浅层，2000 年左右的 SBM、Boosting、convex 的 methods 等等。随着数据量增大，计算能力变强，深度学习的影响也越来越大。尤其是2011 年之后，深度学习的兴起，带动了现今人工智能发展的高潮。\n四、机器学习：一种实现人工智能的方法\n机器学习(Machine Learning, ML)是一门多领域交叉学科，涉及概率论、统计学、逼近论、凸分析、算法复杂度理论等多门学科。\n机器学习是人工智能的核心，是使计算机具有智能的根本途径，其应用遍及人工智能的各个领域，它主要使用归纳、综合而不是演绎。\n机器学习最基本的做法，是使用算法来解析数据、从中学习，然后对真实世界中的事件做出决策和预测。\n与传统的为解决特定任务、硬编码的软件程序不同，机器学习是用大量的数据来“训练”，通过各种算法从数据中学习如何完成任务。\n机器学习最成功的应用领域是计算机视觉，虽然也还是需要大量的手工编码来完成工作。人们需要手工编写分类器、边缘检测滤波器，以便让程序能识别物体从哪里开始，到哪里结束；写形状检测程序来判断检测对象是不是有八条边；写分类器来识别字母“STOP”。使用以上这些手工编写的分类器，人们总算可以开发算法来感知图像，判断图像是不是一个停止标志牌。\n【机器学习有三类】：\n第一类是无监督学习，指的是从信息出发自动寻找规律，并将其分成各种类别，有时也称”聚类问题”。\n第二类是监督学习，监督学习指的是给历史一个标签，运用模型预测结果。如有一个水果，我们根据水果的形状和颜色去判断到底是香蕉还是苹果，这就是一个监督学习的例子。\n最后一类为强化学习，是指可以用来支持人们去做决策和规划的一个学习方式，它是对人的一些动作、行为产生奖励的回馈机制，通过这个回馈机制促进学习，这与人类的学习相似，所以强化学习是目前研究的重要方向之一。\n五、深度学习：一种实现机器学习的技术\n值得一提的是机器学习同深度学习之间还是有所区别的，机器学习是指计算机的算法能够像人一样，从数据中找到信息，从而学习一些规律。虽然深度学习是机器学习的一种，但深度学习是利用深度的神经网络，将模型处理得更为复杂，从而使模型对数据的理解更加深入。\n深度学习是机器学习中一种基于对数据进行表征学习的方法。深度学习是机器学习研究中的一个新的领域，其动机在于建立、模拟人脑进行分析学习的神经网络，它模仿人脑的机制来解释数据，例如图像，声音和文本。\n同机器学习方法一样，深度机器学习方法也有监督学习与无监督学习之分．不同的学习框架下建立的学习模型很是不同．例如，卷积神经网络（Convolutional neural networks，简称CNNs）就是一种深度的监督学习下的机器学习模型，而深度置信网（Deep Belief Nets，简称DBNs）就是一种无监督学习下的机器学习模型。\n如上图，人工智能是最早出现的，也是最大、最外侧的同心圆；其次是机器学习，稍晚一点；最内侧，是深度学习，当今人工智能大爆炸的核心驱动。\n六、人工神经网络：一种机器学习的算法\n人工神经网络（Artificial Neural Networks）是早期机器学习中的一个重要的算法，历经数十年风风雨雨。神经网络的原理是受我们大脑的生理结构——互相交叉相连的神经元启发。但与大脑中一个神经元可以连接一定距离内的任意神经元不同，人工神经网络具有离散的层、连接和数据传播的方向。\n例如，我们可以把一幅图像切分成图像块，输入到神经网络的第一层。在第一层的每一个神经元都把数据传递到第二层。第二层的神经元也是完成类似的工作，把数据传递到第三层，以此类推，直到最后一层，然后生成结果。\n每一个神经元都为它的输入分配权重，这个权重的正确与否与其执行的任务直接相关。最终的输出由这些权重加总来决定。\n我们以“停止（Stop）标志牌”为例，将一个停止标志牌图像的所有元素都打碎，然后用神经元进行“检查”：八边形的外形、消防车般的红颜色、鲜明突出的字母、交通标志的典型尺寸和静止不动运动特性等等。神经网络的任务就是给出结论，它到底是不是一个停止标志牌。神经网络会根据所有权重，给出一个经过深思熟虑的猜测——“概率向量”。\n回过头来看这个停止标志识别的例子。神经网络是调制、训练出来的，时不时还是很容易出错的。它最需要的，就是训练。需要成百上千甚至几百万张图像来训练，直到神经元的输入的权值都被调制得十分精确，无论是否有雾，晴天还是雨天，每次都能得到正确的结果。\n只有这个时候，我们才可以说神经网络成功地自学习到一个停止标志的样子；或者在Facebook的应用里，神经网络自学习了你妈妈的脸；又或者是2012年吴恩达（Andrew Ng）教授在Google实现了神经网络学习到猫的样子等等。\n吴教授的突破在于，把这些神经网络从基础上显著地增大了。层数非常多，神经元也非常多，然后给系统输入海量的数据，来训练网络。在吴教授这里，数据是一千万YouTube视频中的图像。吴教授为深度学习（deep learning）加入了“深度”（deep）。这里的“深度”就是说神经网络中众多的层。\n现在，经过深度学习训练的图像识别，在一些场景中甚至可以比人做得更好：从识别猫，到辨别血液中癌症的早期成分，到识别核磁共振成像中的肿瘤。Google的AlphaGo先是学会了如何下围棋，然后与它自己下棋训练。它训练自己神经网络的方法，就是不断地与自己下棋，反复地下，永不停歇。\n七、人工智能的研究领域和分支\n人工智能研究的领域主要有五层：\n1、最底层是基础设施建设，包含数据和计算能力两部分，数据越大，人工智能的能力越强。\n2、往上一层为算法，如卷积神经网络、LSTM 序列学习、Q-Learning、深度学习等算法，都是机器学习的算法。\n3、第三层为重要的技术方向和问题，如计算机视觉，语音工程，自然语言处理等。还有另外的一些类似决策系统，像 reinforcement learning（编辑注：增强学习），或像一些大数据分析的统计系统，这些都能在机器学习算法上产生。\n4、第四层为具体的技术，如图像识别、语音识别、机器翻译等等。\n5、最顶端为行业的解决方案，如人工智能在金融、医疗、互联网、交通和游戏等上的应用，这是我们所关心它能带来的价值。\n八、人工智能的应用场景\n1、计算机视觉\n2000年左右，人们开始用机器学习，用人工特征来做比较好的计算机视觉系统。如车牌识别、安防、人脸等技术。而深度学习则逐渐运用机器代替人工来学习特征，扩大了其应用场景，如无人车、电商等领域。\n2、语音技术\n2010 年后，深度学习的广泛应用使语音识别的准确率大幅提升，像 Siri、Voice Search 和 Echo 等，可以实现不同语言间的交流，从语音中说一段话，随之将其翻译为另一种文字；再如智能助手，你可以对手机说一段话，它能帮助你完成一些任务。与图像相比，自然语言更难、更复杂，不仅需要认知，还需要理解。\n3、自然语言处理\n目前一个比较重大的突破是机器翻译，这大大提高了原来的机器翻译水平，举个例子，Google 的 Translation 系统，是人工智能的一个标杆性的事件。2010 年左右， IBM 的”Watson”系统在一档综艺节目上，和人类冠军进行自然语言的问答并获胜，代表了计算机能力的显著提高。\n4、决策系统\n决策系统的发展是随着棋类问题的解决而不断提升，从 80 年代西洋跳棋开始，到 90 年代的国际象棋对弈，机器的胜利都标志了科技的进步，决策系统可以在自动化、量化投资等系统上广泛应用。\n5、大数据应用\n可以通过你之前看到的文章，理解你所喜欢的内容而进行更精准的推荐；分析各个股票的行情，进行量化交易；分析所有的像客户的一些喜好而进行精准的营销等。机器通过一系列的数据进行判别，找出最适合的一些策略而反馈给我们。\n九、人工智能的未来之路\n1、在计算机视觉上，未来的人工智能应更加注重效果的优化，加强计算机视觉在不同场景、问题上的应用。\n2、在语音场景下，当前的语音识别虽然在特定的场景(安静的环境）下，已经能够得到和人类相似的水平。但在噪音情景下仍有挑战，如原场识别、口语、方言等长尾内容。未来需增强计算能力、提高数据量和提升算法等来解决这个问题。\n3、在自然语言处理中，机器的优势在于拥有更多的记忆能力，但却欠缺语意理解能力，包括对口语不规范的用语识别和认知等。人说话时，是与物理事件学相联系的，比如一个人说电脑，人知道这个电脑意味着什么，或者它是能够干些什么，而在自然语言里，它仅仅将”电脑”作为一个孤立的词，不会去产生类似的联想，自然语言的联想只是通过在文本上和其他所共现的一些词的联想， 并不是物理事件里的联想。所以如果要真的解决自然语言的问题，将来需要去建立从文本到物理事件的一个映射，但目前仍没有很好的解决方法。因此，这是未来着重考虑的一个研究方向。\n4、当下的决策规划系统存在两个问题，第一是不通用，即学习知识的不可迁移性，如用一个方法学了下围棋，不能直接将该方法转移到下象棋中，第二是大量模拟数据。所以它有两个目标，一个是算法的提升，如何解决数据稀少或怎么自动能够产生模拟数据的问题，另一个是自适应能力，当数据产生变化的时候，它能够去适应变化，而不是能力有所下降。所有一系列这些问题，都是下一个五或十年我们希望很快解决的。\n参考：\n腾讯 AI Lab 张潼主任带你轻松 get AI 新知识\nhttps://www.qcloud.com/community/article/666041\n人工智能、机器学习和深度学习之间的区别和联系\nhttps://www.cnblogs.com/dadadechengzi/articles/6575767.html\n百度百科：人工智能\nhttps://baike.baidu.com/item/%E4%BA%BA%E5%B7%A5%E6%99%BA%E8%83%BD/9180\n百度百科：机器学习\nhttps://baike.baidu.com/item/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0\n百度百科：深度学习\nhttps://baike.baidu.com/item/%E6%B7%B1%E5%BA%A6%E5%AD%A6%E4%B9%A0/3729729\n百度百科：人工神经网络\nhttps://baike.baidu.com/item/%E4%BA%BA%E5%B7%A5%E7%A5%9E%E7%BB%8F%E7%BD%91%E7%BB%9C\n本站转发：人工智能、机器学习、深度学习和人工神经网络\nhttp://www.cnbruce.com/blog/showlog.asp?log_id=1422\n人工智能：为机器赋予人的智能\n机器学习：一种实现人工智能的方法\n深度学习：一种实现机器学习的技术\n人工神经网络：一种机器学习的算法"}
