{"content2":"人工智能简史\n全书没提作者身份，我看过后确定是专业科研工作者。在网络上搜索，有比较可靠的信息来源说作者是人工智能一线科学家，国家千人计划专家。\n全书涉及到不少专业内容，作者在序言中说大部分章节都适合高中以上文化程度读者阅读，我认为至少得是IT从业人员才有可能读懂一半以上的内容因而才能有兴趣读下去。\n作者从人工智能的发源说起，细数行业的典故与内幕。内容涉及到学者们的思想、各门各派的师承与争斗、主要的争论点、在商业上的应用等。虽然基本是欧美的故事，还有几个中国人的名字出现。\n书中有不少有趣的八卦与内幕，作者也毫不掩饰对哲学、对一些大公司的鄙视。\n以下是书中一些内容的摘抄：\n1：戴维斯的几篇关于定理证明历史的文章题目下面都不忘写一行“纪念王浩”。王浩毕业于神奇的西南联大数学系，曾和杨振宁同屋，一战结束后又到清华大学在金岳霖和王充钧指导下得了哲学硕士，到哈佛大学后跟随美国最有影响的哲学家蒯因研究逻辑和分析哲学。P31\n2：事实上，是哲学家罗宾逊和码农罗宾逊用蒯因的入门教科书《逻辑方法》教会了数学家沃思逻辑。P32\n3：“文革”后的中科院数学所派系纷杂，关肇直和华罗庚不和，吴文俊和吴新谋不和。乘着华罗庚在欧洲访问，关笔直在中科院副院长钱三强的支持下，迅速成立中科院系统科学所，吴文俊毫不犹豫地跟随关肇直到了系统所。P42\n4：四色定理证明后，一些哲学家开始挑刺儿，王浩和普特南的学生铁木钦科(Thomas Tymoczko)提出了这样的问题：四色定理算被证明了吗?谁看见了这个证明过程7这听起来有点像乔姆斯基对统计派机器翻译的批评。有黑箱子的理解不能算理解，有黑箱子的证明也不能算证明。P47\n5：有些领域，一开始就把百分之八十的容易问题都解决了，而后就一直很难，进展很慢，少有突破。人工智能就是这样，定理证明尤其如此。P49\n6：一个领域成熟与否的主要测度之一是赚不赚钱。人工智能没有商业应用一直是被批评的原因之一。专家系统时代最成功的案例是DEC的专家配置系统XCON。DEC是PC时代来临之前的宠儿，他们用小型机冲击IBM。P65\n7：互联网催生的电子商务，有很多和XCON类似的应用场景，于是新瓶装旧酒、专家系统摇身一变，改名规则引擎，成为中间件的标配。征信、反欺诈和风险控制一直是规则系统擅长的领域，征信公司FICO收购了一系列一直苟延残喘的专家系统公司，包括Forgy的RulesPower, 目前已经很少有独立的专家系统公司了。P66\n8：w3c语义网的工作后来在一些准逻辑学家加入后引入了描述逻辑，变得貌似严格起来，经过几次迭代后演化成大杂烩，理论上不严谨，实践中不可用。所谓“万事开头难”，但开了一个坏头，则是灾难，为后人修正制造了人为障碍。P75\n9：五代机给日本八提供了一个弯道超车的机会，日本同行认为有了五代机，就可以任信息产业里甩掉山寨的帽子。日本在软件方面大约落后十年，但如果五代机能够成功，那将是日本后发制人的又一案例。P87\n10：当时，所有的美国商学院都用日本索尼Walkman的成功作为案例，想说明日本会占据技术市场。把美国过去几十年的商学院系列教材拿出来翻翻倒是蛮有意思的，那些当时貌亿惊人的案例，没过多久就都完蛋了。……商学院教学的信用完全是建立在人们的健忘上。P91\n11：五代机的衰落在1988年就已露出端倪。……给人感觉五代机不会在任何相关领域取得突破性进展，而同时八杆子打不着的领域也拼命向五代机靠拢。就像当下人工智能领域的创业，一些和人工智能毫无瓜葛的社会闲杂人员一夜间都成了AI专家，拿到VC的钱之后再想干啥。P94\n12：晚年在纽约生活陷入困顿的【《牛虻》作者】伏尼契，靠苏联和周恩来特批的稿费得以善终。这一家子把中国、苏联、革命、逻辑和神经网络都联系起来了，通吃“吃啥补啥”派和“想啥来啥”派。P110\n13：图灵在曼彻斯特大学的同事普林茨(Dietrich Prinz)接着图灵的思路，在1951年写了一个残局程序，能在离将死还有两步的情况下，找到最优解。这个问题也被称为\"两步将死”（mate-in-two）问题。 P118\n14：1966年，……苏联科学院的理论与实验物理研究所(ITEP)也在本所研制的一台M20计算机上开发了一款下棋程序，他们要和斯坦福大学的Kotok-McCarthy程序一决高下。从1966年11月22日开始，直到1967年3月1o日止，他们通过电报的方式走了四局。最后苏联3:1战胜美国。P121\n15：在“深蓝”赢了卡斯帕罗夫之后，职业棋手并没有因此而改行，他们反而更多地依赖计算机来训练。而职业比赛的解说者也越来越多地借助计算机程序来分析解说一场比赛。机器作为教练，反而更快地帮助人类棋手进步。P125\n16：大体上说，问答系统有三个必备的组成部分，第一部分是问题理解，第二部分是知识查询，第三部分是答案生成。这三个部分相辅相成，第一部分和第三部分是自然语言处理的工作，它们通过知识图谱被有机地整合在一起，在定理证明火的时候，被当成狗皮膏万能灵药。P153\n17：IBM吸取了深蓝的教训，沃森在Jeopardy！节目上取得的宣传成功后，很快变成了IBM人工智能事业的品牌，IBM很快推出了沃森金融、沃森医疗、沃森教育等。现在IBM整个公司都围绕沃森转型了，也许IBM觉得“人工智能”这个词儿太俗了，他们非要标新立异地自诩为“认知计算”。P154\n18：就像一个哲学问题找到了科学的角度(formulation)，就不再是哲学问题一样，一个人工智能问题一旦解决，就不再是人工智能问题。大概很快人们就会认为语音问题不再是人工智能的核心问题。如果说语音翻译不涉及自然语言理解和语义，可能也不会有什么异议。P155\n19：哲学家有两类，一类是深刻的，一类层混饭的。罗素和弗里格是深刻的，没有他们，就不会有数理逻辑，也就不会有哥德尔、丘奇、图灵、以及后来的计算机科学。但没有现代的欧陆哲学，世界不过省了些粮食而已。P182\n20：但科学进步的过程就是与哲学渐行渐远的过程。当下的科学已经和哲学关系不大，一战后的欧陆哲学已经和科学彻底无缘。偏重科学和逻辑的英美分析哲学也挡不住哲学的颓势，最后一个从哲学中脱离的硬学问是逻辑，目前最好的逻辑学家都在数学系和计算机系，哲学已经空洞化。P191\n21：人脑中总共有860亿个神经元，其中大脑皮层有16o亿个神经元，大脑皮层的神经元数量决定了动物的智力水平，人的大脑皮层中神经元数量远高于其他物种，所以人类比其他物种更聪明。P217\n22：【《终极算法》的】作者的研究领域层如何把这些算法统一起来。我们不禁怀疑，即使把这些算法都能整台起来，是不是就构成了终极算法呢了难道不会有新的算法被发明出来吗了例如作者列的单子里明显缺失了强化学习，这是一个很老的算法，在2016年随着A1phaGo才得以扬名。P225\n23：物理学家改行的科幻作家阿西莫夫曾提出机器人三定律，第一条就是机器不能伤害人，但“什么是伤害”本身就不好定义。AlphaGo战胜李世石和柯洁，算是对他们的伤害吗?即使是科学家兼幻想家，也未必就能把不远的未来想明白。维纳和阿西莫夫可能都不懂计算理论。P228"}
