{"content2":"CDA字幕组 翻译整理\n本文为 CDA 数据分析师原创作品，转载需授权\n\n最近，Google Cloud发布了名为“AI Adventures”的系列视频，介绍了机器学习的概念、学习方法和一些工具。\n每个视频时间在5-15分钟内不等，用简单易懂的语言让初学者了解AI以及机器学习的方方面面。\n观看更多国外公开课，点击\"阅读原文\"\n视频主讲人是Google Cloud的开发者和布道师 Yufeng Guo，一位年轻有为的华裔小哥哥。这位小哥哥逻辑清晰，语音纯正。在观看视频的同时不仅能学习AI方面的知识，对英语学习也很有帮助哦。\nCDA字幕组目前在对该系列视频进行汉化，今天带来第一讲：机器学习是什么?之后将继续连载，欢迎关注和支持~\n附有中文字幕的视频如下：\nAI Adventures-第一讲机器学习是什么\nclass=\"video_iframe\" data-vidtype=\"2\" allowfullscreen=\"\" frameborder=\"0\" data-ratio=\"1.7647058823529411\" data-w=\"480\" scrolling=\"no\" data-src=\"http://v.qq.com/iframe/player.html?vid=k0525m9i852&width=670&height=376.875&auto=0\" style=\"display: block; width: 670px !important; height: 376.875px !important;\" width=\"670\" height=\"376.875\" data-vh=\"376.875\" data-vw=\"670\" src=\"http://v.qq.com/iframe/player.html?vid=k0525m9i852&width=670&height=376.875&auto=0\"/>\n针对不方便打开视频的小伙伴，CDA字幕组也贴心的整理了文字版本，如下：\n(文末有彩蛋! )\n世界中充满了数据，大量的数据。图片、音乐、文字、电子表格还有视频。而且在短时间内丝毫没有放缓的趋势。机器学习给所有的数据带来意义。\n\nArthur C. Clarke有一句名言(英国作家 发明家 主要作品《2001太空漫游》)。\n\"任何足够先进的技术无异于魔法\"。\n我发现与其说机器学习是魔法，不如说是可以利用的工具和技术，从而用你的数据解答问题。\n这是Cloud AI Adventures系列视频，我叫 Yufeng Guo。在每一期视频中我们将探究机器学习的艺术 科学以及工具。在这一过程中我们将发现，获得精彩的体验以及得出有价值的见解是多么的简单。\n机器学习的价值刚刚开始显现。如今世界中充满了数据，这些数据不仅仅由人类产生的，还由计算机、手机和其他设备产生。在将来这只会持续地增加。\n我们身边的数据\n从传统层面来说，人们分析数据并改进系统去适应数据模式的变化。然而随着数据量超过人类理解以及手动编写规则的能力，我们将越来越多的转向自动系统。自动系统能够从数据中学习，更重要的是从数据的变化中学习，从而适应所面临的大转变。\n机器学习无处不在\n在如今使用的产品中，我们总可以看到机器学习的身影。这些产品背后都有机器学习的参与，但这不总是那么明显。\n比如给照片中的物体和人加标签，这很显然有机器学习的参与。但是视频网站自动推荐接下来看的视频，就不那么明显了。然而这也是通过机器学习实现的。\n当然，最明显的例子就是谷歌搜索引擎。每次你使用谷歌搜索，当中都包括了很多机器学习系统。从理解你搜索的文字，到根据你的个人兴趣调节搜索结果。\n比如当你搜索\"Java\"时，根据你是咖啡方面的专家还是开发人员把哪个结果放在最上面。是优先显示Java咖啡豆，还是Java编程语言。也许你两者都是。\n如今机器学习的即时应用已经无处不在，包括图像识别、欺诈检测以及推荐系统。同时还包括文本系统和语音系统。\n这些强大的功能可以适用于广泛的领域，比如糖尿病视网膜病和皮肤癌检测、零售业以及交通方面，比如自动停车和自动驾驶汽车。\n不远的将来\n不久之前，当公司和产品中包含机器学习技术这会被认为很新奇。而现在每家公司都设法在产品中使用机器学习，这迅速成为了理所应该的特点。正如我们期待公司提供，能够在手机设备上运行的网站或者相关APP。\n很快我们的科技将具有个性化，有洞察力以及能够自我修正。\n随着我们利用机器学习，让人类的各种任务比起以往能够更快更容易完成。我们可以看得更长远一些，比如机器学习能够帮助我们达成凭借一己之力无法完成的任务。\n幸运的是，如今利用机器学习并不难。工具发展的很不错，你所需要的就是数据、开发人员以及敢于冒险的意志。\n使用数据解答问题\n在这里，我把机器学习的定义减少为五个词。\n\"使用数据解答问题\"\n(using data to answer questions)\n我们可以把该定义分成两个部分：\"使用数据\" 和\"解答问题”。\n这两部分大致论述了机器学习的两方面，两者都一样重要。\"使用数据\"也就是我们所说的训练；”解答问题\"也就是做出预测或者推理。\n下面让我们简单看下这两部分。训练就是使用数据来创建和调整预测模型，该预测模型之后可以对新的数据进行预测，并解答那些问题。随着收集的数据越来越多，模型会不断改进，从而部署出新的预测模型。\n数据是关键\n你可能注意到了，整个过程的关键部分是数据，一切都依赖着数据。\n数据是开启机器学习的钥匙，同样，机器学习也是开启隐藏在数据中见解的钥匙。\n以上只是机器学习的简介，关于其重要性和一些应用。机器学习是一个广泛的领域，贯穿于各种从数据中得出答案的技术。\n接下来还有什么\n在之后的视频中我们将讲解，针对给出的数据集应该用哪些方法以及关于你想解答的问题，还包括提供实现这些功能的工具。\n下一个视频中我们将深入探讨，在给出更多细节的情况下，如何进行机器学习的具体步骤。通过一步步递进深入，关于如何解答机器学习问题。\n下期预告：机器学习的七个步骤\n\n谷歌教你学 AI -第二讲机器学习的7个步骤\n翻译: VV  校对: Mika\n本文为 CDA 数据分析师原创作品，转载需授权\n\nGoogle Cloud发布了名为\"AI Adventures\"的系列视频，用简单易懂的语言让初学者了解机器学习的方方面面。\n观看更多国外公开课，点击\"阅读原文\"\n上一期主要讲了机器学习的概念(谷歌教你学 AI -第一讲机器学习是什么?)，今天让我们一起看到第二讲：机器学习的7个步骤。\n主讲人还是来自Google Cloud的开发人员，华裔小哥Yufeng Guo。让我们在学习AI知识的同时来提高英语吧。\nCDA字幕组目前在对该系列视频进行汉化，之后将继续连载，欢迎关注和支持~\n附有中文字幕的视频如下：\nAI Adventures-第二讲机器学习的7个步骤\nclass=\"video_iframe\" data-vidtype=\"2\" allowfullscreen=\"\" frameborder=\"0\" data-ratio=\"1.7647058823529411\" data-w=\"480\" scrolling=\"no\" data-src=\"http://v.qq.com/iframe/player.html?vid=o05267wgt03&width=670&height=376.875&auto=0\" style=\"display: block; width: 670px !important; height: 376.875px !important;\" width=\"670\" height=\"376.875\" data-vh=\"376.875\" data-vw=\"670\" src=\"http://v.qq.com/iframe/player.html?vid=o05267wgt03&width=670&height=376.875&auto=0\"/>\n针对不方便打开视频的小伙伴，CDA字幕组也贴心的整理了文字版本，如下：\n(文末有彩蛋! )\n从检测皮肤癌到给黄瓜分类，以及检测需要维修的电梯，机器学习赋予了计算机系统全新的能力。但它的背后到底是如何运作的呢?我们来看一个简单的例子，并借此来聊一聊运用机器学习从你的数据中得到信息的过程。\n\n欢迎来到Cloud AI Adventures，我的名字叫Yufeng Guo。在这个节目里，我们会探索机器学习的艺术性、科学性以及相关工具。\n假设我们要构建一个系统用来判断酒水是红酒还是啤酒。我们构建的这个问答系统称为模型，构建这个模型的过程称为训练。\n机器学习中训练的目的是建立一个准确模型，在大多数情况下能够地准确回答问题。但是为了训练这个模型，我们需要收集用于训练的数据，这就是我们开始着手的地方。\n红酒还是啤酒\n我们通过装着红酒或啤酒的杯子来收集数据，酒水中包含了方方面面的数据信息。比如泡沫的数量、杯子的形状等。\n但是出于我们的目的，只需要两个简单的信息。颜色，记录为光的波长；酒精含量，记录为百分比。希望仅仅通过这两个因素，我们能够分辨出这两种酒。从现在开始我们把这两点称为特征，颜色和酒精含量。\n第一步就是去杂货店买各种不同的酒，以及用于测量的设备。光谱仪用来衡量颜色，比重计用来衡量酒精含量。\n第1步：收集数据\n一旦设备和酒都齐全了，就可以开始进行机器学习真正的第一步：收集数据。\n这一步非常重要，因为你所收集数据的质量和数量将直接决定预测模型的效果。这个例子里 我们收集的数据就是，每种酒水的颜色和酒精含量。\n这样我们就可以得出一个表格，关于每种酒的颜色和酒精含量，是啤酒还是红酒。这将成为我们的训练数据。\n第2步：数据准备\n经过几小时的测量，我们得到了训练数据，也许还喝了几杯。下面是机器学习的第二步：数据准备。我们将数据加载到合适的地方。进行处理从而用于机器学习的训练。\n首先把所有数据放在一起，任意排列。不要让数据的顺序影响到学习的效果，排列并不是判断酒水种类的因素。换句话说，我们不想让序列中酒水的前后排列顺序，影响对酒水种类的判断。\n这时也可以对数据进行相关可视化，帮助判断不同变量之间是否存在相应关系，以及是否存在数据失衡。\n例如，如果我们收集的数据点中啤酒的数据要远多于红酒，那么训练出来的模型就会有严重的偏差，偏向把酒水都判断为啤酒。因为在大部分情况下这不会错。然而在实际情况中，模型会处理差不多数量的啤酒和红酒。意味着判断为啤酒一半情况都是错的。\n我们还需要把数据分成两部分，用于训练模型的第一部分将是数据集的主要数据；第二部分用于评估训练模型的效果。\n我们不想把训练用的数据用于评估，因为模型会记住这些问题。就像你不会把数学作业里的问题作为考试内容一样。\n有时我们收集的数据需要其他方式的调整和处理。比如去重、标准化、误差修正等等。这些都在数据准备过程中进行。在这里我们不需要进一步的数据准备，所以让我们继续。\n第3步：选择模型\n我们工作流程的下一步是：选择模型。\n在过去研究者和数据科学家，已经建立了很多模型。有些非常适用于图像数据；有些适用于文字、音乐这种序列数据；有的适用于数字数据，还有一些适用于文本数据。\n这里我们只有两个特征：颜色和酒精含量，我们用一个小型线性模型就足够了。这个模型很简单但足以完成任务。\n第4步：训练\n现在进行下一步，这通常被认为是机器学习的主体部分：训练。\n这一步我们将用数据，逐步提高模型预测酒水为红酒或啤酒的能力。这有点类似初次学开车，一开始初学者完全不知道踏板 把手、开关的作用，或者什么时候要用到。但是经过许多次的练习和纠错，就能成为有驾照的司机了。在开车一年之后就成为老司机了。在现实中驾驶提高了驾驶水平，磨练了技术。\n针对酒水我们将从更小的范围着手。直线方程是y=m*x+b。x是输入，m是斜率，b是y轴截距，y是直线x位置上的值。我们能够调整和训练的值只有m和b，m是斜率，b是y轴截距。没有其他改变直线位置的方式，因为变量只有x输入和y输出。\n机器学习中可能存在很多m，因为有很多特征。这些值通常构成矩阵，称为w即权重矩阵。类似的我们把b集合在一起，称为偏差。\n训练过程包含对w和b赋予一些随机数初始化，以及尝试用这些值预测输出。可以想象一开始结果会很糟糕。但是我们可以将模型预测值与应该得出的值进行比较，进而调整w和b的值。这样下一次能够得出更准确的预测。\n然后不断重复这个过程。每次更新权重和变量的迭代或周期称为一个训练步骤(training step)。看看这对我们的数据集具体意味着什么。\n就像在数据中任意画一条线。随着训练的进展，这条线一步步移动，逐步接近区分红酒和啤酒的理想方式。\n第5步：评估\n一旦训练完成，就要进行评估，查看模型的效果。\n这时就要用到之前预留的数据。评估让我们用训练中未使用的数据测试模型，这个指标让我们用新数据测试模型的性能，这可以代表模型在现实情况中的效果。\n根据经验法则，我一般将训练和评估数据按照80/20或者70/30分配。大多情况下取决于原始源数据集的大小。如果数据很多可能就不需要太多的测试数据集。\n第6步：参数调整\n完成评估之后你想看看是否能够进一步提高训练。可以通过调整一部分参数，我们隐含假设有一些参数在训练时已经调整了。现在可以回头看看测试这些假设，试试这些值。\n举个例子，有一个参数我们可以调整，即在训练中训练数据集运行了多少次。可以多次使用这些数据，从而提高精度。\n另外一个参数是学习率，这规定了在每一步线移动的幅度。根据上一次训练步骤得到的信息，这些值都会影响模型的准确性以及训练时长。\n\n对于更复杂的模型，初始条件也会大大影响训练结果。根据模型开始训练时，初始值是为0还是其他值的分布以及分布是什么，得出的结果会有区别。\n可以看到训练的这一阶段，有很多因素值得考虑。重要的是要定义什么决定了模型的好坏。否则将花很长的时间调整参数。\n这些参数通常被称为超参数。调整超参数的过程比起科学更像是艺术。这是实验性的过程，并很大程度上取决于具体的数据集、模型和训练过程。\n一旦满意你的训练和超参数，通过评估步骤，终于可以做一些有用的事情了。\n第7步：预测\n机器学习用数据来解答问题，因此预测或推断就是解答问题的步骤，这是所有工作的重点，即实现机器学习价值的地方。\n我们终于可以用模型，根据颜色和酒精含量，预测酒水为红酒还是啤酒。\n总结\n机器学习的强大在于，我们可以用模型来测定和区分红酒与啤酒，而不是通过人的主观判断或者经验。你可以把今天所讲的概念，拓展到适用这些规则的其他领域：\n机器学习的7个步骤：\n· 收集数据\n· 准备数据\n· 选择模型\n· 训练\n· 评估\n· 超参数调整\n· 预测\nTensorFlow Playground\n如果你想了解更多关于训练和参数的信息，可以访问TensorFlow Playground。这是完全基于浏览器的机器学习沙盒，你可以尝试不同的参数，用模拟数据进行训练。不用担心 ，你不会把网站崩掉。\n下期预告\n当然在之后的视频中，我们会遇到更多的步骤和区别。但这作为帮我们理解问题很好的基本框架，用通用的语言考虑每一步，并在以后更加深入。\n在下一期的AI adventures，我们将用代码构建第一个真正的机器学习模型。\n\n人工智能赛博物理操作系统\nAI-CPS OS\n“人工智能赛博物理操作系统”（新一代技术+商业操作系统“AI-CPS OS”：云计算+大数据+物联网+区块链+人工智能）分支用来的今天，企业领导者必须了解如何将“技术”全面渗入整个公司、产品等“商业”场景中，利用AI-CPS OS形成数字化+智能化力量，实现行业的重新布局、企业的重新构建和自我的焕然新生。\nAI-CPS OS的真正价值并不来自构成技术或功能，而是要以一种传递独特竞争优势的方式将自动化+信息化、智造+产品+服务和数据+分析一体化，这种整合方式能够释放新的业务和运营模式。如果不能实现跨功能的更大规模融合，没有颠覆现状的意愿，这些将不可能实现。\n领导者无法依靠某种单一战略方法来应对多维度的数字化变革。面对新一代技术+商业操作系统AI-CPS OS颠覆性的数字化+智能化力量，领导者必须在行业、企业与个人这三个层面都保持领先地位：\n重新行业布局：你的世界观要怎样改变才算足够？你必须对行业典范进行怎样的反思？\n重新构建企业：你的企业需要做出什么样的变化？你准备如何重新定义你的公司？\n重新打造自己：你需要成为怎样的人？要重塑自己并在数字化+智能化时代保有领先地位，你必须如何去做？\nAI-CPS OS是数字化智能化创新平台，设计思路是将大数据、物联网、区块链和人工智能等无缝整合在云端，可以帮助企业将创新成果融入自身业务体系，实现各个前沿技术在云端的优势协同。AI-CPS OS形成的数字化+智能化力量与行业、企业及个人三个层面的交叉，形成了领导力模式，使数字化融入到领导者所在企业与领导方式的核心位置：\n精细：这种力量能够使人在更加真实、细致的层面观察与感知现实世界和数字化世界正在发生的一切，进而理解和更加精细地进行产品个性化控制、微观业务场景事件和结果控制。\n智能：模型随着时间（数据）的变化而变化，整个系统就具备了智能（自学习）的能力。\n高效：企业需要建立实时或者准实时的数据采集传输、模型预测和响应决策能力，这样智能就从批量性、阶段性的行为变成一个可以实时触达的行为。\n不确定性：数字化变更颠覆和改变了领导者曾经仰仗的思维方式、结构和实践经验，其结果就是形成了复合不确定性这种颠覆性力量。主要的不确定性蕴含于三个领域：技术、文化、制度。\n边界模糊：数字世界与现实世界的不断融合成CPS不仅让人们所知行业的核心产品、经济学定理和可能性都产生了变化，还模糊了不同行业间的界限。这种效应正在向生态系统、企业、客户、产品快速蔓延。\nAI-CPS OS形成的数字化+智能化力量通过三个方式激发经济增长：\n创造虚拟劳动力，承担需要适应性和敏捷性的复杂任务，即“智能自动化”，以区别于传统的自动化解决方案；\n对现有劳动力和实物资产进行有利的补充和提升，提高资本效率；\n人工智能的普及，将推动多行业的相关创新，开辟崭新的经济增长空间。\n给决策制定者和商业领袖的建议：\n超越自动化，开启新创新模式：利用具有自主学习和自我控制能力的动态机器智能，为企业创造新商机；\n迎接新一代信息技术，迎接人工智能：无缝整合人类智慧与机器智能，重新\n评估未来的知识和技能类型；\n制定道德规范：切实为人工智能生态系统制定道德准则，并在智能机器的开\n发过程中确定更加明晰的标准和最佳实践；\n重视再分配效应：对人工智能可能带来的冲击做好准备，制定战略帮助面临\n较高失业风险的人群；\n开发数字化+智能化企业所需新能力：员工团队需要积极掌握判断、沟通及想象力和创造力等人类所特有的重要能力。对于中国企业来说，创造兼具包容性和多样性的文化也非常重要。\n子曰：“君子和而不同，小人同而不和。”  《论语·子路》云计算、大数据、物联网、区块链和 人工智能，像君子一般融合，一起体现科技就是生产力。\n如果说上一次哥伦布地理大发现，拓展的是人类的物理空间。那么这一次地理大发现，拓展的就是人们的数字空间。在数学空间，建立新的商业文明，从而发现新的创富模式，为人类社会带来新的财富空间。云计算，大数据、物联网和区块链，是进入这个数字空间的船，而人工智能就是那船上的帆，哥伦布之帆！\n新一代技术+商业的人工智能赛博物理操作系统AI-CPS OS作为新一轮产业变革的核心驱动力，将进一步释放历次科技革命和产业变革积蓄的巨大能量，并创造新的强大引擎。重构生产、分配、交换、消费等经济活动各环节，形成从宏观到微观各领域的智能化新需求，催生新技术、新产品、新产业、新业态、新模式。引发经济结构重大变革，深刻改变人类生产生活方式和思维模式，实现社会生产力的整体跃升。\n\n产业智能官  AI-CPS\n用“人工智能赛博物理操作系统”（新一代技术+商业操作系统“AI-CPS OS”：云计算+大数据+物联网+区块链+人工智能），在场景中构建状态感知-实时分析-自主决策-精准执行-学习提升的认知计算和机器智能；实现产业转型升级、DT驱动业务、价值创新创造的产业互联生态链。\n\n\n长按上方二维码关注微信公众号： AI-CPS，更多信息回复：\n新技术：“云计算”、“大数据”、“物联网”、“区块链”、“人工智能”；新产业：“智能制造”、“智能农业”、“智能金融”、“智能零售”、“智能城市”、“智能驾驶”；新模式：“财富空间”、“数据科学家”、“赛博物理”、“供应链金融”。\n官方网站：AI-CPS.NET\n\n本文系“产业智能官”（公众号ID：AI-CPS）收集整理，转载请注明出处！\n版权声明：由产业智能官（公众号ID：AI-CPS）推荐的文章，除非确实无法确认，我们都会注明作者和来源。部分文章推送时未能与原作者取得联系。若涉及版权问题，烦请原作者联系我们，与您共同协商解决。联系、投稿邮箱：erp_vip@hotmail.com"}
