{"content2":"新智元编译\n来源：aiindex.org\n编译：编辑部\n【新智元导读】“AI Index”（AI指数）近日重磅发布，这是斯坦福大学AI百年研究（AI 100）的一个项目，旨在追踪人工智能的活动和进展。该报告列出了2017年人工智能在计算机视觉、自然语言理解等方向上的最新进展，分学术、产业多个角度盘点人工智能进度。报告还综合学术论文数量、招生数量和VC投资数量，得出AI发展活力指数，数据显示，最新一波AI浪潮在2015年活力最高，自那以后其实活力开始有小幅减弱。\n报告全文：https://aiindex.org/2017-report.pdf\n如果缺乏AI技术的相关数据，我们在有关AI的讨论和决策中，基本上是“盲目的”。\n在与人工智能相关的讨论和决策中，我们本质上是“盲目的”。\n“AI Index”（AI指数）是斯坦福大学AI百年研究的一个项目，它是一个开放的非营利性项目，旨在追踪人工智能的活动和进展。它的目的是促进以数据为基础的对AI的了解。本报告是AI Index的第一份年度报告，在这份报告中，我们通过多个视角来观察AI的活动和进展。我们汇总了网络上的数据，也贡献了原始数据，并从数据序列的组合中提取新的度量标准。\n本报告的数据都将在AI Index网站（aiindex.org）上公开。但是，提供数据只是一个开始。为了真正实现作用，AI指数需要来自更大的社区的支持。最后，这份报告呼吁更多人的参与。你有能力提供数据、分析收集的数据，并列出你希望跟踪的数据。无论你是否有答案或问题，我们都希望这份报告能让你了解AI指数，并成为有关AI的话题的一部分。\n报告总览\n报告的前半部分展示了AI Index团队收集的数据。后半部分，我们讨论了报告中没有提到的一些关键领域、专家对报告中显示的趋势的评论，最后呼吁采取行动支持我们的数据收集工作，并加入关于AI技术的度量和交流进展的讨论。\n数据部分\n本报告中的数据包括4个主要部分：\n活动量\n技术表现\n衍生测量\n人类水平表现?\n活动量（Volume of Activity）部分有关这个领域的“多少”（how much）的方面，例如参加AI会议的人数、VC对开发AI系统的初创公司的投资等。技术表现的部分有关“how good”，例如计算机在理解图像和证明数学定理方面已经做到什么程度。在报告附录中详细描述了每个数据集的收集方法。\n这两组数据证实了实际上是公认的一个事实，即：所有的图表都是“向上和向右的”，反映了AI的活动是不断增加，AI技术是不断进步的趋势。在衍生测量（Derivative Measures）部分，我们调查了趋势之间的关系。我们还引入了一个探索性的测量方法——AI活力指数（AI Vibrancy Index），结合了学术界和工业界的趋势，量化了AI作为一个领域的活力。\n在衡量AI系统的表现时，很自然地会将其与人类的表现进行比较。在“人类水平表现”面这一节中，我们列出了一些值得注意的领域，其中AI系统在达到甚至超越人类水平方面取得了重大进展。我们还讨论了进行这种比较时存在的困难，并提出了适当的警告。\n讨论部分\n在报告了团队收集的数据之后，我们将对报告中所强调的趋势进行一些讨论，并对该报告的重要领域进行全面的讨论。\n部分讨论集中在报告的局限性上。这份报告的数据源倾向于以美国为中心，并且可能只通过跟踪了定义良好的基准，因此可能高估了技术领域的进展。它还缺乏数据的人口统计数据，也不包含政府和企业对AI研发投资的信息。这些领域是非常重要的，我们打算在未来的报告中解决这些问题。\n我们将进一步讨论这些局限，以及其他一些在报告中缺失的部分。正如该报告的局限性所显示的， AI Index 只是描绘了局部图景。出于这个原因，这份报告也加入了各个领域的AI专家的主观评论。专家评论部分补充了对数据背后的故事的生动解释。\n最后，我们将需要更多来自社区的反馈和参与来解决报告中显示的局限，揭示我们遗漏的问题，并建立一个追踪AI活动和进展的有效程序。\n人工智能和机器学习全景式概览：学术、产业、人才流动、开源生态，各方各面活动量大增\n这份报告做了大量调查和统计，从学术（论文发表、会议参加、学生课程选修）、产业（创业、投资）、人才（招聘、职位空缺）、开源生态（Github AI和ML软件包）、媒体报道等方面，比较全面地展现了AI和ML的图景。\n1、学术\n首先，论文发表数量激增：自从1996年以来，每年发表的AI论文数量增加了9倍以上。\n再看不同类别的学术论文的年度发表率与1996年的发表率相比较。下图显示了所有领域的论文、计算机科学领域的论文和计算机科学领域的AI论文的增长。数据表明，人工智能发表论文数量增多，不仅受计算机科学领域升温所致。具体而言，自1996年以来，计算机科学一般领域的论文数量增长了6倍，同期，每年的人工智能论文数量增长了9倍以上。\n斯坦福大学入学选修人工智能和机器学习入门课程的学生人数，自从1996年以来增长了11倍以上。报告指出，由于其他大学的数据掌握有限，因此突出了斯坦福的数据。但是，有理由认为，其他大学的情况应该类似。同时，报告表示这只代表了高等教育图景的一个具体细节，不一定代表更广的趋势。\n\n会议出席情况。业内人士都知道，在计算机科学领域，各种学术会议十分重要。这些出席人数表明，研究重点已经从符号推理转向了机器学习和深度学习。\n\n再来看小一些的会议的情况。尽管研究重点有所转换，但是在小一些的研究社区，仍然在符号推理方面稳步进展。\n2、产业\n现在将目光转向产业界。下图展示了在美国，有资本支持的AI创业公司数量，从2000年以来增加了14倍：\n在美国投资AI创业的基金数量也在增长，从2000年以来，每年投入AI创业的资本额增加了6倍：\n根据两个在线求职平台Indeed和Monster的数据，人工智能相关岗位需求也在增长。下图展示了Indeed.com平台上，从2013年1月份起，对AI技术相关工作岗位的份额的增长。\n\n而在美国，需要AI技术的工作岗位，在职业市场所占份额，从2013年到现在，有了4.5倍的增长。\n按国家看，加拿大和英国的AI人才招聘市场规模也增长迅速。不过，Indeed.com报告指出，两者的绝对值仍然是美国AI招聘市场的5％和27％。\nMonster平台上，按具体要求的技能细分，给定年份人工智能职位空缺的总数量：\n\n再来看自动化应用的情况，下图展示了北美和全球工业机器人的购买以及购买增幅。工业机器人的使用正在增加。\n3、开源生态\n最后看开源软件使用和生态。下图展示了TensorFlow和Scikit-Learn软件包在GitHub上加星标的次数。\n\n这张图展示了Github上其他AI和ML软件包的星标情况。\n\n4、公众认知 / 媒体报道\n包含术语“人工智能”的主流媒体文章占所有报道的比例，按照正面情绪（蓝线）、负面情绪（紫线）分类：\n\n技术表现\n\n1. 视觉\n物体识别\n大规模视觉识别挑战赛（LSVRC）比赛中AI系统对物体检测任务的性能\n\n图像标签的错误率从2010年的28.5%下降到了2.5%。\n视觉问答\n人工智能系统在完成回答有关图像的开放式问题任务上的表现。截止2017年8月，最好的AI系统准确率还不到70%，而人类水平在85%左右。\n2. 自然语言理解\n词语解析\n人工智能系统在确定句子句法结构上的表现。\n\n人工智能系统在翻译英文和德文的任务上的表现。\n人工智能系统在从文档中找到既定问题答案任务的表现，已经越来越接近人类。\n语音识别\n人工智能系统识别语音录音的表现，2016已经达到人类水平。\n\n定理证明\n自动定理证明指的是一大组定理证明问题的平均易处理性。 “可追踪性”用来测量可以解决问题中最先进的自动定理证明器的一部分。\nSAT Solving\n具有竞争力的SAT解决者在行业应用问题上的平均表现。\n\n另一种衡量方法：AI活力指数\n通过检查各种趋势之间的关系，我们可以从前面部分衡量的标准中获得额外的洞见。下面这一部分的内容展示了AI指数所搜集到的数据如何被用于进一步分析和推动对AI发展和整个原始标准的再定义。\n正如一个案例研究所展示的那样，我们通过研究学术和产业界的趋势，来探索他们的动能。进一步地，我们将这些标准综合起来，形成一个AI 活力指数。\nAcademia-Industry Dynamics\n为了探索学术和产业界AI相关活动的关系，我们首先从前面部分的内容中选择了一些有代表性的衡量指标。值得一提的是，我们调查了AI论文的发表情况，结合斯坦福大学入门级 AI 和ML课程的报名情况、VC对AI相关初创企业的投资。这些衡量标准数据是不能直接被拿来比较的：论文发表情况、学生报名情况、投资数额。为了分析这些趋势之间的关系，我们将历史追溯到2000年，这能让我们衡量标准是如何随着时间发生变化的。\n数据显示，最初，学术活动（论文发表和招生）驱动稳步前进。 2010年前后，投资者开始注意到这一趋势，这成为2013年投资者总体活动急剧增加的驱动因素。再后来，学术界逐渐赶上了工业的繁荣。\nAI活力指数\nAI活力指数（AI Vibrancy Index）汇集了对学术和产业的衡量标准（研究成果的发表、招生和VC投资）以对AI领域进行量化。为了计算AI活力指数，我们不断地对研究成果发表数量、招生、投资的标准取平均数。\n\n达到人类水平表现的AI，里程碑\n\n很自然地，我们会在同一个任务上将AI系统和人类的表现进行比较。显然，在某些任务中，计算机比人类要优秀得多，例如，1970年代的小计算器就可以比人类更好地完成算术运算。但是，AI系统在处理诸如回答问题、玩游戏和进行医学诊断等更通用的任务时更加困难。\nAI系统的任务往往是在非常窄的背景下进行的，这样能在特定的问题或应用上取得进展。 虽然机器在特定的任务上可能表现出卓越的性能，但是如果任务稍微有所改动，系统性能可能会大大降低。 例如，一个能读懂汉字的人能够理解中国人的言论，了解中国文化，或者在中国餐馆无障碍点餐。相比之下，这些任务中的每一项都需要不同的AI系统来完成。\n尽管将人类和AI系统进行比较不是件容易的事情，但列举那些声称计算机已达到或超过人类表现的那些成就很有意思。不过，需要说明的是，这些成就没有说明这些系统具有推广能力。我们还注意到下面的列表包含许多游戏上的成就。游戏是一个相对简单，可控的实验环境，因此经常用于AI研究。\n里程碑\n黑白棋\n在20世纪80年代，李开复和Sanjoy Mahajan开发了一个人工智能系统BILL，这是一个玩“黑白棋”（Othello）游戏的贝叶斯学习系统。1989年这个系统拿了全美冠军，并以56-8击败了排名最高的美国玩家Brian Rose。在1997年，一个名为Logistello的黑白棋程序以6-0占战胜当时的冠军棋手。\n跳棋\n1952年，Arthur Samuel 设计了一系列玩西洋跳棋的程序，并通过自我对弈进行改进。但是，直到1995年，才出现一个击败人类世界冠军的跳棋程序Chinook。\n国际象棋\n上世纪50年代的一些计算机科学家预测，到1967年，计算机将击败人类象棋冠军。但直到1997年，IBM的“深蓝”系统才击败当时的国际象棋冠军Gary Kasparov。如今，在智能手机上运行的国际象棋程序可以表现出大师级的水平。\nJeopardy!\n2011年，IBM的Watson计算机系统在流行电视节目“Jeopardy!”参与挑战，赢了前冠军Brad Rutter和Ken Jennings。\n雅达利游戏\n2015年，谷歌DeepMind的一个团队使用强化学习系统来学习如何玩49个Atari游戏。该系统在大多数游戏中都能达到人类水平的表现（例如Breakout打砖块游戏，虽然也有些仍然无法达到人类水平（例如，蒙特祖玛的复仇）。\nImageNet对象检测\n2016年，ImageNet自动标注任务的错误率从2010年的28%下降到低于3%。人类的表现大约是5%的错误率。\n围棋\n2016年3月，谷歌DeepMind团队开发的AlphaGo系统击败了围棋冠军李世乭。DeepMind后来发布了AlphaGo Master，在2017年3月击败了排名第一的柯洁。2017年10月，DeepMind发表在Nature的论文详细介绍了AlphaGo的另一个新版本——AlphaGo Zero，它以100-0击败了最初的AlphaGo系统。\n皮肤癌分类\n在2017年的一篇Nature论文文章中，Esteva等人描述了一个AI系统，该系统在包含2032种不同疾病的129450张临床图像组成的数据集上训练，研究者将AI系统的诊断结果与21位皮肤科医生的结果进行比较，他们发现AI系统在分类皮肤癌任务上达到与人类皮肤科医生相当的水平。\nSwitchboard 语音识别\n在2017年，微软和IBM都在Switchboard语音识别基准测试中实现了“人类同等水平”的语音识别词错率。\n扑克\n2017年1月，来自CMU的一个名为Libratus的AI系统在一场包含12万局游戏的双人无限注德州扑克比赛中击败了四名顶尖的人类选手。 2017年2月，来自阿尔伯塔大学的一个名为DeepStack的系统与11名专业玩家分别比赛超过3000局，胜率10/11。\n吃豆人\nMaluuba是微软收购的一个深度学习团队，他们创建了一个AI系统，该系统学会了在Atari 2600上玩吃豆人游戏打出999900的最高分。\n报告原文：https://aiindex.org/2017-report.pdf\n人工智能赛博物理操作系统\nAI-CPS OS\n“人工智能赛博物理操作系统”（新一代技术+商业操作系统“AI-CPS OS”：云计算+大数据+物联网+区块链+人工智能）分支用来的今天，企业领导者必须了解如何将“技术”全面渗入整个公司、产品等“商业”场景中，利用AI-CPS OS形成数字化+智能化力量，实现行业的重新布局、企业的重新构建和自我的焕然新生。\nAI-CPS OS的真正价值并不来自构成技术或功能，而是要以一种传递独特竞争优势的方式将自动化+信息化、智造+产品+服务和数据+分析一体化，这种整合方式能够释放新的业务和运营模式。如果不能实现跨功能的更大规模融合，没有颠覆现状的意愿，这些将不可能实现。\n领导者无法依靠某种单一战略方法来应对多维度的数字化变革。面对新一代技术+商业操作系统AI-CPS OS颠覆性的数字化+智能化力量，领导者必须在行业、企业与个人这三个层面都保持领先地位：\n重新行业布局：你的世界观要怎样改变才算足够？你必须对行业典范进行怎样的反思？\n重新构建企业：你的企业需要做出什么样的变化？你准备如何重新定义你的公司？\n重新打造自己：你需要成为怎样的人？要重塑自己并在数字化+智能化时代保有领先地位，你必须如何去做？\nAI-CPS OS是数字化智能化创新平台，设计思路是将大数据、物联网、区块链和人工智能等无缝整合在云端，可以帮助企业将创新成果融入自身业务体系，实现各个前沿技术在云端的优势协同。AI-CPS OS形成的数字化+智能化力量与行业、企业及个人三个层面的交叉，形成了领导力模式，使数字化融入到领导者所在企业与领导方式的核心位置：\n精细：这种力量能够使人在更加真实、细致的层面观察与感知现实世界和数字化世界正在发生的一切，进而理解和更加精细地进行产品个性化控制、微观业务场景事件和结果控制。\n智能：模型随着时间（数据）的变化而变化，整个系统就具备了智能（自学习）的能力。\n高效：企业需要建立实时或者准实时的数据采集传输、模型预测和响应决策能力，这样智能就从批量性、阶段性的行为变成一个可以实时触达的行为。\n不确定性：数字化变更颠覆和改变了领导者曾经仰仗的思维方式、结构和实践经验，其结果就是形成了复合不确定性这种颠覆性力量。主要的不确定性蕴含于三个领域：技术、文化、制度。\n边界模糊：数字世界与现实世界的不断融合成CPS不仅让人们所知行业的核心产品、经济学定理和可能性都产生了变化，还模糊了不同行业间的界限。这种效应正在向生态系统、企业、客户、产品快速蔓延。\nAI-CPS OS形成的数字化+智能化力量通过三个方式激发经济增长：\n创造虚拟劳动力，承担需要适应性和敏捷性的复杂任务，即“智能自动化”，以区别于传统的自动化解决方案；\n对现有劳动力和实物资产进行有利的补充和提升，提高资本效率；\n人工智能的普及，将推动多行业的相关创新，开辟崭新的经济增长空间。\n给决策制定者和商业领袖的建议：\n超越自动化，开启新创新模式：利用具有自主学习和自我控制能力的动态机器智能，为企业创造新商机；\n迎接新一代信息技术，迎接人工智能：无缝整合人类智慧与机器智能，重新\n评估未来的知识和技能类型；\n制定道德规范：切实为人工智能生态系统制定道德准则，并在智能机器的开\n发过程中确定更加明晰的标准和最佳实践；\n重视再分配效应：对人工智能可能带来的冲击做好准备，制定战略帮助面临\n较高失业风险的人群；\n开发数字化+智能化企业所需新能力：员工团队需要积极掌握判断、沟通及想象力和创造力等人类所特有的重要能力。对于中国企业来说，创造兼具包容性和多样性的文化也非常重要。\n子曰：“君子和而不同，小人同而不和。”  《论语·子路》云计算、大数据、物联网、区块链和 人工智能，像君子一般融合，一起体现科技就是生产力。\n如果说上一次哥伦布地理大发现，拓展的是人类的物理空间。那么这一次地理大发现，拓展的就是人们的数字空间。在数学空间，建立新的商业文明，从而发现新的创富模式，为人类社会带来新的财富空间。云计算，大数据、物联网和区块链，是进入这个数字空间的船，而人工智能就是那船上的帆，哥伦布之帆！\n新一代技术+商业的人工智能赛博物理操作系统AI-CPS OS作为新一轮产业变革的核心驱动力，将进一步释放历次科技革命和产业变革积蓄的巨大能量，并创造新的强大引擎。重构生产、分配、交换、消费等经济活动各环节，形成从宏观到微观各领域的智能化新需求，催生新技术、新产品、新产业、新业态、新模式。引发经济结构重大变革，深刻改变人类生产生活方式和思维模式，实现社会生产力的整体跃升。\n\n产业智能官  AI-CPS\n用“人工智能赛博物理操作系统”（新一代技术+商业操作系统“AI-CPS OS”：云计算+大数据+物联网+区块链+人工智能），在场景中构建状态感知-实时分析-自主决策-精准执行-学习提升的认知计算和机器智能；实现产业转型升级、DT驱动业务、价值创新创造的产业互联生态链。\n\n\n长按上方二维码关注微信公众号： AI-CPS，更多信息回复：\n新技术：“云计算”、“大数据”、“物联网”、“区块链”、“人工智能”；新产业：“智能制造”、“智能农业”、“智能金融”、“智能零售”、“智能城市”、“智能驾驶”；新模式：“财富空间”、“特色小镇”、“赛博物理”、“供应链金融”。\n点击“阅读原文”，访问AI-CPS OS官网\n\n本文系“产业智能官”（公众号ID：AI-CPS）收集整理，转载请注明出处！\n版权声明：由产业智能官（公众号ID：AI-CPS）推荐的文章，除非确实无法确认，我们都会注明作者和来源。部分文章推送时未能与原作者取得联系。若涉及版权问题，烦请原作者联系我们，与您共同协商解决。联系、投稿邮箱：erp_vip@hotmail.com"}
