{"content2":"摘要： 阿里巴巴在美国西雅图挖来了亚马逊级别最高的华人科学家任小枫，进入该公司人工智能研发核心团队。随着人工智能逐渐成为BAT（百度、阿里巴巴、腾讯）未来的核心战略，中国科技公司在西雅图对亚马逊和微软的“抢人大战”愈演愈烈。阿里巴巴在美国西雅图挖来了亚马逊级别最高的华人科学家任小枫，进入该公司人工智能研发核心团队。随着人工智能逐渐成为BAT（百度、阿里巴巴、腾讯）未来的核心战略，中国科技公司在西雅图对亚马逊和微软的“抢人大战”愈演愈烈。6月25日，澎湃新闻记者发现，亚马逊前资深主任科学家（Senior Principal Scientist）任小枫已经更新了他在华盛顿大学官网上的个人主页，其最新任职为：阿里巴巴iDST首席科学家和副院长。阿里巴巴方面和任小枫本人均向澎湃新闻证实了这一消息。iDST（Institute of Data Science and Technologies，数据科学和技术研究院）是阿里巴巴负责人工智能技术研发的核心团队，成立于2014年，由一批杰出的科学家及工程师组成，分布在杭州、北京、西雅图、硅谷等地。随着阿里巴巴3月启动“NASA”计划，iDST正式成为NASA计划的人工智能大脑。NASA计划要面向未来20年组建强大的独立研发部门，建立新的机制体制，为服务20亿人的新经济体储备核心科技。任小枫曾领导Amazon Go无人零售店计算机视觉算法团队。 东方IC 资料值得注意的是，任小枫个人主页显示，他从2003年开始任职于亚马逊无人零售店Amazon Go部门，领导计算机视觉算法团队。Amazon Go是亚马逊最具革命性的创新项目之一，颠覆传统便利店、超市的运营模式，顾客通过App扫码进店后，在店内随意拿商品，在离店后亚马逊自动扣款，支付时 也不用打开手机，彻底跳过传统收银结帐的过程。这种即拿即走的购物体验，正是使用计算机视觉、深度学习以及传感器融合等技术。在阿里巴巴给澎湃新闻的回复中，阿里iDST团队盛赞任小枫“在计算机视觉领域中对图像分类，物体识别、跟踪、检测，事件检测均有全面且深入的理解，这在图像领域的专家中非常难得。”阿里巴巴相关人士告诉澎湃新闻，任小枫将与另一位副院长华先胜一起，在阿里巴巴不同业务的丰富场景下，提供计算机视觉服务，沉淀计算机视觉平台能力。任小枫在主页上表示，iDST在西雅图有一支快速扩充的队伍，“正在组建一支世界级的机器视觉团队”。任小枫说，自己继续留在“阳光明媚”的西雅图，自己喜爱这座城市。其个人主页显示，任小枫是中国国籍、美国永久居民。任小枫在接受澎湃新闻邮件采访时表示，因为家庭原因，还没有考虑回国。国际化是阿里一个重要的发展策略，他希望在美国能帮助阿里招揽国际一流的人才，帮助阿里走向世界。眼下，BAT正在西雅图展开如火如荼的“抢人大战”。西雅图是亚马逊、微软等公司的总部所在地。这些国外科技在人工智能方面有前瞻性的布局。任 小枫向澎湃新闻坦言，除了阿里之外，有几家中国大型的科技公司向他抛过橄榄枝，也有人找他创业。之所以最终选择阿里，任小枫表示，“在计算机视觉等人工智 能技术高速发展的今天，能看到一个足够聪明的电脑将会改变人们的生活。但是这聪明用在什么地方，怎么用，需要有具体的应用场景的支持和指导。阿里有非常多 的应用场景，也对人工智能技术非常的重视，在iDST投入很多力量来发展这些技术以及应用。我相信我加入阿里和iDST能有足够的支持和空间把计算机视觉 技术真正做好用好，能让我们的生活质量上一个台阶。”除此之外，杭州是任小枫的家乡，他说自己对阿里也有特殊的感情。任小枫主页显示，他拥有浙江大学计算机本科、斯坦福大学硕士及加州大学伯克利分校博士学位，目前还担任华盛顿大学计算机科学与工程系客座教授，相关论文被引用9000次以上。他还曾担任过CVPR、ICCV（顶级计算机会议）的领域主席。现年42岁的任小枫是亚马逊最年轻的资深主任科学家之一。据了解，亚马逊资深主任科学家（Senior Principal Scientist）是该公司高级别技术职称之一，仅次于最高级别的Distinguished Scientist，通常是领域研究团队的负责人。近年来，阿里巴巴正加快招徕技术人才的步伐。在任小枫之前，IEEE院士华先胜、前微软研发合伙人周靖人等都先后加入阿里，将阿里作为技术开疆拓土的新根据地。澎湃新闻了解到，过去一年间，在阿里巴巴整个集团技术线新员工中，来自海外知名互联网公司的技术人才占总数近30%。而最近诞生的“NASA”计划，更是驱使阿里在美国硅谷等地招募AI科学家。据了解，为了储备到全球最顶尖的科研人才，内部计划不设预算。iDST以机器学习和深度学习技术为依托，打造涵盖图像视频、语音交互、自然语言理解、智能决策等的人工智能核心技术，充分赋能电商、金融、物流、社交、娱乐等阿里巴巴集团重要业务。人工智能全覆盖的技术服务能力，通过阿里云向各行业输出，跟企业合力打造智能未来。目前iDST院长由金榕担任，为美国密歇根州立大学终身教授，曾担任NIPS、SIGIR等顶级国际会议领域主席，及KDD、AAAI、IJCAI等顶级会议高级程序委员会委员，还曾获得过美国国家科学基金会NSF Career Award。iDST院长金榕（中间）、副院长任小枫（左一）、副院长华先胜（右一）。【对话任小枫】澎湃新闻：听说中国很多科技公司都在西雅图“抢人”，你是否和其他公司接触过，为什么最终选择加入阿里巴巴iDST?任小枫：除 了阿里之外，我和其他几家中国大科技公司有过联系，也有人找我创业，不过我都没有深入的接触。之所以选择阿里，因为我觉得阿里是中国布局最广也是发展最好 的公司，富有活力重视创新，它提供的各类服务融入到了人们生活的方方面面。在计算机视觉和其他人工智能技术高速发展的今天，我们能看到一个足够聪明的电脑 将会改变人们的生活，让生活变得更加方便，也更加有意思。但是这聪明用在什么地方，怎么用，需要有具体的应用场景的支持和指导。阿里有非常多的应用场景， 也对人工智能技术非常的重视，在iDST投入很多力量来发展这些技术以及应用。我相信我加入阿里和iDST能有足够的支持和空间把计算机视觉技术真正做好 用好，能让我们的生活质量上一个台阶。杭州是我的家乡，我对阿里也有特殊的感情。澎湃新闻：iDST西雅图的工作内容是什么？任小枫：iDST现在在西雅图发展得很快。美国有很多第一流的人才，西雅图也是一个正快速发展的技术城市。我们希望在西雅图建立和发展起来一个国际一流的团队，开发出国际顶尖的和超越顶尖的技术，和国内的团队紧密合作来推动阿里集团各个方面的人工智能的发展和应用。澎湃新闻：对在iDST的工作有什么样的期待？任小枫：我希望能很快进入角色，理解阿里的业务，客户需求，了解现有的技术和团队，和大家一起做出国际领先的产品。我也希望很快融入阿里大家庭，和各个团队各位同学在一起愉快的工作。澎湃新闻：是否考虑过回国工作?任小枫：选择了阿里，我很高兴有了机会为中国人做事，为中国做贡献。因为家庭原因，我还没有考虑回国。国际化是阿里一个重要的发展策略，我也希望在美国能帮助阿里招揽国际一流的人才，帮助阿里走向世界。澎湃新闻：鉴于你之前在Amazon Go的经历，会不会为阿里新零售贡献一些创新想法？任小枫：目前工作还在熟悉之中，会积极地在所擅长的计算机视觉领域发挥技术能力。澎湃新闻：平常有什么样的兴趣爱好？任小枫：古人说，读万卷书，行万里路。我热爱知识也热爱生活，平时喜欢读各种书，也看电影，也喜欢出去旅游，顺便拍点照片记录下生活。澎湃新闻：有哪些人工智能相关的书或者视频可以推荐给大家？任小枫：书：《Vision Science: Photons to Phenomenology》，作者：Steven Palmer。这本书系统的论述了心理学对于人的视觉的研究和理解。视觉是个非常复杂的现象，涉及到很多方面，也花了很长时间才在自然界进化出来。里面很多东西不见得一下子能用上，但是在我们研究算法和提高精度的时候，经常想想人的视觉是怎么解决问题的，会有很多启发。在 不远的将来，智能系统可以识别和理解很多东西：各种生活的场景，场景里的各种物体，人的动作，甚至是人的意图和情绪。这个视屏很有意思，展示了未来的一种 可能。很多人不见得喜欢这样的增强现实，这没关系：有了高精度的智能，我们一定能找到最适合的人机交互的方式，来让我们的生活变得更方便。澎湃新闻：你觉得未来的人工智能会对世界产生什么样的影响？很多科幻电影或电视剧描述过未来世界，你个人推崇哪部？任小枫：很多人受媒体和知识界的影响，一直对人工智能有偏见，觉得人工智能就是要造出像人一样的机器人来，跟人竞争。美剧《西部世界》就是一个典型的例子。其实很多研究人工智能的人都会觉得那并不是我们的目标。我们的目标是能够让机器变得足够聪明能干，成为更好的工具来帮 助人，帮人把工作做的更好，让人的生活变的更好，就像手机和汽车。我觉得人工智能一定会影响到世界的各个方面：无论我们做什么事情，如果有了聪明的工具的 帮助，我们的效率会更高，体验会更好。原文链接"}
