{"content2":"编辑： 枣泥布丁 分类：AI 来源：开源中国\n如果你在科技领域，你经常会听到人工智能，机器学习，甚至是深度学习。怎样才可以在正确的时间正确的使用这些词？他们都是一样的意思吗？然而更多时候，人们总是混淆的使用它们。\n人工智能，机器学习和深度学习都是属于一个领域的一个子集。但是人工智能是机器学习的首要范畴。机器学习是深度学习的首要范畴。\n深度学习是机器学习的一个子集，机器学习是人工智能的一个子集\n这个领域的兴起应该归功于深度学习。人工智能和机器学习这个领域近年来一直在解决一系列有趣的问题，比如从自动化的杂货店购买到自动驾驶汽车。\n人工智能：\n人工智能的定义可以分为两部分，即“人工”和“智能”。“人工”比较好理解，争议性也不大。有时我们会要考虑什么是人力所能及制造的，或者人自身的智能程度有没有高到可以创造人工智能的地步，等等。但总的来说，“人工系统”就是通常意义下的人工系统。\n尼尔逊教授对人工智能下了这样一个定义：“人工智能是关于知识的学科――怎样表示知识以及怎样获得知识并使用知识的科学。”而另一个美国麻省理工学院的温斯顿教授认为：“人工智能就是研究如何使计算机去做过去只有人才能做的智能工作。”这些说法反映了人工智能学科的基本思想和基本内容。即人工智能是研究人类智能活动的规律，构造具有一定智能的人工系统，研究如何让计算机去完成以往需要人的智力才能胜任的工作，也就是研究如何应用计算机的软硬件来模拟人类某些智能行为的基本理论、方法和技术。\n人工智能是研究使计算机来模拟人的某些思维过程和智能行为（如学习、推理、思考、规划等）的学科，主要包括计算机实现智能的原理、制造类似于人脑智能的计算机，使计算机能实现更高层次的应用。人工智能将涉及到计算机科学、心理学、哲学和语言学等学科。可以说几乎是自然科学和社会科学的所有学科，其范围已远远超出了计算机科学的范畴，人工智能与思维科学的关系是实践和理论的关系，人工智能是处于思维科学的技术应用层次，是它的一个应用分支。从思维观点看，人工智能不仅限于逻辑思维，要考虑形象思维、灵感思维才能促进人工智能的突破性的发展，数学常被认为是多种学科的基础科学，数学也进入语言、思维领域，人工智能学科也必须借用数学工具，数学不仅在标准逻辑、模糊数学等范围发挥作用，数学进入人工智能学科，它们将互相促进而更快地发展。\nAI目标：\n为了进一步解释人工智能的目标，研究人员将其扩展到这六个主要目标。\n逻辑推理。使计算机能够完成人类能够完成的复杂心理任务。例如下棋和解代数问题。\n知识表达。使计算机能够描述对象，人员和语言。例如能使用面向对象的编程语言 Smalltalk。\n规划和导航。使计算机从A点到B点。例如，第一台自动驾驶机器人建于20世纪60年代初。\n自然语言处理。使计算机能够理解和处理语言。例如把英语翻译成俄语，或者把俄语翻译成英语。\n感知。让电脑通过视觉，听觉，触觉和嗅觉与世界交流。\n紧急智能。也就是说，智能没有被明确地编程，而是从其他AI特征中明确体现。这个设想的目的是让机器展示情商，道德推理等等。\nAI领域\n即使有了这些主要目标，这也没有对具体的人工智能算法和技术进行分类。这些是人工智能中的六大主要算法和技术：\n机器学习是人工智能领域，使计算机不用明确编程就能学习。\n搜索和优化算法，如梯度下降迭代搜索局部最大值或最小值。\n约束满足是找到一组约束的解决方案的过程，这些约束施加变量必须满足的条件。\n逻辑推理。人工智能中逻辑推理的例子是模拟人类专家决策能力的专家计算机系统。\n概率推理是将概率论的能力去处理不确定性和演绎逻辑的能力来利用形式论证的结构结合起来。其结果是一个更丰富和更具表现力的形式主义与更广泛应用领域。\n控制理论是一种正式的方法来找到具有可证性的控制器。这通常涉及描述像机器人或飞机这样的物理系统的微分方程组。\n机器学习\n机器学习是人工智能的一个子集。那么什么是机器学习呢？\n机器学习(Machine Learning, ML)是一门多领域交叉学科，涉及概率论、统计学、逼近论、凸分析、算法复杂度理论等多门学科。专门研究计算机怎样模拟或实现人类的学习行为，以获取新的知识或技能，重新组织已有的知识结构使之不断改善自身的性能。\n它是人工智能的核心，是使计算机具有智能的根本途径，其应用遍及人工智能的各个领域，它主要使用归纳、综合而不是演绎。\n机器学习如此重要的原因是什么？一个重大突破导致机器学习成为人工智能背后的动力 - 互联网的发明。互联网有大量的数字信息被生成存储和分析。机器学习算法在这些大数据方面是最有效的。\n神经网络 ⇱\n如果我们谈论机器学习时，值得一提的是机器学习算法：神经网络。\n神经网络是机器学习算法的关键部分。神经网络是教计算机以人类的方式思考和理解世界的关键。实质上，神经网络是模拟人类的大脑。这被抽象为由加权边缘（突触）连接的节点（神经元）的图形。有关神经网络的更多信息请查看神经网络概述。\n这个神经网络有一层，三个输入和一个输出。任何神经网络都可以有任何数量的层，输入或输出。\n深度学习\n机器学习算法一直是人工智能背后的推动力量。所有机器学习算法中最关键的是深度学习。\n深度学习的概念源于人工神经网络的研究。含多隐层的多层感知器就是一种深度学习结构。深度学习通过组合低层特征形成更加抽象的高层表示属性类别或特征，以发现数据的分布式特征表示。\n这个神经网络有两层，三个输入和一个输出。任何神经网络都可以有任何数量的层，输入或输出。输入神经元和最后一层输出神经元之间的层是深层神经网络的隐藏层。\n深度学习最好的表现是深度神经网络（DNN）。深层神经网络只是一个超过两层或三层的神经网络。然而，深度神经网络并不是深度学习算法的唯一类型 -但它是最流行的类型。另一个深度学习算法是深度信任网络（DBN）。深层信任网络在层与层之间不直接联系。这意味着DNN和DBN的拓扑在定义上是不同的。DBN中的无向层被称为 Restricted Boltzmann Machines。\n有关深度学习和机器学习的差别可查看一文读懂深度学习与机器学习的差异。\n结论\n所以，机器学习是人工智能的前沿，深度学习是机器学习的前沿。"}
