{"content2":"一、简单科普类\n（文末附下载链接）\n1、《人工智能：李开复谈AI如何重塑个人、商业与社会的未来图谱2》\n作者：李开复，王咏刚\n推荐理由：文章写得一般，但李开复和王永刚老师总结的还可以，算国内比较简单的一本AI科普作品\n图书简介：人工智能被写入2017年政府工作报告，智能革命时代先行者李开复，人工智能工程院副院长王咏刚携手解读：人工智能时代，个人与企业如何找到人机协作的新位置！任何企业都需要尽早引入“AI+”的思维方式！\n2、《人工智能》（精）\n作者：腾讯研究院，中国信息通信研究院互联网法律研究中心，腾讯AI，Lab，腾讯开放平台\n推荐理由：腾讯一流团队与工信部高端智库倾力创作。本书从人工智能这一颠覆性技术的前世今生说起，对人工智能产业全貌、目前进展、发展趋势进行了清晰的梳理，对各国的竞争态势做了深入研究，还对人工智能给个人、企业、社会带来的机遇与挑战进行了深入分析。对于想全面了解人工智能的读者，本书提供了重要参考，是一本必备书籍。\n图书简介：腾讯携手工信部倾力打造国家人工智能战略行动抓手！比尔·盖茨、埃隆·马斯克、扎克伯格、李彦宏、马化腾、李开复、雷军、刘庆峰等跨界大咖都在关注的科技新革命！\n3、《未来地图》\n作者：【美】吴霁虹\n推荐理由：吴霁虹教授为技术公司、传统企业、个人创业者、机构投资者，绘制了一份AI商业化的价值地图，这也是一张AI商业化的战略发展图。重点是AI+放面的科普，书写的一般，但总结的很全面。\n图书简介：创造人工智能万亿级产业的商业模式和路径\n4、《智能时代》\n作者：吴军\n推荐理由：吴军博士通过对大数据和人工智能的洞察，写出了自己对未来的畅想，书写的很好也很全面，值得一读。\n图书简介：雷军、罗振宇、李善友联袂推荐。大数据、智能革命、人工智能、机械智能领域首要作品。易读、有态度、有温度的科普作品。文津图书奖得主，中国好书榜获奖作者全新作品。\n5、《数学之美》\n作者：吴军\n推荐理由：吴军博士深入对大数据和机器学习的论述，很有意思很有质感的科普著作。\n图书简介：浪潮之巅 文明之光 硅谷之谜 大学之路 见识作者吴军博士作品 源自谷歌黑板 根植于谷歌方法论 新版增加大数据和机器学习内容 文津图书奖获奖书 央视新闻推荐的学科敲门砖\n6、《智能的本质：人工智能与机器人领域的64个大问题》\n作者：[美] 皮埃罗·斯加鲁菲 著；任莉，张建宇\n推荐理由：作者从常识出发，对人工智能和机器人表达了很多“令人惊讶”。而又让人深思的观点。并就人工智能与机器人领域的64个大问题。做出了深入的探讨，很值得一看的科普读物。\n图书简介：斯坦福、伯克利客座教授30年AI研究巅峰之作 以常识解读AI的核心算法 平息人工智能的狂热与恐慌 中国人工智能学会刘宏 赛迪研究院樊会文 清华大学iCenter韩锋 驭势科技吴甘沙等推荐\n7、《人工智能的未来》\n作者：[美] 雷·库兹韦尔（Ray Kurzweil） 著；路慧 编；盛杨燕 译\n推荐理由：美国国家技术奖获得者、奇点大学校长、谷歌公司工程师总监雷-库兹韦尔最新力作。也是库兹韦尔对于大脑和人工智能的理解，将对我们生活的方方面面、各行各业，以及我们有关未来的设想产生巨大的影响。\n图书简介：\n8、《人工智能时代》\n作者：[美] 杰瑞·卡普兰（Jerry Kaplan） 著；李盼 译\n推荐理由：经济学人2015年年度图书，卡普兰在《人工智能时代》一书中从企业、税收和保险等机制上构建了一个有益的经济生态，让社会中的每一个人都能从技术发展中获益，带领我们一窥人机共生下财富、工作与思维的大未来。\n图书简介：\n9、《机器崛起：遗失的控制论历史》\n作者：[德] 托马斯·瑞德\n推荐理由：一本读懂人工智能前世今生的书，一部气势恢宏的人工智能发展史。\n图书简介：《纽约时报》《华尔街日报》等100多家媒体联袂推荐的2016年度好书！贺福初、戴浩、孙优贤、桂卫华四位院士以及凯文·凯利等中外专家倾情推荐！一本读懂人工智能前世今生的书,一部气势恢宏的人工智能发展史！\n二、深度科普类\n1、《AI：人工智能的本质与未来》\n作者：[英] 玛格丽特·博登 著；孙诗惠\n推荐理由：人工智能界神级女性牛人的详尽之作。作者从专业的角度，深入浅出，梳理了人工智能发展的历程，其经历的不同阶段概括，如今最前沿的发展现状以及面临的困境，并探讨了其未来发展的可能性，堪称一部精彩的人工智能进化史。\n图书简介：2017年知识发布会推荐，指向未来的图书\n2、《未来简史：从智人到智神》\n作者：尤瓦尔赫拉利\n推荐理由：作者尤瓦尔赫拉利全球瞩目力作，烧脑奇书，颠覆认知，刷新你的世界观，有人吹牛逼说。错过这本书的人将错过未来。所以还是读读吧。\n图书简介：\n3、《终极算法：机器学习和人工智能如何重塑世界》\n作者：[美] 佩德罗·多明戈斯（Pedro Domingos） 著；黄芳萍 译\n推荐理由：全球好的算法问题专家、机器学习领域的先驱人物佩德罗-多明戈斯，我们揭开了算法的神秘面纱，让我们一窥谷歌、亚马逊以及你的智能手机背后的机器学习原理。\n图书简介：比尔·盖茨年度荐书！近20年人工智能领域轰动的著作！沃尔特·艾萨克森、车品觉、曹欢欢联袂推荐！\n4、《奇点临近》\n作者：[美] 库兹韦尔（Ray Kurzweil） 著；李庆诚，董振华，田源 译\n推荐理由：《奇点临近》是一本有思维方法论启示的书；十一本站在历史的高度，正面思考科技力量的书；是一本充满想象与预言，但又不失科学论证的书。可以很好的开阔我们对未来的视野。\n图书简介：一部预测人工智能和科技未来的奇书。在《奇点临近》中，库兹韦尔通过将进化划分为六大纪元，探讨和分析了科学发展趋势\n5、《心智社会》\n作者：[美] 马文明斯基\n推荐理由：人工智能之父、图灵奖得主马文-明斯基，对科学和人性的浪漫主义解读。\n图书简介：\n6、《计算机与人脑》\n作者：[美] 冯·诺伊曼\n推荐理由：这本书有点老了，曾经被誉为二十世纪的天才之作。是二十世纪杰出的数学家、经济学家、×××先驱、计算机之父冯-诺依曼的代表作之一。读这本书你就会发现，你现在的很多想法，在几十年前就被想到了，老经典，感兴趣的同学可以读读。\n图书简介：\n7、《机器之心》\n作者：[美] 雷·库兹韦尔（Ray Kurzweil） 著；胡晓姣，张温卓玛，吴纯洁 译\n推荐理由：科技预言大师雷-库兹韦尔巅峰之作，这是一个可怕的“疯子”撰写的一本疯狂的、扭曲的、不可思议的、其实妙想的，但又能极其让人信服的，也许会让你三观尽毁、脑洞大开的书，很适合大家开脑洞。\n图书简介：预言大师雷·库兹韦尔巅峰之作！\n8、《科学的极致：漫谈人工智能》\n作者：集智俱乐部著\n推荐理由：趣味又通俗易懂的一本科普书，全面介绍了人工智能的历史及其在各个领域的发展及应用。不仅涵盖了人机交互、脑科学、计算心理学、系统科学、社会科学等各个学科的基础理论，而且广泛讲述了人工智能在算法、软件、硬件等方面的应用以及跨学科应用。\n图书简介：\n9、《认知计算与人工智能》\n作者：IBM商业价值研究院\n推荐理由：这本书是IBM的一份报告，以人工智能为背景，全面细致地介绍了认知计算的概念，进而结合九个行业的实践成果，深入介绍了认知计算的实际应用，对各行业的思想者、经营者和技术领导者都非常有启发性。\n图书简介：IBM首次揭示机器学习的底层革命，打造拥有认知能力的人工智能\n三、技术类\n1、《人工智能：一种现代的方法》\n作者：[美] 罗素（Stuart J.Russell），[美] 诺维格（Peter Norvig） 著；殷建平，祝恩，刘越 等 译\n推荐理由：最权威、最经典的人工智能教材，你被全世界100多个国家的1200多所大学用作教材。英文版有1100多页，教学内容非常丰富，不但涵盖了人工智能基础、问题求解、知识推理与规划等经典内容，而且还包括不确定知识与推理、机器学习、通讯感知与行动等专门知识的介绍。\n图书简介：看AlphaGo（阿尔法狗）是如何成长的，美国伯克利大学与Google人工智能科学家合作编写，全世界100多个国家1200多所大学使用。A Must Read for AI\n2、《深度学习》\n作者：[美] Ian，Goodfellow，[加] Yoshua，Bengio，[加] Aaron\n推荐理由：由全球知名的三位专家lan Goodfellow、Yoshua Bengio和Aaron Courville撰写，是深度学习领域奠基性的经典教材，被称为深度学习的圣经。要学习人工智能，一定要读这本书。\n图书简介：AI圣经 Deep Learning中文版 长期位居美国ya马逊人工智能和机器学习类图书榜首 深度学习领域奠基性的经典畅销书 特斯拉CEO埃隆·马斯克等国内外众多专家推荐\n3、《人工智能：复杂问题求解的结构和策略》\n作者：[美] 卢格（GeorgeF.Luger）\n推荐理由：也是一本经典的人工智能教材，全面阐述了人工智能的基础理论，有效结合了求解智能问题的数据结构以及实现的算法，把人工智能的应用程序应用于实际环境中，并从社会和哲学、心理学以及神经生理学角度对人工智能进行了独特的讨论。\n图书简介：\n4、《机器学习》\n作者：周志华\n推荐理由：南京大学计算机系教授周志华老师的代表做教材，深入浅出、内容全面、结构合理、叙述清楚，总之人手一本就对了，唯一列出的中国人写的教材。\n图书简介：击败AlphaGo的武林秘籍，赢得人机大战的必由之路：人工智能大牛周志华教授巨著，全面揭开机器学习的奥秘\n5、《深入理解机器学习：从原理到算法》\n作者：[以] 沙伊·沙莱夫-施瓦茨，[加] 沙伊·本-戴维 著；张文生 等 译\n推荐理由：作者既讲述最重要的机器学习算法的工作原理和动机，还指出其固有的优势和缺点，是有兴趣了解机器学习理论和方法以及应用的学生和专业人员的良好教材和参考书。\n图书简介：近几年机器学习理论方面的优秀著作，全面清晰地讨论了机器学习理论领域重要的算法和思想。由两位改论语理论基础的关键贡献者所著，内容覆盖理论基础到算法。\n6、《数据挖掘概念与技术》\n作者：[美] Jiawei Han，[美] Micheling Kamber，[美] Jian Pei 等 著；范明，孟小峰 译\n推荐理由：是数据挖掘和知识发现领域内的所有教师、研究人员、开发人员和用户都必读的参考书，是一本适用于数据分析、数据挖掘和知识发现课程的优秀教材，可以用作高年级本科生或一年级研究生的数据挖掘导论教材。\n图书简介：数据挖掘领域里程碑意义的经典著作！中文版、影印版同步上市！决战大数据时代！IT技术人员不得不读\n7、《神经网络与机器学习》\n作者：[加] Simon Haykin 著；申富饶 等 译\n推荐理由：作者结合近年来神经网络和机器学习的最新进展，从理论和实际应用出发，全面、系统地介绍了神经网络的基本模型、方法和技术，并将网络和机器学习有机结合在一起。\n图书简介：利用逐次状态估计算法训练递归神经网络。\n8、《机器学习实战》\n作者：[美] Peter Harrington 著；李锐，×××，曲亚东 等 译\n推荐理由：通过精心编排的实例，切入日常工作任务，摒弃学术化语言，利用高效可复用的python代码阐释如何处理统计数据，进行数据分析及可视化。读者可从中学到一些核心的机器学习算法，并将其运用于某些策略性任务中，如分类、预测及推荐等。\n图书简介：人工智能开发图书 深度学习实践应用 利用Python阐述机器学习算法 配合日常用例 强劲实战导向 程序员人手常备\n9、《贝叶斯方法：概率编程与贝叶斯推断》\n作者：[加] Cameron Davidson-Pilon（卡梅隆·戴维森-皮隆） 著；辛愿，钟黎，欧阳婷 译；余凯，岳亚丁 校\n推荐理由：本书适用于机器学习、贝叶斯推断、概率编程等相关领域的从业者和爱好者，也是和普通开发人员了解贝叶斯统计而使用。\n图书简介：机器学习 人工智能 数据分析从业者的技能基础 国际杰出机器学习专家余凯博士 腾讯专家研究员岳亚丁博士推荐 下一个十年 掌握贝叶斯方法 就像今天掌握C C++ Python一样重要 全彩印刷\n10、《图像处理、分析与机器视觉》\n作者：Milan Sonka，Vaclav Hlavac，Roger Boyle\n推荐理由：计算机视觉经典教材，针对图像处理、图像分析和机器视觉领域的有关原理与技术进行了广泛而深入的讨论，包括图像预处理、图像分割、形状表示与描述、物体识别与图像原理、三维视觉、数学形态学图像处理技术、离散图像变换、图像压缩、纹理描述、运动分析等。\n图书简介：\n11、《机器视觉》\n作者：[美] 伯特霍尔德·霍恩 著；王亮，蒋欣兰 译\n推荐理由：作为作者在麻省理工学院（MIT）所讲授的机器视觉课程的指定教材，本书已经被使用了近30年，至今仍被欧美许多著名高校所广泛使用。\n图书简介：\n12、《模式识别》\n作者：[希腊] Sergios，Theodoridis（西格尔斯.西奥多里蒂斯），Konstantinos，Koutroumbas（康斯坦提诺斯.库特龙巴斯） 著；李晶皎 等 译\n推荐理由：本书在完美的和当前的理论与实践的基础上，讨论了贝叶斯分类、贝斯网络、线性和非线性分类器设计、上下文相关分类、特征生成、特征选取技术、学习理论的基本概念以及聚类概念与算法。\n图书简介：\n13、《Python自然语言处理》\n作者：[美] Steven，Bird　Ewan，Klein　Edward，Loper 著；陈涛，张旭，崔杨，刘海平 译\n推荐理由：是自然语言处理领域的一本使用入门指南，旨在帮助读者学习如何编写程序来分析书面语言。可以作为自然语言处理或计算语言学课程的教科书，还可以作为人工智能、文本挖掘、语料库语言学等书课程的补充读物。\n图书简介：\n14、《解析深度学习：语音识别实践》\n作者：俞栋，邓力 著\n推荐理由：是首部介绍云识别中深度学习技术细节的专著。全书首先概要介绍了传统语音识别理论和经典的深度神经网络核心算法。接着全面而深入地介绍了深度学习在语音识别中的应用，包括“深度神经网络-隐马尔可夫混合模型”的训练和优化，特征表示学习、模型融合、自适应，以及循环神经网络为代表的若干先进深度学习技术。\n图书简介：了解深度学习应用实践不可错过的经典专著\n15、《游戏人工智能编程案例精粹》\n作者：[美] Mat Buckland 著；罗岱 等 译\n推荐理由：是游戏人工智能方面的经典之作，畅销多年。它展示了如何在游戏中利用专业人工智能技术，并针对实际困难问题给出了强有力的解决方法。\n图书简介：游戏编程实例教程，游戏引擎设计精粹，android游戏开发宝典！\n四、机器人类\n16、《机器人手册》3卷\n作者：布鲁诺·西西利亚诺\n推荐理由：《机器人手册》由来自美国、德国、日本、意大利、加拿大等国家和地区的167位专家著写而成，凝聚了全球科学家的科技力量，绝对是机器人领域的百科全书！\n图书简介：\n17、《机器人学：建模、规划与控制》\n作者：[意] 布鲁诺·西西里安诺，[意] 洛伦索·夏维科，[意] 路易吉·维拉尼，[意] 朱塞佩·奥里奥洛 著；张国良，曾静，陈励华，敬斌 译\n推荐理由：一本教材就能将机器人的操控技术与移动技术从基础知识到前沿研究这么长跨度的内容囊括其中，并能在数学的深度和物理直觉两方面达到创造性的平衡。\n图书简介：\n18、《机器人学导论》\n作者：克来格，貟超 著\n推荐理由：曾作为美国斯坦福大学机器人学导论的教材，经过两次修订。书中还包括大量分级的习题和编程作业，适合教学参考。\n图书简介：\n19、《机器人浪潮》\n作者：[日] 神崎洋治（Kozaki Yoji） 著；黄笛 译\n推荐理由：在本书中，作者介绍了机器人产业的现状以及远景、其背后的特征、技术、商业领域的应用以及APP开发和人工智能等相关内容。拥有感情和自主学习能力的机器人与人类共生的社会景象越来越具有现实感。\n图书简介：世界首款情感识别型机器人发售 人类历史上前所未有的巨变正在急速发生\n20、《工业机器人及零部件结构设计》\n作者：李慧，马正先，逄波 著\n推荐理由：本书从工业机器人设计及应用的角度出发，通过设计案例较为全面系统的剖析了工业机器人设计与结构之间的关系。\n图书简介：工业机器人（冷、热冲压用机器人，数控机床机器人，装配机器人、模块化工业机器人）设计及案例详解\n五、哲学类\n1、《人工智能哲学》\n作者：[英] 博登，刘西瑞，王汉琦 著\n推荐理由：收集了人工智能研究领域著名学者的15篇代表性论文，这些论文为计算机科学的发展和人工智能哲学的建立做出了开创性的贡献。人工智能哲学是伴随现代信息理论和计算机技术发展起来的一个哲学分支。\n图书简介：\n2、《皇帝新脑》\n作者：[英] 彭罗斯 著；许明贤，吴忠超 译\n推荐理由：本书对电脑科学、数学、物理学、宇宙学、神经和精神科学以及哲学进行了广泛、深入浅出的讨论，体现了作者向哲学上最大问题“精神-身体关系”挑战的大无畏精神。书中充满了天才般的猜测，贯穿着探索真理的灵感和激情。\n图书简介：罗杰·彭罗斯教授担任牛津大学极为有名的罗斯·玻勒教学讲席。在探索未知的天空物理和数学领域中，他是当今领导者之一。\n彭罗斯教授与蒂芬·霍金教授曾给合作研究，黑洞及引力，而于1988年共获渥夫物理奖。“彭罗斯教授在这本曾获得科学收籍奖的《皇帝新脑》中力图解答人类的谜题：人脑是如何思想？……彭罗斯是当今最受推崇的数学家兼物理学家之一，能以精深的数理来推论宇宙间的一切事务。”\n3、《人类2.0》\n作者：[美] 皮埃罗·斯加鲁菲，牛金霞，闫景立 著\n推荐理由：皮埃罗重新定义科技带给人类的影响，并推出“人类2.0”概念，与硅谷科学家、创业者解读科技领域最关注的十个领域带给人类的影响。\n图书简介：硅谷精神布道师、人工智能认知科学家、《硅谷百年史》作者皮埃罗新作，涂子沛、暴走恭亲王、吴霁虹联袂推荐。皮埃罗详述人工智能、虚拟现实、生物技术、区块链等十种科技，带你一起探索科技未来，定义人类2.0\n4、《哥德尔、艾舍尔、巴赫》\n作者：[美] 侯世达 著；本书翻译组 译\n推荐理由：它通过对哥德尔的数理逻辑，艾舍尔的版画和巴赫的音乐三者的综合阐述，引人入胜地介绍了数理逻辑学、可计算理论、人工智能学、语言学、遗传学、音乐、绘画的理论等方面，构思精巧、含义深刻、视野广阔，富于哲学韵味。\n图书简介：\n书籍下载地址 （书籍整理自网络，只做个人学习使用，禁止用于商业用途）\n链接：https://pan.baidu.com/s/1nvrExHB 密码：zl66\n--------------------- 本文来自 扑满心 的CSDN 博客 ，全文地址请点击：https://blog.csdn.net/sinat_38648491/article/details/78905394?utm_source=copy"}
