{"content2":"摘要\n这一章将进入机器人语音交互的学习，让机器人能跟人进行语音对话交流。这是一件很酷的事情，本章将涉及到语音识别、语音合成、自然语言处理方面的知识。本章内容：\n1.语音交互相关技术\n2.机器人语音交互实现\n3.自然语言处理云计算引擎\n1.语音交互相关技术\n要机器人能完成跟人对话，涉及到语音识别、语音合成、自然语言处理等技术。简单点说，语音识别就是将人的声音转换成文字便于机器人计算与理解；语音合成就是将机器人要说的文字内容转换为声音；自然语言处理相当于机器人的大脑，负责回答提问。整个语音交互的过程，如。\n（）语音交互过程\n1.1.语音识别\n语音识别技术，也被称为自动语音识别Automatic Speech Recognition(ASR)，其目标是将人类的语音中的词汇内容转换为计算机可读的输入，例如按键、二进制编码或者字符序列，如。\n（）语音识别\n语音识别技术所涉及的领域包括：信号处理、模式识别、概率论和信息论、发声机理和听觉机理、人工智能等等。语音识别技术的最重大突破是隐马尔科夫模型Hidden Markov Model的应用。从Baum提出相关数学推理，经过Labiner等人的研究，卡内基梅隆大学的李开复最终实现了第一个基于隐马尔科夫模型的非特定人大词汇量连续语音识别系统Sphinx。此后严格来说语音识别技术并没有脱离HMM框架。当然神经网络方法是一种新的语音识别方法，人工神经网络本质上是一个自适应非线性动力学系统，模拟了人类神经活动的原理，具有自适应性、并行性、鲁棒性、容错性和学习特性，其强的分类能力和输入-输出映射能力在语音识别中都很有吸引力。但由于存在训练、识别时间太长的缺点，目前仍处于实验探索阶段。\n1.2.语音合成\n语音合成是语音识别的逆过程，也称为文字转语音（TTS），它是将计算机自己产生的、或外部输入的文字信息转变为可以听得懂的、流利的汉语或其他口语输出的技术。如。\n（）语音合成\nTTS过程包括这些步骤：语言处理，在文语转换系统中起着重要的作用，主要模拟人对自然语言的理解过程，文本规整、词的切分、语法分析和语义分析，使计算机对输入的文本能完全理解，并给出后两部分所需要的各种发音提示；韵律处理，为合成语音规划出音段特征，如音高、音长和音强等，使合成语音能正确表达语意，听起来更加自然；声学处理，根据前两部分处理结果的要求输出语音，即合成语音。\n1.3.自然语言处理\n有了语音识别和语音合成，要让机器人能智能的对答如流的和人交谈，还需要赋予机器人以灵魂。自然语言处理技术（NLP）就是来赋予聊天机器人内在灵魂的。\nNLP是计算机领域与人工智能领域中的一个重要分支。由于数据的大幅度增强、计算力的大幅度提升、深度学习实现端到端的训练，深度学习引领人工智能进入有一个高潮。人们也逐渐开始将如日中天的深度学习方法引入到NLP领域，在机器翻译、问答系统、自动摘要等方向取得成功。经过互联网的发展，很多应用积累了足够多的数据可以用于学习。当数据量增大之后，以支持向量机（SVM）、条件随机场（CRF）为代表的传统浅层模型，由于模型过浅，无法对海量数据中的高维非线性映射做建模，所以不能带来性能的提升。然而，以CNN、RNN为代表的深度模型，可以随着模型复杂度的增大而增强，更好贴近数据的本质映射关系。一方面，深度学习的word2vec的出现，使得我们可以将词表示为更加低维的向量空间。另一方面，深度学习模型非常灵活，使得之前的很多任务，可以使用端到端的方式进行训练。\n（）基于深度学习的自然语言处理过程\n为了让大家更好的理解基于深度学习的自然语言处理过程，举一个比较通用的模型，如。问题句子通过Seq2Seq循环神经网络进行预处理和编码，然后进入答案搜索，接着通过DQN强化学习网络对问答策略进程学习。这样，随着时间的推移，问答系统回答问题的水平会越来越高，就达到了不断在线学习的目的了。\n后记\n------SLAM+语音机器人DIY系列【目录】快速导览------\n第1章：Linux基础\n1.Linux简介\n2.安装Linux发行版ubuntu系统\n3.Linux命令行基础操作\n第2章：ROS入门\n1.ROS是什么\n2.ROS系统整体架构\n3.在ubuntu16.04中安装ROS kinetic\n4.如何编写ROS的第一个程序hello_world\n5.编写简单的消息发布器和订阅器\n6.编写简单的service和client\n7.理解tf的原理\n8.理解roslaunch在大型项目中的作用\n9.熟练使用rviz\n10.在实际机器人上运行ROS高级功能预览\n第3章：感知与大脑\n1.ydlidar-x4激光雷达\n2.带自校准九轴数据融合IMU惯性传感器\n3.轮式里程计与运动控制\n4.音响麦克风与摄像头\n5.机器人大脑嵌入式主板性能对比\n6.做一个能走路和对话的机器人\n第4章：差分底盘设计\n1.stm32主控硬件设计\n2.stm32主控软件设计\n3.底盘通信协议\n4.底盘ROS驱动开发\n5.底盘PID控制参数整定\n6.底盘里程计标\n第5章：树莓派3开发环境搭建\n1.安装系统ubuntu_mate_16.04\n2.安装ros-kinetic\n3.装机后一些实用软件安装和系统设置\n4.PC端与robot端ROS网络通信\n5.Android手机端与robot端ROS网络通信\n6.树莓派USB与tty串口号绑定\n7.开机自启动ROS节点\n第6章：SLAM建图与自主避障导航\n1.在机器人上使用传感器\n2.google-cartographer机器人SLAM建图\n3.ros-navigation机器人自主避障导航\n4.多目标点导航及任务调度\n5.机器人巡航与现场监控\n第7章：语音交互与自然语言处理\n1.语音交互相关技术\n2.机器人语音交互实现\n3.自然语言处理云计算引擎\n第8章：高阶拓展\n1.miiboo机器人安卓手机APP开发\n2.centos7下部署Django(nginx+uwsgi+django+python3)\n----------------文章将持续更新，敬请关注-----------------\n如果大家对博文的相关类容感兴趣，或有什么技术疑问，欢迎加入下面的《SLAM+语音机器人DIY》QQ技术交流群，一起讨论学习^_^"}
