{"content2":"机器智能公司一览图\n对于人工智能，目前有两种态度。一种是担心，Elon Musk等人担心先进的人工智能会对人类造成威胁，Nicholas Carr担心自动化会抢人饭碗、让人变蠢；一种是放心，Google主席Eric Schmidt认为先进的技术智慧让人类变得越来越好，况且现在的人工智能还非常原始。那么，现在的机器智能现状到底是怎样的呢？Bloomberg Beta 的 VC Shivon Zilis 历时 3 个月，分析了 2529 家人工智能、机器学习及数据相关的初创企业后为我们做出解读。\n什么是机器智能？\n所谓机器智能，是机器学习与人工智能的统称。计算机正在学习如何思考以及读写。也正在获得人类的感觉功能，包括视觉、听觉，以及触觉、味觉和嗅觉（对后三者的关注略少）。机器智能技术涉及多种不同的问题类型（分类、聚类、自然语言处理、计算机视觉等）和方法（支持向量机、深度信念网络等）。这些都包含在机器智能版图当中。\n机器智能离不开大数据，数据是机器学习和人工智能的基础。尽管如此，出于篇幅和专注于人工智能方法的原因，这份版图并没有把大数据放进去。\n公司分类\n从事机器智能的公司很多，但是版图幅面有限。所以机器智能方法被当作关键技术的公司才可以列入。然后入选的公司再分为三大类，一类是专注于机器智能核心技术创新的核心技术类公司；一类就是应用型公司，应用型按照应用对象又可以分为面向企业、面向行业以及面向人 / 人机交互（HCI）这三类；第三类则是支撑技术，包括硬件、数据准备、数据采集等。\n如果你打算开一家相关的公司，可以利用这张图找出合适的核心技术和支持技术，然后打包成新颖的行业应用。尽管人人都想解决一些吸引人的问题，但是在许多不那么性感的行业还存在着大量的商机值得挖掘（如通过 Watson Developer Cloud、AlchemyAPI 等），所以未必要紧紧盯住热门的领域。\n版图思考\nKevin Kelly（K.K）认为，廉价的并行计算、大型的数据集，以及更好的算法推动了机器智能的发展，从而给企业、产业和人类带来了变革。这张版图的应用划分正是受到了这种观点的启发。正如 K.K 所言，“接下来的 10000 个初创企业的商业计划很容易预测，做 X 然后增加 AI。”有时候甚至连 X 都可以不要，因为机器智能本身就有可能创造出全新的行业。\n机器智能的前景非常可观。目前这个领域的初创企业被收购率已达到有 10%，Zilis 认为到 2015 年年底可能还会有另 10% 被收购掉。买家共有 15 个，其中 Google 是机器智能领域的头号买家。\n大公司具有压倒性优势，尤其是开发有消费者产品的那些。搜索（Google、百度）、社交网络（Facebook、LinkedIn、Pinterest）、内容（Netflix、Yahoo！）、移动（苹果）及电子商务巨头（Amazon）处在非常领先的位置。因为这些公司拥有大量的数据，且可以通过不断与消费者交互，从而形成算法调整的反馈回环，再加上网络效应，所以是最容易从中收获机器智能成效的公司。\n一流的个性化和推荐算法促进了这些公司的成功。在移动的新战场上，机器智能也不可或缺：如自然语言接口（苹果 Siri）、可视化搜索（Amazon 的 FireFly）、直接提供答案而非链接的动态问题回答。而 IBM 和微软在这个领域也取得了很大进展，但是主要集中在面向大型行业数据集的知识表征任务（因为缺乏上述公司类似的面向人的需求），比方说 IBM 的 Watson 就用到了辅助医生诊断上面。\n人才垄断\n过去 20 年里，人工智能领域最好的人才都在学术界。这些人发明了许多新的机器智能方法，但是能带来商业价值的却没几个。但现在像深度信念网（deep belief nets）和阶层式神经网络（hierarchical neural network）这样复杂的机器智能方法开始解决一些现实问题了。而象牙塔上的那些学者也开始走进企业。比方说Facebook招了纽约大学的Yann LeCun教授和 Rob Fergus，Google聘了多伦多大学的 Geoffrey Hinton，而百度则有吴恩达（Andrew Ng），这些都是机器智能领域“教父”级的任务。不过这些人并不是完全跟学术脱离了关系，不少的时间和精力还是要贡献给学校的。\n高薪和好设施当然是吸引这些顶尖学术人才的因素之一，但是最重要的却是另一个东西：数据。Facebook、Google、百度等拥有庞大的计算资源，还垄断了海量的数据，必然会吸引越来越多的人才加入，这就是大公司形成压倒性优势的原因。\n和平红利\n如上所述，大公司拥有固有优势，而赢得机器智能战者未来还会更加强大。幸运的是，对于其他公司来说，大公司开发出来的核心技术会迅速涌入到其他领域—通过大公司离职人员以及公开发表的研究的方式。\n此外，跟大数据革命类似，技术巨头也会把一些突破性的技术贡献给社区，然后由其他人来做应用层面的创新。\n创业机遇\n我的公司从事 X 的深度学习\n要想让你的公司明年火，可以用上面这句话做广告词。当然，前提是你的确是。\n深度学习是机器智能的热门方法。虽然可能有点炒作过头，但 Google、Facebook、百度这样的巨头，以及 Enlitic 等很初创企业，在视觉和语言处理方面采用这种办法的确取得了不俗的成绩。\n深度学习最令人兴奋的是，如果处置得当的话，其自动学习功能可以替代部分领域专家的直觉。在很多情况下，这有望改写许多领域的解决方案。\n人才收购作为商业模式\n我们在讨论大数据的时候往往提到数据科学家的短缺。但是由于此前机器智能仅限于学术研究，机器智能专家更是短缺中的短缺。这一现状并不会很快改变。\n这种短缺对于真正理解机器智能的创始人来说却是一种福利。这一领域的许多初创企业能够获得种子轮融资，往往就因为一个原因—机器智能人才收购的价格是一半技术人才收购价格的 5 倍以上（比方说 Deep Mind 人均收购价格为 500 到 1000 万美元）。作为有悟性的创始人，你甚至可以网罗一批机器智能人才然后就成立公司，说不定就有人会收购你了—好吧，这是个玩笑，但是这的确反映出“人工”智能的价值。"}
