{"content2":"作者：Andrew_____来源：CSDN原文：https://blog.csdn.net/Maximize1/article/details/82562090文章目录1 Baidu 计算机视觉算法研发工程师2 海康威视2.1 图像算法工程师（图像处理\\视频编解码\\3D视觉）研究院2.2 AI算法工程师（计算机视觉\\机器学习\\模式识别\\人脸识别\\自然语言处理\\语音识别\\音频处理）研究院2.3 图像算法工程师-产品研发中心2.4 图像算法工程师-微影传感3 华为3.1 计算机视觉算法工程师4 商汤4.1 计算机视觉研究员4.2 见习计算机视觉研究员4.3 计算机视觉算法工程师1 Baidu 计算机视觉算法研发工程师时间：2018.09.09职位：计算机视觉算法研发工程师工作地点: 深圳市招聘人数: 5工作职责:负责百度计算机视觉相关的技术(含无人车自定位、地图重建、图像点云物体识别分类算法）、系统、产品的研发工作，包括但不限于：移动图像技术应用、图像内容搜索、人脸检测识别、图像分类标注、OCR、增强现实、图像质量评价、图像处理、点云视觉定位、三维视觉重建、物体分类识别等；招聘要求：掌握计算机视觉和图像处理基本算法，并在如下一个或多个相关方向有较深入研究：移动图像技术应用、图像内容搜索、人脸检测识别、图像分类标注、OCR、增强现实、图像质量评价、图像处理等；了解机器学习基本算法，如分类、回归、聚类、概率模型等熟悉和掌握C/C++和脚本语言编程(如Shell, Python, Perl等）具有良好的沟通能力，和良好的团队合作精神有相关实践经验者优先2 海康威视时间：2018.09.102.1 图像算法工程师（图像处理\\视频编解码\\3D视觉）研究院任职资格：有较好数学基础，较强的图像处理算法设计与开发能力；掌握c/c++、python等编程语言，能编程实现相关算法；较强的论文检索，英文专业文献阅读能力；良好的沟通与协作能力。具备以下经验之一者优先：1、 了解深度学习，在图像处理领域进行过深度学习相关研究与实现；2、 具备较丰富的图像处理、计算成像、3D视觉、视频编解码研究经历；3、 具备较丰富的雷达信号处理研究经历。2.2 AI算法工程师（计算机视觉\\机器学习\\模式识别\\人脸识别\\自然语言处理\\语音识别\\音频处理）研究院工作职责:负责模式识别、计算机视觉、深度学习、人脸识别、自然语言处理、语音识别、音频处理相关算法的研究与实现。任职资格：具有较好的数学功底，对模式识别、机器学习有较深入的理解与认识；在下述任一领域有研究经历：计算机视觉、人脸识别、语音识别、自然语言理解、麦克阵列；熟练掌握C\\C++\\Python，具备扎实的编程基础；熟练使用Caffe、Tensorflow、PyTorch及其它开源框架者优先；有实际项目开发或参加竞赛经验者优先；在CVPR、ICCV、CSVT、TMM、TIP、PAMI等国际顶级会议或期刊上发表过文章者优先；2.3 图像算法工程师-产品研发中心工作职责:负责图像处理模块的算法设计，并在相关平台上实现。任职资格：精通C语言，掌握Matlab，熟悉OpenCV 等图像工具；熟悉图像处理或模式识别相关算法处理；对红外图像的非均匀性校正、细节增强、去噪、测温等相关算法有一定了解；具有较强的文献获取能力，英文文献检索和阅读能力；有红外图像算法处理经验者优先。2.4 图像算法工程师-微影传感工作职责:负责图像处理模块的算法设计，并在相关平台上实现。任职资格：精通C语言，掌握Matlab，熟悉OpenCV 等图像工具；熟悉图像处理或模式识别相关算法处理；对红外图像的非均匀性校正、细节增强、去噪、测温等相关算法有一定了解；具有较强的文献获取能力，英文文献检索和阅读能力；有红外图像算法处理经验者优先。3 华为3.1 计算机视觉算法工程师工作职责:深度学习算法的研发，特别是在计算机视觉领域的应用研究，以及模型加速、模型加密、模型量化等研发；研究基于 deep learning 的人的属性或人的附属物体类型及其属性的识别算法；计算机视觉算法研发与产品开发，包括但不限于：人脸识别、人脸属性、人体重识别识别；目标检测、目标分类、目标属性识别；图像分割、图像解说、图形对象识别、图像生成、图片审核、图像优化、图像聚类；目标检测、识别、跟踪；视频分割、视频语义提取；OCR、文字检测；语义分割、超分辨率；任职资格：熟练掌握C/C++、Python等语言，掌握一种以上深度学习框架，掌握Opencv等基础库的使用；掌握计算机视觉基础知识、深度学习、经典机器学习等。有实践经验者优先；具备一定的科研能力，能快速理解paper，具备算法创新能力者优先；具备对现实问题抽象出数学模型的逻辑分析能力，并能够求解数学问题；remark：华为的所有岗位入职时随机分配，不宜；华为的很多岗位偏通信，不宜；2012实验室、消费者 BU (business unit) 均有有视觉岗；2012实验室从事基础研究，部门利润低、工资外收入低；消费者 BU 市场发展空间不大；（phq）4 商汤4.1 计算机视觉研究员工作职责:负责计算机视觉（包括深度学习）算法的开发与性能提升，负责下述研究课题中的一项或多项，包括但不限于：检测、跟踪、分类、语义分割、深度估计、图像处理、视频分析、3D图形与视觉、强化学习、自然语言理解、机器人技术相关算法等；推动计算机视觉&机器学习算法在众多实际应用领域的性能优化和落地；提出和实现最前沿的算法，保持算法在工业界和学术界的领先。任职资格：熟练掌握计算机视觉的基本方法；较强的算法实现能力，熟练掌握 C/C++ 编程，熟悉 Shell/Python/Matlab 编程之一;算法基础扎实，掌握常见设计模式，具有良好代码风格和质量意识，能独立完成算法模块设计、开发和测试；满足以下一个或多个条件的，优先考虑：在国际顶尖会议或期刊（包括但不限于CVPR, ICCV, ECCV, NIPS, ICML, AAAI, TPAMI, IJCV等）上发表过论文；有较强的代码能力者优先，获得过ACM或其他商业代码竞赛的荣誉，如ACM区预赛金牌、NOI银牌以上、百度之星决赛等，或代码开源在GitHub上并有较大影响；有较强的比赛经验者或者在重要数据集的排行榜上排名靠前的优先，这些比赛包括但不限于ImageNet等相关竞赛、Kaggle等一些国内外商业比赛、亚太大学生/国际空中/Robomaster机器人大赛等；有较丰富的相关经验者优先，比如有一年以上在人工智能领域公司进行计算机视觉&机器学习方面实习的经验，或来自国内外计算机视觉/机器学习/计算机图形学/数据挖掘等领域内知名实验室。4.2 见习计算机视觉研究员工作职责:负责计算机视觉相关算法的开发与性能提升，涉及的问题包括但不限于：检测、跟踪、分类、语义分割、强化学习、3D视觉和图像处理等。推动计算机视觉算法和深度学习在智能视频，安防监控，手机，自动驾驶，OCR等众多实际应用领域的性能优化和落地。提出和实现最前沿的算法，保持算法在工业界和学术界的领先。任职资格：掌握机器学习（特别是深度学习）和计算机视觉的基本方法。优秀的分析问题和解决问题的能力，对解决具有挑战性的问题充满激情。较强的算法实现能力，熟练掌握 C/C++ 编程，熟悉 Shell/Python/Matlab 编程。有较强的代码能力优先，获得过ACM或其他商业代码竞赛的荣誉，如ACM区预赛金牌、NOI银牌以上、百度之星决赛等；或代码开源在github上并有较大影响。有较强的学术比赛经验或者在重要数据集的Leaderboard上排名靠前，比如ImageNet等学术数据集或者Kaggle等一些国内外商业比赛。4.3 计算机视觉算法工程师工作职责:负责基于深度学习的视觉算法SDK等算法产品的研发、优化和维护；配合视觉计算领域的顶级研究人员，参与图像视频算法的设计研发，负责底层算法的工程化、封装、优化、测试等；参与图像视觉应用软件和相关自动化工具的开发和维护。任职资格：熟练掌握C/C++，算法基础扎实，具有良好代码风格和质量意识；具有图像/视频处理相关背景知识和开发经验；满足以下条件者优先：有深度学习相关研发经验者优先；了解GPU并行计算，熟悉CUDA编程或OpenCL编程；熟悉 X86、ARM 的多线程和SIMD代码优化技术；具有Neon或OpenCL或OpenGL等移动端性能优化经验；学习能力强，具备优秀的分析和解决问题能力，具备良好的沟通能力和团队合作意识。---------------------作者：Andrew_____来源：CSDN原文：https://blog.csdn.net/Maximize1/article/details/82562090"}
