{"content2":"什么是人工智能？\n人工智能这个词首次出现在1956年，有达特茅斯教授约翰麦卡锡提出。他召集了一些计算机专家讨论机器是否可以学习像一个小孩子一样，通过计算和推理，项目建议说他们会找出如何让机器“使用语言，抽象形式和概念，像人类一样解决各种问题和提升自己。”简单的说，就是通过对过去已知数据的统计分析，从而对将来未知数据做出评判。这里对未知数据做出评判，也称为分类或者是决策。在人工智能领域，分类，决策，预测这几个词基本上是同义词。比如：风险投资面临很多初创公司，投还是不投资，这是个决策，也是预测和判断。这个决策，也相当于把候选公司分成两类，一类是要投资的公司，一类是不投资的公司。\n严格的来讲人工智能不能算是科学，原因有两点：\n科学是严谨的，要么对，要么错，有明确肯定的答案，人工智能不是很严谨，不能给出明确肯定的答案，只能给出大致正确的答案。\n科学讲究严密的逻辑推理，前因后果之间有明确的逻辑必然性，可以自身验证对错。\n人工智能是基于统计分析的，通过归纳总结来做判断，自己做出的判断，连自己都不能验证对错，需要人来验证。\n总结：非逻辑推理，不能自身验证对错，获得近似结论是人工智能和科学最大的不同点。\n说说天生智能？\n人工智能里, \"人工\", 字面上的理解就是人造的, 与其相对的就是: \"天生\"。比如有的人的 双眼皮是天生的, 有的人的双眼皮是人工的。人类属于高智能动物,天生具有智能。理解人类天生智能的运作,对于理解人工智能的运作很有帮助。\n我们来看看人类天生智能的是如何运作的。一个三岁小孩, 喜欢吃糖。小孩哭闹的时候, 奶奶就给他糖吃。几天内,小孩每次哭闹,都吃到到了糖。这时小孩就会得到一个结论:\"哭闹就有糖吃\"。之后,想吃糖的时候,哭闹就可以了。我们仔细分析一下这个过程:一开始,小孩并不知道哭闹可以有糖吃,经过几天的实践,得出\"哭闹就有糖吃\"的结论。注意这个结论: 是基于对几天的数据统计得出来的,并不是通过\"逻辑推理\"得来的。这个结论大致正确,但不是百分百正确,是基于经验的结论。几天内哭闹就有糖吃的数据, 就是现在所说的大数据, 不要以为只有海量数据才是大数据。有一次是爸爸带这个小孩,小孩想吃糖了,就开始哭闹,结果挨了一断训斥,糖没吃成。几次下来, 这个小孩修正了之前了结论: \"在奶奶面前哭闹,就有糖吃\"。从\"哭闹就有糖吃\" 到 \"在奶奶面前哭闹,就有糖吃\",这是一个经验积累和学习的过程,正确率有了提高。其实,小孩子不会意识这个过程,这是一个自然的天生智能过程，这个过程和人工智能的运作几乎是一模一样的。人类在成长中,多数经验是通过统计而来的。\n紧迫的问题是，AI将如何影响你的工作？它会使得你的工作过时吗？就像工业革命，这不单单是人类或机器，这是人类与机器之间共同的问题。关键是人工智能可以帮助你再较短时间内完成更多的重复性任务。当你掌握了战略和人际关系。这样，人类就可以做他们最擅长的。\n机器学习\n人工智能最激动人心的领域之一。\n就像一个人，机器会不断学习数据，随着时间的推移，变得更聪明，但与人类不同的是，它不是容易的事情，短期记忆丧失，信息过载，睡眠剥夺，分心。但是这些机器是怎么学习的呢？\n虽然一个人可以非常轻松的知道一只猫和一只狗之间的区别，但是对于一台电脑而言这不是很容易，当你考虑外表之间的区别，你可以说颜色，或者说猫有尖耳朵而狗有圆耳朵，但这些规则并不普遍。尾巴长度之间、毛皮质地和颜色等等，这意味着会有很多繁琐的规则，必须手动编写程序帮助电脑识别。而且不能编写用于解决问题的程序，而是改为编写可以从实例中学习如何解决问题的程序。这种程序，使计算机能够随着时间推移逐渐提升自己的能力。但是记住，机器学习像人类一样。就像任何的孩子，这意味着他们必须从经验中学习。与机器学习、项目分析用成千上万的数据来构建一个算法。然后调基于是否达到它的调整算法。随着时间的推移，这个项目会更聪明。这就是IBM’s Watson可以诊断病症，自动生成古典交响乐解决其他问题。有些项目甚至模仿人类的大脑结构，构建完整的神经网络，帮助人类使用现在机器一一解决问题。机器学习已经融入到我们生活中，它就像某种看不见的魔法剂发挥着神奇功效。\n识别技术用途非常广发，不仅可以用于识别人脸，还能在大型强子对撞机进行粒子对撞实验中协助检测是否出现了某种粒子。研究人员和工程师尝试找出训练计算机学习事物的最佳方法。他们根据人脑的大致运作方式建立了一套算法，给机器学习带来了大幅度进展，这套算法叫人工神经网络，就是以数学方式粗略模拟生物神经网络的运作方式。在生物大脑中，有很多称为神经元的细胞，每个神经元会观察与它邻近的神经元所传递的信息，然后决定自己要表达什么。\n而在人工神经网络中，我们将一些小型数学函数放到某个组织好的架构中，然后对它们下达指令“你们要一起学习如何完成这项工作”。人脑中有许多神经网络非常擅长识别事物，所以我们可以轻易识别出这是狗，这是猫以及各种各样的东西。举个例子来看如何识别一只狗。在过去，我们只要让三层神经网络成功运作就心满意足了，后来随着技术的突破可以能够训练更深层次的神经网络，正因如此机器学习也被称为深度学习。位于底层的某个神经元只会观察照片上的一小部分并进行一些相关运算，它并不了解狗具体是什么样的生物，但这个神经元非常清楚自己的任务，“我要传递一个对其他神经元有用的信号”，而下一个神经元会接着传递一个信号，下一个又会传递信号给下下个就这样逐个传递下去。这样整个一个过程就相当于将一个非常复杂的绳结解开，并把每根绳子拆分出来，以便信号能够更轻松地传递。\n我们将表面上交织在一起的各种信息和原本缠绕的信息梳理开来，进而识别出某个事物的全貌。我们在最顶层安排了两个神经元，这两个神经元目前会看到整张照片，它们专门负责做出最后判断，最后得出结论：“哦！所有下层神经元向我传递了这些信息，由此我知道了这是一只狗或者我至少有92.4%的把握认定这是一只狗，所以，这个东西应该就是一只狗。”虽然在训练计算机进行学习方面已经取得了这么多的进展，但计算机的学习速度还是远不及人类，并且会犯一些我们根本不会犯的错误。计算机学习需要很长的一段时间，如果我们在学习初期给它看一张校车照片，过一会再给它看一张校车照片，它能识别出校车的可能性微乎其微，即使它刚刚看过，它还是没有办法正确识别出来，但小孩可以。人类真是不可思议的学习机器。"}
