{"content2":"作者：张达衢   来源：人民网-人民日报海外版现状：技术研究领先，创新驱动发展打开支付宝，我们可以和阿里机器人进行对话；打开手机，语音识别可以为我们解答问题；打开讯飞输入法，可以实现高精度语音转化为文字输入；打开百度，可以为我们推荐最需要的搜索方案……人工智能，已经深入到中国人的日常生活中，为我们的生活带来诸多便利。中国在人工智能领域已经取得阶段性成功。艾媒咨询数据显示，2016年中国人工智能产业规模增长率达到43.3%，突破100亿元，预计2017年达到152.1亿元，并于2019年增长至344.3亿元。由此，业内人士将2016年定义为“中国人工智能元年”。这不仅仅是因为人工智能产业本身的火爆，更是因为人工智能概念在整个市场中分量的递增。一方面，中国人工智能研究正处于爆发期。工业和信息化部副部长刘利华表示，目前中国在人工智能技术研究方面已经走在了世界前列。数据显示，中国人工智能专利申请数累计达到15745项，位列全球第二，中国已是当今世界人工智能研发领域的领头羊之一。在此背景下，人工智能也迎来了政策上的利好，首次作为新兴产业的代表，被写入2017年的政府工作报告。“除去国家层面的政策之外，各地政府也开始密集出台人工智能产业配套扶持资金政策，努力解决企业发展的实际问题。”赛迪顾问高级分析师向阳指出，截至2016年底，已有超过30个城市将机器人产业作为当地重点发展对象，各地政府建成和在建的机器人产业园达40余家。另一方面，基础研究的进步使得人工智能的商业化得到了很好的支撑。“在PC互联网时代，中国是追随者；在移动互联网时代，中国有许多产品创新；在人工智能时代，中国在产品与技术方面都可以有很多创新。”百度公司总裁张亚勤表示，人工智能已经成为当今中国企业发展的中坚力量。“我们曾经依靠资源、资本、劳动力等要素投入，支撑中国经济的快速增长和规模扩展，但这已经成为历史”，中国人工智能学会理事长、中国工程院院士李德毅说：“加快从要素驱动发展向创新驱动发展转变，人工智能是一种解决方案。”机遇：海量数据资源，企业多方布局“在交通领域，我们可以看到城市大脑是如何思考的。”美国电气和电子工程师协会院士、阿里云机器视觉科学家华先胜生动地描述，应用阿里在杭州开发的城市大脑系统，能够感知复杂道路下车辆的运行轨迹，准确率达99%以上。这套系统是全球唯一能够对全城视频进行实时分析的人工智能系统。过去的两年中，以百度、腾讯、阿里为代表的中国科技巨头均纷纷在人工智能领域发力。百度在人脸识别领域的成绩获得世界认可，在人脸识别技术两个最为权威的国际评测中，都获得了第一名的佳绩，腾讯则推出自动化新闻写作机器人。“中国正与全球同步迈进，在计算机视觉、语音识别等细分领域甚至处于国际领先水平。”刘利华说，中国涌现出一批具备竞争实力的企业和研究机构，已具良好的发展基础。对此，艾媒咨询分析师认为，中国人工智能产业起步相对较晚，但是在产业布局、技术研究等基础设施方面正处于进步期。随着科技、制造等业界巨头公司的布局深入，人工智能的产业规模也将进一步的扩大。统计显示，至2015年末，中国人工智能领域已有近百家初创公司，在视频大数据、大数据智能分析、智慧医疗、无人驾驶、人脸识别等领域发力布局。在人工智能领域最为成熟的语音识别方面，已经能够达到99.7％的准确率。“机器人已经可以对话，可以听、说、读、写、译，人工智能正在走入寻常百姓家。”李德毅说。而无人驾驶领域，也在逐步推进。“从辅助驾驶到半自动驾驶、无人驾驶，未来中国汽车的高智能化将非常普及。”北汽新能源汽车总经理助理、营销支持部总监王水利在接受本报记者采访时表示，智能化将是中国汽车发展的一大趋势，很多汽车企业已经在智能化方面投入大量研发资金。业内人士表示，中国在人工智能应用领域具有他国无法比拟的优势，借助海量数据，中国企业已经在语音识别、语言翻译、无人车等领域取得领先地位。“人工智能的核心关键是海量的数据，在中国这些数据是存在的，而且都是能产生价值的，我们预期，人工智能将是中国引领全球最好的机遇。”创新工场董事长兼首席执行官李开复说。发展：告别“单打独斗”，推动产业集群管理咨询公司麦肯锡发布的一份报告认为，数据资源规模及种类增加、科技巨头和风投日趋关注、人工智能平台数量和规模激增，将给中国一次“后发制人”的机遇。麦肯锡预计，中国人工智能应用市场将以50%的增速逐年增长，远超全球市场20%的复合年增长率。“人工智能有今天的形势是非常不容易的，我们想保持好这样的态势，使得社会长期关注，需要形成一个巨大的产业。”中国科学院沈阳自动化研究所所长于海斌在2017全球人工智能技术大会上说。事实上，中国只有不到25%的人工智能从业者拥有超过10年的行业经验，而在美国，这一比例为50%。必须承认，尽管中国在语音识别等细分领域上已颇具领先地位，但中国人工智能产业集群的建设稍显缓慢，人工智能在产学研之间还尚未形成完善的共赢机制。“中国人工智能产业目前仍以‘单打独斗’为主，缺乏技术间的协同，产品间的互联互通和上下游的互动缺乏有效协调，无法形成发展合力。”赛迪智库电子信息产业研究所副所长温晓君建议，要建立集技术研发、示范应用、产品检测认证、知识产权等功能为一体的产业公共服务平台，打造人工智能创新孵化中心，促进产融对接。而打造产业公共服务平台，提升人工智能的集群式创新能力，无疑需要各地方政府和产业园区运营商的扶持。去年至今，政府频繁出台相关规划方案，要求培育全球领先的人工智能骨干企业，培育人工智能产业生态，建立人工智能产业体系、创新服务体系和标准化体系，打造人工智能市场应用规模。“如果说以前人工智能是散兵游勇，那以后就是被纳入编制的正规军了。”达泰资本创始人叶卫刚表示，希望政府能过通过市场化的方式来支持这个产业的创新和发展。有业内专家指出，人工智能必须通过应用落到不同产业，才能释放其巨大潜能。人工智能这种新技术结合教育、医疗、客服、家居、穿戴设备、机器人、电子商务等各行各业，对传统行业都带来很大的冲击，将促进各领域产业的蓬勃发展。"}
