{"content2":"人工智能的浪潮从2012年开始至今，席卷全球，几乎是家喻户晓的词汇。同时，人工智能也是多学科交叉的领域，涵盖了专家系统、机器学习、进化计算、模糊逻辑、计算机视觉、自然语言处理、推荐系统等诸多领域。\n目前我们所研究和应用的，是专用人工智能（或称为弱人工智能、感知人工智能）；与专用人工智能相对的，是通用人工智能。专用人工智能阶段的智能体仅在特定领域有效果，比如AlphaGo在围棋领域战胜人类，但在象棋等其它棋类游戏中，用相同的程序就无法实现比较好的效果。而人类这一通用人工智能的智能体，不仅可以识人辨物，还会下象棋、打扑克或者麻将，不限于特定领域。\n机器学习：一种实现人工智能的方法\n当下专用人工智能的突破，归功于机器学习。但是，机器学习仅仅是实现人工智能的一种或者一类方法，并不是全部，这一点希望大家有清晰的认识。\n机器学习从上个世纪50年代发展至今，衍生出了很多热门的研究子领域，以21世纪为例，先后经历了流形学习、稀疏学习、深度学习、深度强化学习、迁移学习等数个热点。甚至直到现在，学术界对于机器学习都没有完全统一的定义。\n机器学习数学基础\n总体来看，机器学习涵盖了微积分、概率论与数理统计、线性代数、矩阵论、信息论、优化理论等数学基础。近期，我们联合南京大学计算机科学与技术系博士生与中科院自动化所博士，共同推出『机器学习数学基础』在线课程，课程大纲分享给大家，包含了机器学习涉及到的主要数学知识点。\nChaper1：引言\n数学之于机器学习的必要性和重要性\nChaper2：函数求导\n1. 背景介绍：以误差逆传播（BP）算法为例\n2. 函数的极限\n3. 偏导数，方向导数，梯度\n4. 复合函数求导的链式法则\n5. 案例分析：BP算法及其应用（以手写数字识别为例）\nChaper3：矩阵论\n1. 背景介绍：以线性回归为例\n2. 矩阵概念与运算\n3. 矩阵范数\n3.1 范数定义\n3.2 Lp范数\n3.3 最小二乘回归误差度量\n4. 矩阵的行列式、逆、秩和迹\n4.1 求解线性方程组：高斯消去法\n4.2 矩阵的逆\n4.3 线性空间及其基\n4.4 方程组求解的行列式表达\n4.5 矩阵伪逆\n5. 矩阵的特征值和特征向量\n5.1矩阵特征值定义\n5.2 矩阵的迹和行列式与特征值的关系\n6. 奇异值分解\n6.1 矩阵奇异值的定义\n6.2 矩阵的奇异值分解\n7. 矩阵求导\n7.1矩阵导数的定义\n7.2 矩阵导数对最小二乘的应用\n8. 矩阵二次型与半正定\n8.1 矩阵二次型\n8.2 矩阵半正定的定义\n8.3 最小二乘的半正定视角\n9. 案例分析：线性回归及其应用（以前列腺癌发病率预测为例）\nChaper4：凸优化\n1. 背景介绍：以SVM为例\n1.1 优化背景介绍\n1.2 SVM应用案例\n2. 优化问题与极值\n2.1 优化问题及其标准型\n2.2 优化问题的极值点\n2.3 拉格朗日函数及KKT条件\n2.4 SVM的最大间隔的数学表达\n3. 凸优化基础\n3.1 凸集与凸问题\n3.2 凸函数与琴生不等式\n3.3 保持凸性的运算\n3.4 SVM的凸性分析\n4. 对偶理论\n4.1 对偶问题\n4.2 强对偶\n4.3 SVM的对偶求解\n5. 案例分析：SVM及其应用（以Iris数据集分类为例）\nChaper5：概率论与数理统计\n1. 背景介绍：以朴素贝叶斯为例\n2. 随机变量，概率分布（离散随机变量，连续随机变量）\n3. 联合概率，边缘概率，条件概率，贝叶斯定理\n4. 期望、方差/标准差、协方差\n5. 不等式（切比雪夫不等式等）\n6. 独立性，条件独立性，相关性\n7. 常用分布：二项分布/Bernoulli分布分布（特例），多项式分布/Multinoulli分布（特例），均匀分布（离散/连续），高斯分布，指数分布\n8. KL散度\n9. 极大似然估计\n10. 案例分析：朴素贝叶斯及其应用（以乳腺癌诊断和信用风险评级为例）\nChaper6：信息论基础\n1. 背景介绍：以决策树为例\n2. 信息论中的基本概念I：离散随机变量（熵、联合熵、条件熵、互信息、相对熵，以及相互之间的关系）\n3. 信息论中的基本概念II：连续随机变量（微分熵、交叉熵、多元高斯分布的熵）\n4. 案例分析：决策树及其应用（以乳腺癌诊断和信用风险评级为例）\n转行AI的建议\n（1）人工智能人才的缺口，更多地在于高端人才，而不是调参工。\n这就要求我们在学习机器学习时，不仅要知其然，更要知其所以然，通俗点讲，对于每个机器学习算法，仅仅会调用现成的函数库是不行的，要了解算法背后的原理，亲自推导一遍，亲自写代码实现这个算法，效果最佳。\n（2）等学习完数学知识后，再学习机器学习的做法，未必可取。\n机器学习涉及的数学知识点很多，在实际学习过程中，如果我们一味地学习数学，很容易枯燥厌烦，进而坚持不下来。\n最好的做法是，将数学与机器学习内容高度融合，学习完几个知识点后，接着学习这些知识点对应的机器学习相关算法，会让我们信心倍增。\n随时欢迎想转行人工智能的伙伴，联系我们。我们会抽出专门的时间一一为大家答疑解惑，根据每个人的情况，给予合理的建议或者劝告。"}
