{"content2":"摄像测测量学简介于起峰，尚 洋国防科技大学航天与材料工程学院精密光测图像技术研究中心，长沙 410073摘要 摄像测量学是摄影测量学、计算机视觉、光学测量、数字图像处理分析等学科交叉融合形成的新兴交叉学科，集各学科的优势。在对各种运动、变化过程参数进行测量方面，摄像测量方法具有精度高、自动化、非接触、动态测量、实时测量、易于实施等特点。近十几年来，摄像测量学在国际上发展迅速，国内目前还未见到对摄像测量学的释著述。本文从学科内涵、历史、基本原理、应用、优势和发展前景等方面对摄像测量学进行了简介和展望。关键词 摄像测量学；摄影测量学；计算机视觉；数字图像处理分析引言摄像测量学（videometrics或 videogrammetry）是近十几年来国际上迅速发展起来的新兴交叉学科。它主要是由传统的摄影测量学（photogrammetry），光学测量与现代时尚的计算机视觉 （computervision）和数 字 图 像 处 理 分 析 （digital imageprocessingand analysis）等学科交叉、融合，取各学科的优势长处而形成的[1-6]。它的处理对象以数字（视频）序列图像为主。摄像测量学是研究利用摄像机、照相机等对动态、静态景物或物体特别是运动目标进行拍摄得到单帧或序列数字图像，用数字图像处理分析等技术结合各种目标三维信息的求解和分析算法对目标结构参数及运动参数进行测量和估计的理论和技术。1 摄像测量学的内涵和发展历史1.1 摄像测量学的内涵将三维空间中的景物反映到二维图像上是一个退化过程。 摄像测量学就是研究如何通过分析二维图像重建目标的三维信息。摄像测量学的内涵主要包括两个方面： 一是物体的空间三维特性与成像系统间的成像投影关系，这方面主要是测量学方面的知识；二是从单幅和多幅图像中高精度自动提取、匹配图像目标，这方面主要是计算机视觉方面的知识。随着摄影测量的三角测量理论和计算机视觉多视几何理论的日趋发展成熟，目前摄像测量的研究越来越多地涉及第二个方面，即图像目标的自动、高精度识别定位上。它与常规图像处理的不同在于更注重于目标的提取定位精度。摄像测量为了进行二维、三维定量测量，必须将图像与成像系统及其参数紧密联系起来，而普通的图像处理一般与成像系统参数无关。因此，摄像系统的高精度标定是摄像测量的重要特点。传统摄影测量涉及到的大多是专业的摄影测量型相机，通常具有专门的标定设备和方法。而摄像测量大多采用的是普通的摄像机、照相机，经过多种不同的标定方法，可以使非测量型摄像机、照相机达到测量的要求，用于高精度测量。1.2 摄像测量学的发展历史摄影测量学和计算机视觉是摄像测量学的两个重要根基。自从 1839 摄影术诞生起，就开始了用照片进行各种测量的应用与研究。围绕着提高精度这一测量中的永恒主题，摄影测量学经过模拟摄影测量、解析摄影测量阶段，现在已进入数字摄影测量阶段，有非常完备的高精度测量的理论和方法体系。由于传统摄影测量要求的硬件设备繁杂、昂贵，测量算法复杂、计算量大，摄影测量学的研究和应用主要集中在国家、军事和大结构层面上，特别是航空摄影测量和卫星照片测量，并且这种航空摄影测量和卫星照片测量已形成了庞大的测绘产业；而在普通民用领域的中近景摄影测量开展却少得多。计算机视觉（或称机器视觉）作为一门学科成形于 20 世纪 80 年代，至今仍可以说是一门新兴学科。计算机视觉以及与之紧密相关的数字图像处理、图像分析、图像理解等现代学科是信息时代信息科学的重要代表。计算机视觉自形成以来从基本理论、算法到相关的硬件，特别是应用上都得到了迅猛发展，并有许多成熟、成功的应用。计算机视觉领域大多数是以目标识别、图像理解以及显示、监控等应用为主，有丰富的图像处理、分析算法，具有简单、灵活、快速、适应性强等特点，但通常对于测量精度的要求不高。在学科发展的历史中，摄影测量学主要在地学测绘领域中发展，是地理学科的重要分支；而计算机视觉、机器人视觉、图像处理分析等主要是在计算机科学、人工智能领域中发展。两者的形成和发展相对独立，早期交流较少，在所采用的理论方法、面向的应用对象和研究人员归属等许多方面都有较大的区别，形成了各自的特点、优势和理论体系。国际摄影测量与遥感协会对摄影测量与遥感的定义为“利用非接触成像传感器和其他传感器系统， 通过记录 、量测、分析和表达等处理来获取地球及其环境，以及其他物体的可靠性信息的科学、技术和工艺”[7]。而计算机视觉的内涵是“试图用像机获取环境图像并转换成数字信号，用计算机实现对视觉信息处理的全过程”，“从信息处理的层次研究视觉信息的认知过程，研究视觉信息处理的计算理论、表达与计算方法”[8]。对于两者交叉融合形成的摄像测量学， 测绘界称其为videogrammetry，而计算机视觉界称其videometrics。国内有学者称其为视觉测量或视频测量学[9]。事实上，两个学科大方向都是通过图像来定量观察和认识客观世界，其研究任务在本质上是一致的。随着学科的发展以及各种观察和测量任务的不断涌现，摄影测量和计算机视觉两大领域的研究人员越来越深刻地了解和体会到两者相互借鉴、融合的必要性和重要性，两个领域研究人员的交流越来越密切。特别是近十几年来，无论是摄影测量领域的会议还是计算机视觉中的有关测量、三维重建等的分会议上，通常都有两个领域的人员共同参加，并都占有很大比例。近年来多数相关的国际会议都有意安排会议的主席、副主席分别由两个领域的人员交叉担任，以促进这种交流和融合。正是由于摄影测量与计算机视觉本质上并无严格的区别和界限，因而二者能够很好地融合。只是传统的摄影测量学更强调精度，偏重于航测、卫测等传统的遥感和测绘领域，而计算机视觉更偏重于数字图像处理、图像分析、图像理解方面。 videometrics 在体现二者在理论、方法、算法以及应用方面的互通和互补的基础上，更加强调动态测量和实时测量。笔者推荐采用“摄像测量学”作为 videometrics 这一交叉学科的命名。在国内外也有许多人把有关的技术方法称为光学测量或简称光测，这主要是与雷测、遥测等其他类型的测量手段相区别。2 摄像测量学的基本原理2.1 成像模型要通过用摄像机、照相机拍摄的图像得到目标实体的空间信息，首先需要建立描述目标实体与图像之间映射关系的成像模型，这是摄像测量中各种方法和算法的基础。为了使图像与实际景象具有相似性，特别是与人眼的成像机理相似，绝大部分成像设备都采用如图 1 所示针孔模型，或称为中心透视投影模型来描述成像关系的。图 1 中，目标点 P 的空间坐标为（X，Y，Z），像机光心为Oc，像平面为 Π，P 对应像点的图像坐标为p(x，y)。中心透视投影成像关系是：所有的成像光线都通过光心，目标点、像点与光心共线。从而得到摄像测量的最基本数学关系式，即共线方程其中，（Cx，Cy） 为主点坐标， 是像机光轴与成像平面的交点；（Fx，Fy）为等效焦距 ，是实际焦距分别与单个像元宽度和高度的比值；R 为旋转矩阵，T 为平移向量，用于描述像机的位置和姿态；λ为比例常数。 共线方程实际上就是描述经过目标点、光心、成像点的这条光线的空间直线方程。中心透视投影成像模型是线性的，而实际成像中，由于制造工艺等原因，成像存在几何畸变，其中最主要的是镜头畸变，使得成像时不严格满足中心透视投影关系。实际成像与中心透视投影成像之间的偏差称为像差。在精度要求较高的摄像测量任务中，应该在线性成像模型的基础上叠加非线性的像差来描述成像关系。2.2 像机标定摄像测量任务中， 通常需要先知道像机的等效焦距、主点坐标、旋转矩阵、平移向量以及描述像差的像差系数等参数。其中一些参数可以根据像机和镜头的标称参数给出，但旋转矩阵和平移向量必须通过标定给出。而在高精度测量中，像机和镜头的标称参数通常不能满足精度要求，也需要进行标定。像机标定在摄像测量中非常重要，有效、高精度的标定是高效、高精度测量的前提。摄像测量中像机标定的实施方式主要是利用像机采集标定参照物的图像，再通过分析图像来求解像机参数。 除标定参照物外，基本不需要使用专门的标定设备，实施比较方便，目前应用很广泛。在各种不同的观测条件下，涉及的标定算法亦复杂多样，这是摄像测量领域研究的重点和热点之一。2.3 目标三维信息的获取摄像测量的任务主要是从二维图像获取目标的三维信息，其中最基本的是目标的位置、姿态和结构参数，而更多的速度、加速度、角速度、变形参数等则在位置、姿态、结构参数的基础上进行综合分析得到。上述成像模型已分析，根据一个像点只能确定目标的方位（一条通过像点和光心的光线），而无法得到距离信息。为得到目标的三维参数，必须增加条件，如采用序列图像、已知目标结构等。测量中最常用的确定目标三维信息的方式是利用两台或多台像机同时成像，进行交会测量。其基本原理如2.4 基本求解算法具体解算时，摄影测量学界典型的代表算法是光束法平差（bundle adjustment）。近年来，计算机视觉界也引入了这一算法，计算机视觉领域的学者译为“捆绑调整”或“捆集调整”。光束法平差的基本原理是对被测物体从不同角度、位置拍摄多幅图像，则物体上所有特征点的物点、像点、光心都应落在相应的光线上，即满足成像的共线关系。平差的过程就是通过优化使这些共线关系的总体偏差为最小。在平差求解的过程中，物点、光心、光轴等的参数都可以作为平差参数进行修正，并可以加入各种约束条件，从而得到完备的最优解。但平差求解需要较好的初值和进行多次迭代，运算量较大。计算机视觉界的典型代表算法是各种条件下基础矩阵和投影矩阵的线性求解，具有简单、快捷、灵活的特点；但当存在各种误差因素时，求解精度容易受影响；并且基础矩阵或投影矩阵各元素与成像模型参数是耦合的，各参数物理意义不明确，进行分解和用于测量时会影响精度。摄像测量学中，通常将上述两者有机结合，采用计算机视觉中线性求解投影矩阵和矩阵分解的算法求解各个参数的初值，再采用摄影测量中的光束法平差对各个参数进行调整，求得最优解。不仅可以对运动参数和结构参数进行平差调整，还可以对某些容易受到扰动的系统参数进行调整，包括像机参数、目标结构参数等。这样即灵活方便，同时又能够得到最优的精度，并且具有很好的鲁棒性，即使在摄像测量系统受到干扰的情况下，仍能得到高精度的测量结果。在求解过程中，还可以考虑各种约束条件，包括目标某些结构特征的约束、序列图像分析中目标运动规律的约束等，进一步提高求解的精度和稳定性。3 摄像测量学的应用由于具有诸多的优点， 摄像测量技术已经广泛应用于各种精密测量和运动测量，涉及到航空航天、国防试验、勘察勘测、交通运输、建筑施工、体育运动、照片真伪鉴别等领域[10-12]。这里仅列举笔者所在课题组应用摄像测量技术的几个实例。3.1 火箭待发段箭体倾倒角度实时测量载人航天飞船发射过程中， 在火箭飞离塔架前的待发段，需要实时监测箭体的倾倒角度，如果箭体偏离竖直方向超过某一角度，逃逸飞行器就要点火，承载航天员逃离火箭。“火箭待发段箭体倾倒角度实时测量图像分系统”是载人航天工程的关键安控子系统之一。系统用两台摄像机从不同角度对箭体拍照（图 3）。系统在实时图像上自动提取箭体上的各种标志或箭体的边缘，并交会测量出箭体上几个合作标志的空间位置或箭体中轴线的姿态角度，实时给出箭体倾倒角度，当倾倒角度超过安全范围时就发出警报。该系统已在“神舟”系列载人飞船发射任务中正式使用。3.2 长距离轨道几何参数检测铁轨几何参数检测是铁路铺设和养护的重要内容和前提条件。 列车的运行速度越来越快，对铁轨几何参数检测的精度和效率要求也就越来越高。如图 4 所示，该轨道几何参数检测方法是利用实时变焦摄像机拍摄在铁路轨道上行走的测量小车上的合作标志，通过分析图像，实时测量出钢轨的轨距、高低、超高等参数。该研究首次将摄像测量技术引入铁轨几何参数测量，较国外激光准直度铁轨几何参数系统结构和操作简单、精度高、价格低廉，已在工程上实施。3.3 飞船返回舱抛投实验三维运动测量为了研究载人飞船返回舱返回着陆的运动特性，需要进行大量的抛投实验并测量返回舱的运动参数。原有的采用三维陀螺进行测量的方案每进行一次实验都要更换陀螺，成本很高。而“飞船返回舱抛投三维运动参数摄像测量系统”仅需用摄像机记录返回舱抛投过程的影像，采用笔者所在课题组获得发明专利的中轴线法、螺旋线法等可以得到高精度返回舱抛落的轨迹和姿态角度。实验场景如图 5 所示。4 摄像测量学的优势和发展前景4.1 非接触、高精度是摄像测量的首要特征摄像测量通过分析目标图像实现测量目的，属于非接触测量， 因而不会对目标的结构特性和运动特性带来任何干扰，测量结果客观可信。精度是测量中的永恒主题，摄像测量学方法及其应用系统具有场（面）目标测量精度高的优点。除了完备的光束法平差保证了三维解算的高精度，数字图像分析中各种亚像素方法也使得目标的图像定位精度能够达到 10-1甚至 10-2像素的量级，有效地保证了最后测量结果的精度。正是由于摄像测量非接触和高精度的特点，在试验靶场经常将摄像测量（在这些场合通常称为“光测”）作为外测手段和用来标校其他测量设备。4.2 运动和动态测量是摄像测量的重要优势之一对于时间序列图像，摄像测量除了对单幅图进行分析定位，通常还将考虑运动约束，对物体进行运动估计，既测量得到物体对象的静态三维信息，也能够测量得到物体对象在时空中的变化（运动、变形）信息。这是摄像测量的最重要优势之一，也是与传统摄影测量的主要区别之一。由于时间序列图像提供了一维时间轴信息，比静态图像处理方法有许多优势，使得传统方法中一些困难的问题迎刃而解。例如在传统静态处理中，对两幅有较大立体视差的图像，由于图像特征与背景可能有较大变化，同名点配准的可靠性较低。而对序列图像，可以通过特征点跟踪锁定的方法实现同名点配准，可靠性得到极大的提高。4.3 实时测量是摄像测量的重要发展趋势之一随着计算机硬件的飞速发展，特别是各类DSP、FPGA 等小型处理器的发展，以及各种图像处理、分析算法软件的大量涌现和人工智能技术的发展，使得许多摄像测量学任务可以实时或准实时完成。 摄像测量已进入了实时处理时代，实时测量的可能与实现为摄像测量学开辟了新的广阔的研究和应用领域，例如实时监测、工业零件加工、安装检测、质量监控、各种飞行器的运动参数测量、飞行器车辆等运动平台的视觉导航等。4.4 易于普及并更拓宽了摄像测量的发展前景成本的降低和性能的提高使得摄像机、计算机等硬件迅速普及，尤其是摄像测量所使用的初级传感器，摄像机和照相机。加之摄像测量具有实施简易、适用面广等特点，使得摄像测量正在从航天、国防等高端应用向普通民用扩展，并必将迎来更大的发展普及。目前国际上在许多不同应用领域中已有很多摄像测量方面的商品化产品。 摄影测量学的发源地德国在这方面仍处于领先的地位。 例如在对轿车三维外形进行高精度检测时，他们的做法是在轿车的表面贴上大量的合作标志，然后用普通数码相机随意从四周拍摄轿车的十几至几十幅图像，通过自动地对这些图像进行摄像测量处理（识别、提取合作标志，重建三维结构，优化处理结果），可以现场得到整车的三维外形数据，精密达到 0.02～0.05 mm。4.5 开发具有自主知识产权的应用产品是重要任务国内涉及摄影测量和计算机视觉方面的文献很多，但明确介绍摄像测量的文献很少。 中国在这方面的研究，尤其是产品化方面的工作还很不够。 在国际有关摄像测量的产品博览会上，各种知识产权的应用产品林林种种，但是中国具有自主知识产权的应用产品却相对甚少。参考文献（References）[1] Legac A.Videogrammetry or digital photogrammetry: General remarks,methodology,applications[J]. Proceedings of SPIE, 1994, 2350: 16-21.[2] Jensen S C,Rudin L. Measure: An interactive tool for accurate forensicphoto/videogrammetry[J].Proceedings of SPIE, 1995, 2567: 73-83.[3] Hartley R,Zisserman A. Multiple view geometry in computer vision[M].Cambridge: CambridgeUniversity Press, 2000.[4] McGlone J.Manual of photogrammetry [M]. Annapolis: American Societyfor Photogrammetry andRemote Sensing, 2004.[5] 张祖勋. 数字摄影测量 30 年[M[. 武汉: 武汉大学出版社,2007.Zhang Zuxun. The last 30 years of digital photogrammetry [M]. Wuhan:WuhanUniversity Press, 2007.[6] Forsyth D A,Ponce J. Computer vision: A modern approach [M]. London:Prentice Hall, 2003.[7] 张剑清, 潘励, 王树根. 摄影测量学[M]. 武汉: 武汉大学出版社,2003.Zhang Jianqing, Pan Li, Wang Shugen. Photogrammetry [M]. Wuhan:WuhanUniversity Press, 2003.[8] 马颂德, 张正友. 计算机视觉[M]. 北京: 科学出版社, 1998.MaSongde, Zhang Zhengyou. Computer vision [M]. Beijing: SciencePress, 1998.[9] 张广军. 视觉测量[M]. 北京: 科学出版社, 2008.ZhangGuangjun. Vision measurement[M]. Beijing: Science Press, 2008.[10] 于起峰, 陆宏伟, 刘肖琳. 基于图像的精密测量与运动测量[M]. 北京:科学出版社, 2002.Yu Qifeng, Lu Hongwei, Liu Xiaolin. Precise measurement andmotionmetric based on image[M]. Beijing: Science Press, 2002.[11] 尚洋, 李立春, 雷志辉, 等. 摄像测量技术在国防试验与航天器对接中的应用研究[J]. 实验力学, 2005, 20(增刊): 91-94.Shang Yang, Li Lichun, Lei Zhihui, et al. Journal ofExperimental Mechanics, 2005, 20(Suppl): 91-94.[12] 李立春, 张小虎, 刘晓春, 等. “华南虎”照片的摄像测量研究[J]. 科技导报, 2008, 26(1): 59-67.Li Lichun, Zhang Xiaohu, Liu Xiaochun, et al.Science and TechnologyReview, 2008, 26(1): 59-67."}
