{"content2":"人工智能研究趋势直到本世纪初，人工智能的吸引点主要在于它所传递的承诺，但在过去的十五年里，大多这样的承诺已经得到兑现。人工智能技术已经充斥了我们的生活。当它们成为了社会的一股中心力量时，该领域正在从仅仅建立智能系统，转向了建立有人类意识的、值得信赖的智能系统。几个因素加速了人工智能革命。其中最重要的是机器学习的成熟，部分由云计算资源和广泛普及的、基于 Web 的数据收集所支持。机器学习已经被「深度学习（deep learning）」急剧地向前推进了，后者是一种利用被称作反向传播的方法所训练的适应性人工神经网络的一种形式。信息处理算法的这种性能飞跃一直伴随着用于基本操作的硬件技术的显著进步，比如感觉、感知和目标识别。数据驱动型产品的新平台和新市场，以及发现新产品和新市场的经济激励机制，也都促进了人工智能驱动型技术的问世。所有这些趋势都推动着下文中所描述的「热门」研究领域。这种编辑只是想要通过某个或另一个度量标准来反映目前比其他领域得到更大关注的领域。它们不一定比其他领域更重要或更有价值。事实上目前的一些「热门」领域在过去几年中并不怎么流行，而其他领域可能在未来会以类似的方式重新出现。大规模机器学习许多机器学习的基本问题（如监督和非监督学习）是很好理解的。目前努力的一个重点是将现有算法扩展到更庞大的数据集上。例如鉴于传统方法能够负担得起若干遍数据集的处理，现代方法是为单次处理所设计；某些情况只认同非线性方法（那些只关注一部分数据的方法）。深度学习成功训练卷积神经网络的能力非常有益于计算机视觉领域，比如目标识别、视频标签、行为识别和几个相关变体的应用。深度学习也在大举进军感知方面的其他领域，如音频、语音和自然语言处理。强化学习鉴于传统机器学习主要关注于模式挖掘，强化学习将重点转移到决策中，这种技术将有助于促进人工智能在现实世界中更深入地进入相关研究和实践领域。作为一种经验驱动型的序贯决策框架，强化学习已经存在了几十年，但是这个方法在实践中没有取得很大成功，主要是由于表征和缩放的问题。然而深度学习的出现为强化学习提供了「一贴强心剂」。由谷歌 DeepMind 开发的计算机程序 AlphaGo 在五次对抗比赛中击败了人类围棋冠军，它最近所取得的成功在很大程度上要归功于强化学习。AlphaGo 是通过使用一个人类专家数据库来初始化一个自动代理的方法被训练的，但随后提炼的方法是通过大量地自我对抗游戏以及应用强化学习。机器人至少在静态环境中，机器人导航在很大程度上被解决了。目前的努力是在考虑如何训练机器人以泛型的、预测性的方式与周围世界进行交互。互动环境中产生的一个自然要求是操纵，这是当下所感兴趣的另一个话题。深度学习革命只是刚开始影响机器人，这在很大程度上是因为要获得大的标记数据集还很困难，这些数据集已推动了其他基于学习的人工智能领域。免去了标记数据需求的强化学习可能会有助于弥合这一差距，但是它要求系统在没有错误地伤害自己或其他系统的情况下能够安全地探索出一个政策空间。在可信赖的机器感知方面的进步，包括计算机视觉、力和触觉感知，其中大部分将由机器学习驱动，它们将继续成为推进机器人能力的关键。计算机视觉计算机视觉是目前最突出的机器感知形式。它是受深度学习的兴起影响最大的人工智能子领域。直到几年前，支持向量机还是大多视觉分类任务所选择的方法。但是特别是在 GPU 中的大规模计算的汇合，使得更大数据集的可获得性（尤其是通过互联网）以及神经网络算法的改进导致了基准任务中能的显著提高（比如 ImageNet 中的分类器）。计算机首次能够比人类更好地执行一些（狭义定义的）视觉分类任务。目前的研究多是关注于为图像和视频自动添加字幕。自然语言处理自然语言处理是另一个通常与自动语音识别一同被当做非常活跃的机器感知领域。它很快成为一种拥有大数据集的主流语言商品。谷歌宣布目前其 20% 的手机查询都是通过语音进行的，并且最近的演示已经证明了实时翻译的可能性。现在研究正在转向发展精致而能干的系统，这些系统能够通过对话而不只是响应程式化的要求来与人互动。协同系统协同系统方面进行的是对模型和算法的研究，用以帮助开发能够与其他系统和人类协同工作的自主系统。该研究依赖于开发正式的协作模型，并学习让系统成为有效合作伙伴所需的能力。能够利用人类和机器的互补优势的应用正吸引到越来越多的兴趣——对人类来说可以帮助人工智能系统克服其局限性，对代理来说可以扩大人类的能力和活动。众包和人类计算在完成许多任务方面由于人类的能力是优于自动化方法的，因而在众包和人类计算方面，通过利用人类智力来解决那些计算机无法单独解决好的问题，该领域研究调查了增强计算机系统的方法，这项研究的提出仅仅是在大约 15 年前，现在它已经在人工智能领域确立了自己的存在。最有名的众包例子是维基百科，它是一个由网络公民维护和更新的知识库，并且在规模上和深度上远远超越了传统编译的信息源，比如百科全书和词典。众包专注于设计出创新的方式来利用人类智力。Citizen 科学平台激发志愿者去解决科学问题，而诸如亚马逊的 Mechanical Turk 等有偿众包平台，则提供对所需要的人类智力的自动访问。通过短时间内收集大量标记训练数据和/或人机交互数据，该领域的工作促进了人工智能的其它分支学科的进步，包括计算机视觉和自然语言处理。基于人类和机器的不同能力和成本，目前的研究成果探索出了它们之间理想的任务分离。算法博弈理论与 (基于) 计算机 (统计技术的) 社会选择包括激励结构、人工智能的经济和社会计算维度吸引到了新的关注。自 20 世纪 80 年代初以来，分布式人工智能和多代理（multi-agent）系统就已经被研究了，于 20 世纪 90 年代末开始有显著起色，并由互联网所加速。一个自然的要求是系统能够处理潜在的不恰当激励，包括自己所感兴趣的人类参加者或公司，以及自动化的、基于人工智能的、代表它们的代理。备受关注的主题包括计算机制设计（computational mechanism design）（一种激励设计的经济理论，它寻求激励兼容的系统，其中输入会被如实报告）、(基于) 计算机 (统计技术的) 社会选择（computational social choice）（一种有关如何为替代品排列顺序的理论）、激励对齐信息获取（incentive aligned information elicitation）（预测市场、评分规则、同行预测）和算法博弈理论（algorithmic game theory）（市场、网络游戏和室内游戏的平衡，比如poker——它在近几年通过抽象技术和无遗憾学习（no-regret learning）已经取得了显著的进步）。物联网（IoT）越来越多的研究机构致力于这样一个想法：一系列设备可以相互连接以收集和分享它们的感官信息。这些设备可以包括家电、汽车、建筑、相机和其他东西。虽然这就是一个技术和无线网络连接设备的问题，人工智能可以为了智能的、有用的目的去处理和使用所产生的大量数据。目前这些设备使用的是令人眼花缭乱的各种不兼容的通信协议。人工智能可以帮助克服这个「巴别塔」。神经形态计算传统计算机执行计算的冯诺依曼模型，它分离了输入/输出、指令处理和存储器模块。随着深度神经网络在一系列任务中的成功，制造商正在积极追求计算的替代模型——特别是那些受到生物神经网络所启发的——为了提高硬件的效率和计算系统的稳定性的模型。目前这种「神经形态的（neuromorphic）」计算机尚未清楚地显示出巨大成功，而是刚开始有望实现商业化。但可能它们在不久的将来会变成寻常事物（即使仅作为冯诺依曼所增加的兄弟姐妹们）。深度神经网络在应用景观中已经激起了异常波动。当这些网络可以在专门的神经形态硬件上被训练和被执行，而不是像今天这样在标准的冯诺依曼结构中被模拟时，一个更大的波动可能会到来。总体趋势以及人工智能研究的未来数据驱动型范式的巨大成功取代了传统的人工智能范式。诸如定理证明、基于逻辑的知识表征与推理，这些程序获得的关注度在降低，部分原因是与现实世界基础相连接的持续挑战。规划（Planning）在七十和八十年代是人工智能研究的一根支柱，也受到了后期较少的关注，部分原因是它强烈依赖于建模假设，难以在实际的应用中得到满足。基于模型的方法——比如视觉方面基于物理的方法和机器人技术中的传统控制与制图——已经有很大一部分让位于通过检测手边任务的动作结果来实现闭环的数据驱动型方法。即使最近非常受欢迎的贝叶斯推理和图形模式似乎也正在失宠，被数据和深度学习显著成果的洪流所淹没。在接下来的十五年中，会有更多关注集中在针对人类意识系统的开发上，这意味着它们是明确按照要与之互动的人类特点来进行建模与设计的。很多人的兴趣点在于试图找到新的、创造性的方法来开发互动和可扩展的方式来教机器人。此外在考虑社会和经济维度的人工智能时，物联网型的系统——设备和云——正变得越来越受欢迎。在未来的几年中，对人类安全的、新的感知/目标识别能力和机器人平台将会增加，以及数据驱动型产品数量与其市场规模将会变大。当从业者意识到纯粹的端到端深度学习方法的不可避免的局限性时，会重新出现一些人工智能的传统形式。我们不鼓励年轻的研究人员重新发明理论，而是在人工智能领域以及相关领域（比如控制理论、认知科学和心理学）的第一个五十年期间，保持对于该领域多方面显著进展的觉察。"}
