{"content2":"版本：0.1\n人类智能在宏观上有心理学，微观上有分子生物学等学科研究。但每个方向研究到一定阶段就停滞了，没有哪个学科能告诉我们：为什么能有智能，如何才能产生智能。即使已经了解了大脑的很多知识，人类智能仍然是个黑盒子。\n对黑盒的研究，要么从外部观察其行为，然后来模拟其结构，可称为自上而下的研究；要么猜测其结构，然后从外部的输入输出来验证其行为，可称为自下而上的研究。题目所说的自上而下还是自下而上即是从哪个方向来研究强人工智能问题。\n宏观上研究的成果中，最显而易见的就是类人机器人。这类机器人从行为、语言、表情等方面来模拟人。如果最终能让人觉得这些机器人是真人，那么这个方向就算是成功了。当然，从现在的成果来看还不成功。另一方面是深蓝、沃森这样的依靠在下棋、回答问题等方面来战胜人类智能，从而证明自己能力。从这些特定的领域上来看，它们是比较成功的。但就算是把上面提到的所有方面都合到一起，也很难认为他们达到了人类的能力。\n微观上的研究，是从感知器的结构被提出来后开始的。从此产生了现在的人工神经网络、机器学习等大量的算法和研究成果，解决了很多实际问题。从微观上出发，证明了它们从微观结构上模拟的优势，但需要花费大量时间建立问题模型。\n由此看来，当前自上而下和自下而上的方法都有了一定的成果。但通过现有方法来构建强人工智能，成本是非常巨大的，几乎不可实现。\n有些情况下，物体在很少数量下的性质和庞大数量下的性质相差很大。这也是复杂系统研究的难点。从不同的层级进行研究，能够发现不同的规律，解决不同的问题。这里提到了层级的概念，这里的层级和上一篇文中分层的层次不一样。上文的层次是神经网络中具体的层次。本文的层级是由于研究对象数量或其它性质的巨大不同，从而产生了看上去很不一样的行为。对不同层级的行为能归纳出不同的规律，这些规律能够帮助我们有效的理解和预测研究对象的行为。比如低速下的牛顿力学和光速下的相对论，由于速度的巨大差异，在低速下得出了简化后的牛顿力学，其帮助了我们认识了低速世界。后来的相对论不仅归纳了高速时的规律，在低速下也能适用。再比如物质在原子、分子层面体现出的是基本作用力；在纳米层级又体现出新的性质；在宏观上人能直接观察的规模上，又组成了万物，形成了更复杂、更多的性质。这看起来和智能是很类似的，首先神经元细胞有自己的生物性质；大量神经元细胞（平方厘米级）组合在一起，可以被观察到协同进行某种活动；整个大脑则产生了我们所能感知的智能；而整个人类社会，则储存了人类的所有知识、习惯，产生了群体智能和行为。这种群体智能也不是一个大脑能有效理解和预测的。\n每一层级的规律其实是其低一层规律的规模化结果，其又是上一层规律的基础。如果要对整个系统有全面的了解，就要从某一层级出发，往上或往下研究，得出规律。如果说一个神经元细胞是一个的层级，而整个人脑也是一个层级。在这两层之间还有多少层呢？自上而下的研究方法给出了人脑的功能区的划分，这个作为一个层次。而自下而上的方法给出了人工神经网络的层次，这个层次能够处理单个问题或叫做模式。这两方面的研究到这基本都停滞了。这中间一定还有一个或若干个层次能够帮助我们理解智能的规律。\n再来看看题设的问题，如果一定要给出一个答案的话，我会倾向于自下而上的研究。先说说自下而上研究的优势。自下而上的研究看起来更像是白盒研究，通过模拟来了解智能真正的机制。而自上而下的研究像是黑盒研究，更多的需要去猜测或者尝试来达到同样的功能。如果能够猜出结构当然最好，但如果黑盒非常复杂，猜出结构是很难的。模仿其复杂行为也是很困难的。但同时，自上而下的研究也非常具有指导意义，其了解了人脑不同区域是有分工的，输入输出的处理使用了大部分大脑。自上而下的研究也积累了很多经验，可以用来验证强人工智能的能力。\n强人工智能的物质基础和神经元细胞是不一样的，我们不是通过制造真正的神经元细胞来制造强人工智能。所以研究的最底层级不是直接映射到神经元细胞，要把神经元细胞中与智能相关的一些特性抽取出来，以便在其它物质基础上构造智能。需要区分细胞的哪些行为是和智能相关的，哪些行为是和其物质基础相关的。有些因素也许看上去和物质基础相关，但其可能也影响了智能的产生。以下是一些神经元细胞特性的猜测和讨论，可以有助于把和智能产生相关的部分抽取出来。\n神经元细胞的大部分活动是依靠化学反应，有些是不可逆反应。这个过程需要不断的反应物质和能量的供给，一旦能量跟不上，其反应可能变得迟钝。在计算机中，能量的供给是依靠电子的流动，不需要物质的化学变化，所以能量供给是高效的。但神经细胞对大量刺激会变得迟钝这样的特性也许是产生记忆效果的一个因素。同时，由于细胞内物质浓度的变化，可能会引发下一级反应，从而产生神经元细胞的变化，这也可能是产生记忆效果的因素。总之，从这一点来看，神经元的记忆是可以通过其输入输出的变化来调整的，不一定需要通过全局的目标函数来调整。\n上一点中提到的物质、能量短缺的影响，不仅会影响神经元细胞本身，也会对周围细胞活动产生抑制。这也是一些选举小范围中最活跃神经元算法的物质基础。这个特性有利于减小局部过于活跃，从而产生振荡或弱化全局的特征。\n神经元的树突生长是比较慢的，可能要经过大量的刺激，才能产生有效的突触。强人工智能也许可以通过外部开关来判断是否处于训练时间，来调整连接的建立速度，从而提高学习效率。\n神经元细胞的空间结构。大脑皮层的皱褶展开后是一个平面，这个平面上的灰质细胞也有一定的层数。对于灰质细胞的层次的作用，也产生了有意思的算法，比如Hierarchal Temporal Memory（HTM，这是我看到的最有趣的一个算法）。由于人类的空间是三维的，所以物理结构最复杂也就是三维结构。但考虑到能量供给和信息传输，神经元细胞只能达到类似于二维的结构。这时候就产生了神经元细胞相邻的很多特点。假设神经元细胞树突的长度平均是有限的，而且每个神经元的大部分树突是比较短的，这样相邻的神经元之间的交流就更多，长距离的就比较少。所以相邻细胞之间处理的信息更类似。\n细胞个体的可靠性是没有计算机高的，所以神经元细胞需要更强的冗余性。相邻细胞之间需要通过相互备份来产生冗余。所谓备份、即它们的输入输出状态、以及反应的阈值都比较相似。相似值高，则变化所需要的刺激和能量都高，一方面代表了学习难度的增大，另一方面也代表记忆的强度很高。反之，则学习难度低，但容易因为覆盖或神经细胞死亡产生遗忘。强人工智能也许可以通过减少相邻细胞的相似性来缩小网络的规模，并用别的方式来控制记忆强度。\n神经元细胞的生长分化。神经元细胞是在胚胎发育的过程中产生的，所以有从无到有的过程。在当前神经网络的研究中，网络的初始化和如何决定规模都是需要考虑的问题。而在大脑的初始化依赖于细胞的分裂。在神经细胞的分裂过程中，新的细胞会继承原先细胞的突触。这个过程不仅保留了记忆，同时保持了各种输入输出的连通性。\n总而言之，从神经细胞级的研究，能够找到很多有效的线索和特点，这些是上一个层级规律的基础。但这些特性既有和智能产生相关的部分，又有和生物体运转相关的部分。如何对这些特性进行筛选，从而得出细胞层级的智能基础，对于研究上一层级是非常重要的。由于智能的复杂性，单纯自下而上的研究容易发散到不正确的道路。在各种算法试验的过程中，需要自上而下所得到的一些经验来验证是否走到了正确的路线上。"}
