{"content2":"美国内华达大学（University of Nevada Reno，UNR）计算机视觉实验室（CVL）招收计算机视觉方向的MS、PhD学生，提供RA职位，每月1600$，详细资料见附件。需求：计算机、数学、物理或者工科方向的第一学位；良好的数学基础和C/C++编程技巧；熟悉Linux，熟练使用OpenCV或Matlab；有图像处理、计算机视觉、模式识别或机器学习方向上的背景知识；有过3D重建，3D分割或者3D配准方面的经验，有相关方向的论文；良好的沟通和写作技巧。联系方式：Prof. George Bebis （bebis@cse.unr.edu）对于申请的邮件，附件请以pdf方式发送，需包括：（1）简历；（2）成绩单；（3）个人研究兴趣的介绍；（4）代表性论文；（5）；两个推荐人的姓名。—————————————以上是正文—————————————————PS1：有CSC资助的访问学生或者想申请Postdoc职位的也可以试试。PS2：Reno是内华达州仅次于Las Vegas的城市，号称世界上最大的小城市，离加州非常近，就在加州和内华达州的分界线上，跟San Francisco、Sacramento都很近，离Los Angeles和Las Vegas不算远。Reno边上有世界上非常著名的高山滑雪场，有风景优美的Lake Tahoe，今年的NIPS会议就在Tahoe湖召开。此外，Reno的消费很低，物价很便宜，租房费用在300-450$左右。PS3：Prof. Bebis非常随和，很好说话，对学生也很负责，非常耐心，即使很浅显的问题，也会给你讲解的非常清楚，善于引导学生，课堂和实验室气氛都非常轻松活跃。他自己是几份SCI期刊的编委，也是一个EI会议的主席，学生发文章的压力也不是很大，因此，也不会强迫学生发文章或者强制做项目，非常宽容。虽然UNR是一个一般的学校，但Prof Bebis确实是一个优秀的计算机视觉导师。PS4：计算机视觉实验室，跟美国各大公司（Ford、IBM、Honeywell等）都有紧密联系，跟NASA、ONR、劳伦斯国家实验室、橡树岭国家实验室等也有紧密合作，每年暑期，学生根据相关的项目，可以去其中的某个地方进行2-3月的实习。最后，如果有什么其他问题，可以咨询我，或者直接邮件询问Prof Bebis。附件全文：MS/PhD Research Assistantships in Computer VisionDepartment of Computer Science & EngineeringUniversity of Nevada, Reno, USAThe Computer Vision Laboratory (CVL) (http://www.cse.unr.edu/CVL) in the Department of Computer Science and Engineering (CSE) at the University of Nevada, Reno (UNR) invites applications for several MS and Ph.D. student research assistantships, starting in Fall 2013/Spring 2014. The students who will be awarded these assistantships will be expected to complete a MS or PhD degree with emphasis on computer vision. Support for a typical MS/PhD student covers the student's tuition and fees, health insurance, and offers financial compensation of $1,600 / month.Active research areas within CVL include biometrics (e.g., face, hand, fingerprint), object detection and recognition, object tracking and pose estimation, visual surveillance, human activity recognition, and 3D reconstruction. CVL is currently funded by NSF, NASA, and DoD. The CSE department currently has 14 full time faculty members, 6 adjunct faculty and offers B.S., M.S., and Ph.D. degrees supporting a dynamic and growing program with approximately 300 undergraduate and 70 graduate students.Requirements: A first degree in Computer Science, Mathematics, Physics, or an Engineering subject. Strong mathematical background and excellent programming skills in C or C++. Familiarity with Linux, and good knowledge of OpenCV and/or Matlab. Background in image processing, computer vision, pattern recognition, and machine learning. Previous experience on 3D reconstruction, 3D segmentation, 3D registration, and paper publications are desired. Very good communication and writing skills.How to Apply: Applications should be sent by email (in pdf format) to Prof. George Bebis (bebis@cse.unr.edu) and should include: (1) resume, (2) copies of transcripts, (3) a brief statement of research interests, (4) copies of your most representative publications, and (5) the names of 2 references. Applications should be sent as soon as possible. For more information, please contact Prof. Bebis (http://www.cse.unr.edu/~bebis) at bebis@cse.unr.edu.CSE Department: Graduate students seeking the Doctor of Philosophy in Computer Science and Engineering are given the opportunity to focus on a specific area in computer science and engineering by taking advanced courses and becoming significantly involved in many aspects of original research, advancing scientific knowledge in their field of specialization. In particular, they implement prototype systems, develop and prove new theories, conduct experiments, attend international conferences, and publish their results in scientific journals and conferences.Other Information: UNR is an integral part of the Reno metropolitan area, home to approximately 300,000 people. The 255-acre main campus, located minutes from downtown Reno, features both contemporary and historic architecture, and the university’s tree-lined Quadrangle is listed on the National Register of Historic Places. The academic atmosphere is filled with rich surroundings for the cultural and intellectual development of the students. Reno is bounded on the west by the majestic Sierra Nevada mountain range and on the east by the rolling basin and range province, Reno benefits from a comfortable climate. There are four distinct seasons in this cool, dry climate where the sun shines nearly 290 days a year. The area is noted for its variety of recreational opportunities, which include sailing, camping, hiking, fishing, and sightseeing. Within an hour’s drive of the campus, for example, are Lake Tahoe in the High Sierra, and Pyramid Lake, a unique prehistoric desert sea. Also within an hour’s drive are a number of nationally known ski areas, including Squaw Valley, site of the 1960 Winter Olympics. Reno is within 2 hours' drive from Sacramento and 3.5 hours' drive from San Francisco."}
