{"content2":"目录\n一.  政策\n二. 主要发展阶段\n三. 60年历程关键事件\n一.  政策\n为推动我国人工智能规模化应用，全面提升产业发展智能化水平，2017年7月20日，国务院印发了《新一代人工智能发展规划》，并将在制造、金融、农业、物流、商务、家居等重点行业和领域开展人工智能应用试点示范工作。就金融行业而言，《规划》指出，要在智能金融方面，建立金融大数据系统，提升金融多媒体数据处理与理解能力；创新智能金融产品和服务，发展金融新业态；鼓励金融行业应用智能客服、智能监控等技术和装备；建立金融风险智能预警与防控系统。\n二. 主要发展阶段\n人工智能的起源：人工智能在五六十年代时正式提出，1950年，一位名叫马文·明斯基(后被人称为“人工智能之父”)的大四学生与他的同学邓恩·埃德蒙一起，建造了世界上第一台神经网络计算机。这也被看做是人工智能的一个起点。巧合的是，同样是在1950年，被称为“计算机之父”的阿兰·图灵提出了一个举世瞩目的想法——图灵测试。按照图灵的设想：如果一台机器能够与人类开展对话而不能被辨别出机器身份，那么这台机器就具有智能。而就在这一年，图灵还大胆预言了真正具备智能机器的可行性。1956年，在由达特茅斯学院举办的一次会议上，计算机专家约翰·麦卡锡提出了“人工智能”一词。后来，这被人们看做是人工智能正式诞生的标志。就在这次会议后不久，麦卡锡从达特茅斯搬到了MIT。同年，明斯基也搬到了这里，之后两人共同创建了世界上第一座人工智能实验室——MIT AI LAB实验室。值得追的是，茅斯会议正式确立了AI这一术语，并且开始从学术角度对AI展开了严肃而精专的研究。在那之后不久，最早的一批人工智能学者和技术开始涌现。达特茅斯会议被广泛认为是人工智能诞生的标志，从此人工智能走上了快速发展的道路。\n人工智能的第一次高峰：在1956年的这次会议之后，人工智能迎来了属于它的第一段Happy Time。在这段长达十余年的时间里，计算机被广泛应用于数学和自然语言领域，用来解决代数、几何和英语问题。这让很多研究学者看到了机器向人工智能发展的信心。甚至在当时，有很多学者认为：“二十年内，机器将能完成人能做到的一切。”\n人工智能第一次低谷： 70年代，人工智能进入了一段痛苦而艰难岁月。由于科研人员在人工智能的研究中对项目难度预估不足，不仅导致与美国国防高级研究计划署的合作计划失败，还让大家对人工智能的前景蒙上了一层阴影。与此同时，社会舆论的压力也开始慢慢压向人工智能这边,导致很多研究经费被转移到了其他项目上。\n在当时，人工智能面临的技术瓶颈主要是三个方面，第一,计算机性能不足，导致早期很多程序无法在人工智能领域得到应用；第二，问题的复杂性，早期人工智能程序主要是解决特定的问题，因为特定的问题对象少，复杂性低，可一旦问题上升维度，程序立马就不堪重负了；第三，数据量严重缺失，在当时不可能找到足够大的数据库来支撑程序进行深度学习，这很容易导致机器无法读取足够量的数据进行智能化。\n因此，人工智能项目停滞不前，但却让一些人有机可乘,1973年Lighthill针对英国AI研究状况的报告。批评了AI在实现“宏伟目标”上的失败。由此，人工智能遭遇了长达6年的科研深渊。\n**人工智能的崛起：**1980年，卡内基梅隆大学为数字设备公司设计了一套名为XCON的“专家系统”。这是一种，采用人工智能程序的系统，可以简单的理解为“知识库+推理机”的组合，XCON是一套具有完整专业知识和经验的计算机智能系统。这套系统在1986年之前能为公司每年节省下来超过四千美元经费。有了这种商业模式后，衍生出了像Symbolics、Lisp Machines等和IntelliCorp、Aion等这样的硬件，软件公司。在这个时期，仅专家系统产业的价值就高达5亿美元。\n人工智能第二次低谷：可怜的是，命运的车轮再一次碾过人工智能，让其回到原点。仅仅在维持了7年之后，这个曾经轰动一时的人工智能系统就宣告结束历史进程。到1987年时，苹果和IBM公司生产的台式机性能都超过了Symbolics等厂商生产的通用计算机。从此，专家系统风光不再。\n人工智能再次崛起：上世纪九十年代中期开始，随着AI技术尤其是神经网络技术的逐步发展，以及人们对AI开始抱有客观理性的认知，人工智能技术开始进入平稳发展时期。1997年5月11日，IBM的计算机系统“深蓝”战胜了国际象棋世界冠军卡斯帕罗夫，又一次在公众领域引发了现象级的AI话题讨论。这是人工智能发展的一个重要里程。\n2006年，Hinton在神经网络的深度学习领域取得突破，人类又一次看到机器赶超人类的希望,也是标志性的技术进步。\n【注】Geoffrey Hinton的论文《A fast learning algorithm for deep belief nets》链接地址\n在最近三年引爆了一场商业革命。谷歌、微软、百度等互联网巨头，还有众多的初创科技公司，纷纷加入人工智能产品的战场，掀起又一轮的智能化狂潮，而且随着技术的日趋成熟和大众的广泛接受，这一次狂潮也许会架起一座现代文明与未来文明的桥梁。\n三. 60年历程关键事件\n时至今日，人工智能发展日新月异，此刻AI已经走出实验室，离开棋盘，已通过智能客服、智能医生、智能家电等服务场景在诸多行业进行深入而广泛的应用。可以说，AI正在全面进入我们的日常生活，属于未来的力量正席卷而来。让我们来回顾下人工智能走过的曲折发展的60年历程中的一些关键事件：\n1946年，全球第一台通用计算机ENIAC诞生。它最初是为美军作战研制，每秒能完成5000次加法，400次乘法等运算。ENIAC为人工智能的研究提供了物质基础。\n1950年，艾伦·图灵提出“图灵测试”。如果电脑能在5分钟内回答由人类测试者提出的一些列问题，且其超过30%的回答让测试者误认为是人类所答，则通过测试。这边论文语言了创造出具有真正智能的机器的可能性。\n1956年，“人工智能”概念首次提出。在美国达特茅斯大学举行的一场为其两个月的讨论会上，“人工智能”概念首次被提出。\n1959年，首台工业机器人诞生。美国发明家乔治·德沃尔与约瑟夫·英格伯格发明了首台工业机器人，该机器人借助计算机读取示教存储程序和信息，发出指令控制一台多自由度的机械。它对外界环境没有感知。\n1964年，首台聊天机器人诞生。美国麻省理工学院AI实验室的约瑟夫·魏岑鲍姆教授开发了ELIZA聊天机器人，实现了计算机与人通过文本来交流。这是人工智能研究的一个重要方面。不过，它只是用符合语法的方式将问题复述一遍。\n1965年，专家系统首次亮相。美国科学家爱德华·费根鲍姆等研制出化学分析专家系统程序DENDRAL。它能够分析实验数据来判断未知化合物的分子结构。\n1968年，首台人工智能机器人诞生。美国斯坦福研究所（SRI）研发的机器人Shakey，能够自主感知、分析环境、规划行为并执行任务，可以柑橘人的指令发现并抓取积木。这种机器人拥有类似人的感觉，如触觉、听觉等。\n1970年，能够分析语义、理解语言的系统诞生。美国斯坦福大学计算机教授T·维诺格拉德开发的人机对话系统SHRDLU，能分析指令，比如理解语义、解释不明确的句子、并通过虚拟方块操作来完成任务。由于它能够正确理解语言，被视为人工智能研究的一次巨大成功。\n1976年，专家系统广泛使用。美国斯坦福大学肖特里夫等人发布的医疗咨询系统MYCIN，可用于对传染性血液病患诊断。这一时期还陆续研制出了用于生产制造、财务会计、金融等个领域的专家系统。\n1980年，专家系统商业化。美国卡耐基·梅隆大学为DEC公司制造出XCON专家系统，帮助DEC公司每年节约4000万美元左右的费用，特别是在决策方面能提供有价值的内容。\n1981年，第五代计算机项目研发。日本率先拨款支持，目标是制造出能够与人对话、翻译语言、解释图像，并能像人一样推理的机器。随后，英美等国也开始为AI和信息技术领域的研究提供大量资金。\n1984年，大百科全书（Cyc）项目。Cyc项目试图将人类拥有的所有一般性知识都输入计算机，建立一个巨型数据库，并在此基础上实现知识推理，它的目标是让人工智能的应用能够以类似人类推理的方式工作，成为人工智能领域的一个全新研发方向。\n1997年，“深蓝”战胜国际象棋世界冠军。IBM公司的国际象棋电脑深蓝DeepBlue战胜了国际象棋世界冠军卡斯帕罗夫。它的运算速度为每秒2亿步棋，并存有70万份大师对战的棋局数据，可搜寻并估计随后的12步棋。\n2011年，Watson参加智力问答节目。 IBM开发的人工智能程序“沃森”（Watson）参加了一档智力问答节目并战胜了两位人类冠军。沃森存储了2亿页数据，能够将于问题相关的关键词从看似相关的答案中抽取出来。这一人工智能程序已被IBM广泛应用于医疗诊断领域。\n2016~2017年，AlphaGo战胜围棋冠军。AlphaGo是由Google DeepMind开发的人工智能围棋程序，具有自我学习能力。它能够搜集大量围棋对弈数据和名人棋谱，学习并模仿人类下棋。DeepMind已进军医疗保健等领域。\n2017年，深度学习大热。AlphaGoZero（第四代AlphaGo）在无任何数据输入的情况下，开始自学围棋3天后便以100:0横扫了第二版本的“旧狗”，学习40天后又战胜了在人类高手看来不可企及的第三个版本“大师”。"}
