{"content2":"昨日，谷歌在上海举办了一年一度的Google中国开发者大会。在本届大会上，谷歌云首席科学家李飞飞宣布了一个重磅消息，即在北京将成立谷歌AI中国中心。对于这个即将成立的AI中心谷歌寄予厚望，希望与中国本土AI研发力量合作共同致力于人工智能领域的研究。该中心由李飞飞和 Google Cloud 研发负责人李佳博士共同领导。李飞飞将会负责中心的研究工作，也会统筹 Google Cloud AI, Google Brain 以及中国本土团队的工作。这是谷歌在亚洲的第一个AI中心。根据李飞飞教授的介绍，Google AI 中国中心的团队由目前全世界最优秀的 AI 研究员组成。除了发表自己的研究成果，Google AI 中国中心的重心也将向培养本土 AI 科研人才倾斜，开放与本土企业的合作，并且为更广大的学生及研究人员提供高质量 AI 及机器学习的教育支持。李飞飞表示：“我们很珍惜这次 Google 与中国顶尖 AI 人才合作的机会，这些人才，势必也是全球顶尖的 AI 人才。千里之行，始于足下，我们由衷希望，这将成为谷歌 AI 中国中心长期发展的第一步。在AI的世界里，中国早已觉醒，成为世界的领导者之一。我目睹了中国在AI基础研究、创业、发展等方面走到世界前列。在ImageNet图像识别大赛、Kaggle的AI编程竞技平台上以及基础科研等方面，都有巨大的成就。今天，我和团队回到中国，希望开始一段长久、真诚的工作，创造未来。这个中心将与我们在世界各地，包括纽约、多伦多、伦敦和苏黎世在内的AI研究小组一起，共同让人工智能更好地服务于全人类。‘’近年来中国投资资本纷纷涌向人工智能领域。截止目前，中国共拥有592家人工智能企业，在智能语音、自动驾驶、计算机视觉和图像处理领域有不错的发展。可以预见，未来AI行业将会为人类社会发展带来颠覆性的影响。未来在人工智能普及之后，将会有服务机器人、医疗机器人、农用背包机器人、无人农用机等自动化生产力。AI也将大量应用在翻译、助理、客服、会计、司机、家政、咨询等岗位。现在的中国市场，的确是人工智能的一片热土。自从将人工智能作为下一步的核心战略之后，百度又走起了技术流；阿里巴巴和腾讯虽然各有更加具有潜力的现金奶牛业务，但仍不愿减少对人工智能领域的投入；科大讯飞等本土初创企业的兴起，也仅仅是中国繁荣的人工智能市场的一个小小缩影。而且中国政府已经把发展人工智能作为国家的首要任务。人工智能发展形势一片大好，巨头们纷纷布局只为抢先机，而在AI这个领域中，中国互联网公司一点都不逊色美国，甚至要走的更超前一些。据中国网络招聘企业的最新报告，随着中国人工智能快速发展，AI创业潮涌现，今年第三季中国AI相关人才需求量是去年第一季的近三倍。人工智能的技术门槛很高，且难以通过短时间的学习掌握，具备学术知识以及实际操作经验的技术大牛是企业争抢的目标。知识型、技术型人才可复制性差，可替代性差，因此企业在追逐人才时通常处于被动状态，更出现高薪难求的状况。目前，全世界约有30万人掌握从无人驾驶汽车到家用机器人所需要的先进计算机科学技术，腾讯研究院在一份报告中说，全球市场对AI专家的需求在百万量级。AI的兴起被称为第四次工业革命，强大的超级计算机通过大量数据来辨识模式并自主学习，这让人们产生了失业的担忧。麦肯锡咨询公司预测，到2030年，全球可能有8亿个工作岗位随自动化的实现而消失。过去三百年轰轰烈烈的工业运动，体力劳动基本已经被取消;而近年来火爆的人工智能，则把白领的工作也要取代。人工智能在围棋方面超过人类，甚至可以写新闻，连记者这个行当也被取消。虽然人工智能已经存在很多年了，但我们今天所知道的人工智能仍处于起步阶段。围绕人工智能及其各种应用，从自动驾驶汽车到虚拟个人助理，以及其他许多需要人工智能的任务，都需要很长时间的部署与改进。人工智能还有很长的路要走。人工智能一门极富挑战性的科学，从事这项工作的人必须懂得计算机知识，心理学和哲学。人工智能是包括十分广泛的科学，它由不同的领域组成，如机器学习，计算机视觉等等，总的说来，人工智能研究的一个主要目标是使机器能够胜任一些通常需要人类智能才能完成的复杂工作。但不同的时代、不同的人对这种“复杂工作”的理解是不同的。2017年12月，人工智能入选“2017年度中国媒体十大流行语”。人工智能具有巨大意义，同时也有着巨大的商机，人类面对庞大的利益诱惑不可能停止人工智能的研究，所以，人工智能真正会走到哪步，就让时间来证实。文末福利：福利一：前端，Java，产品经理，微信小程序，Python等资源合集大放送：https://www.jianshu.com/p/e8197d4d9880福利二：微信小程序入门与实战全套详细视频教程image原文作者：祈澈姑娘原文链接：https://www.jianshu.com/u/05f416aefbe1创作不易，转载请告知90后前端妹子，爱编程，爱运营，爱折腾。坚持总结工作中遇到的技术问题，坚持记录工作中所所思所见，欢迎大家一起探讨交流。"}
