{"content2":"2018年国际消费性电子展（CES）上，最明显的一个趋势是Amazon与Google的语音技术进驻战，如AmazonAlexa进驻到Acer笔电内，Google Assist进驻到KIA汽车内，其他如智能电视、智能喇叭，乃至传统数字录放机TiVo都成为抢占进驻的对象。Google Assistant语音识别进驻大战这是一波新的抢滩战，过去Google具有PC上网的搜寻入口优势，使Google赚取庞大的广告中介收益。但上网的形式在改变，包含走动时对手机「说」、客厅躺卧时对智慧喇叭「说」、或开车时对行车计算机「说」，都要得到搜寻响应，而且是语音响应，这就成了语音识别进驻大战的开端，而且比过去的搜索引擎更激烈。搜索引擎一次还可以显现三、五个结果选项，但语音响应只能逐一念，听完前三个大概就没耐性了，所以第一个响应的答案，将更为重要。为了让自家的语音识别、认知运算、人工智能等技术更普及，Amazon与Google也推出相关套件，并尽可能平价供应给有兴趣体验的开发人员，例如2016年6月Amazon即以树莓派计算机（RPi 2 Model B）为基础搭配其Alexa软件，就可模块出Amazon Echo的效果，并进行相关开发（详细信息可参考这里）。https://aws.amazon.com/cn/blogs/china/raspberry-alexa/Google智能语音，强势出击Voice Kit去年，Google也推出开发类似的套件，称为AIY，取自人工智能的AI（Artificial Intelligence），与自己动手做的DIY（Do ItYourself）两字合并而成，意指自己动手做的人工智能套件。Google率先推出语音版本的套件，即Google AIY Voice Kit，而后也推出视觉版本的套件Google AIY Vision Kit。Google AIY或许受到Amazon的启发，所以也是以树莓派计算机为基础，再搭上必要的硬件外围与零件，构成最基本需求的语音、视觉辨识开发装置，同时也可能受到IBM发起的TJBot项目（同样是以树莓派为基础的语音识别、人工智能应用装置）所影响，追加了纸板外壳与简单的互动接口，例如会三色发光的LED灯号与按钮，但并没有TJBot的摆动手臂（用伺服马达驱动）。Google推出第一套语音版时（称为V1），所搭配使用的树莓派计算机仍是一般最普及常见的Model B（树莓派3），价格比较高，约35美元。但之后再推出的语音版及视觉版则改采了较便宜的Pi Zero W（无线版的Pi Zero），价格约10美元。无论视觉版或语音版套件都包含了树莓派在里头，也包含了树莓派所需要的MicroSD记忆卡，另外若是视觉版还额外包含了树莓派用的摄影机模块（V2版），如此语音版套件的价格约49.99美元，视觉版则为89.99美元。视觉版 VS 语音版既然视觉版与语音版有价差，那么差在何处？事实上视觉版与语音版有一些相同的配件，如三色LED灯号、按钮、GPIO接脚线路等，两版本的主要差异在于：视觉版的介接板卡（称为VisionBonnet board，语音版则称为VoiceBonnet board）上多一颗图像处理人工智能芯片，也称为VPU（Vision Processing Unit视觉处理单元），即Intel Movidius MA2450，Movidius是Intel于2016年购并的业者。视觉版MA2450可以强化视觉运算，减轻树莓派计算机的视觉运算负荷，同时还能执行神经网络的运算工作，此是视觉版要多贵出40美元的主因。当然！视觉版还有提供摄影机与摄影机上盖护镜，但同时没有语音版的喇叭，取而代之的只有简单的蜂鸣器。语音版由于语音运算明显比视觉轻量，纯耗用树莓派计算机的运算力即可，不需要额外的加速运算芯片，因而成本与订价可以低于视觉版。Vision Kit的辨识模型简介值得注意的是，视觉版有附带三套以TensorFlow为基础的神经网络模型软件：第一套是盘中物辨识，是采开放源代码的神经网络模型项目MobileNets所建构成，可辨识上千个常见的生活用品；第二套可辨识出影像中的人脸，并透过脸部表情分析目前的心情愉悦度，打出愉悦分数；第三套则可辨识影像中何者为人、何者为猫、何者为狗。此外官网还有列出其他的辨识模型，例如：辨识碗盘内放的东西为何物？辨识自然界的景物等，多数模型也是基于MobileNets所构成，但也有基于SqueezeNet所构成的模型。视觉版中也附有编译工具软件，可以在工作站或云端上，对模型进行训练、再训练等编译。至于语音版，所附的软件主要是Google Assist的软件开发工具包（SDK）与示范用应用程序（DEMO Application）。其他配套也包含Google Play应用程序商店的卖架上可以找到Google AIY Projects的手机应用程序（App），可免费下载安装使用，并搭配AIY硬件套件一起开发运用。结束语Google在最后也出一些发想题，好激发大家的人工智能开发撰写动力，例如用视觉版套件开发出能辨识各种动植物的人工智能软件，辨识正在行驶的车子是否有偏离车道？辨识您的访客是否满意您家里的节庆装饰等，这些都期望能以视觉版套件的软硬件为基础，更快完成与实现。原文参考https://mp.weixin.qq.com/s?__biz=MzU0MTg0ODIzNA==&mid=2247484725&idx=1&sn=6d53e71d6a7f0b4b8aca0d2ab253cf6a&chksm=fb22e2f0cc556be61a07a93a7ce2221d4a866eaeb6ad124c06f7f5dd6051a138c77ab692d524#rd"}
