{"content2":"“在微软，我们一直在尝试回答一个最基本的问题：智能是什么。”沈向洋博士说。\n这听上去不像是统治办公软件市场半壁江山的微软需要考虑的议题——并非如此。事实上，早在 1991 年比尔·盖茨就成立了微软研究院，以“支持长期的计算机科学硏究而不受产品周期所限”为目标，通过计算机视觉、语音和自然语言等技术的研究，尝试推动人工智能和人类智能 (Human Intelligence) 协同进步。\n而沈向洋则是微软人工智能宏图大业的领航者。他 1996 在卡内基梅隆大学完成了机器人专业的博士进修，同年加入了微软研究院，并在两年后和李开复、张亚勤、张宏江、王坚等一起，成为微软亚洲研究院创始员工——这所研究院为全球科技业贡献了大量优秀研究成果和高级人才。2007 年，功勋卓著的沈向洋博士获颁微软杰出工程师的称号；2013 年，他成为了微软的第一位华人全球执行副总裁，仅次于 CEO 的最高职位。\n在去年 9 月，微软成立了新的“人工智能和微软研究事业部” (Artificial Intelligence and Research Group，以下简称新事业部)，与微软三大 Office 事业部、Windows 和设备事业部、云计算和企业事业部同级，由沈向洋领衔。\n成立仅四个月过去，这个新事业部还相对比较神秘。人们都在讨论：微软要搞什么新武器？\n带着问题，PingWest品玩独家专访微软全球执行副总裁沈向洋博士，了解到关于新事业部的更多情况，并一起探讨了他本人以及微软公司对于人工智能的理解和期待。\n新部门的小目标：3-5 年，100 亿营收\n微软首次对外公开了新事业部的人员和工作细节。沈向洋向 PingWest品玩独家透露，为了成立新事业部，超过 5000 名工程师从 Office、云、搜索、设备等多个产品部门抽调了过来。再加上该公司遍布全球 10 个实验室超过 1000 名科学家，包括多名图灵奖、菲尔兹奖、沃尔夫奖和麦克阿瑟“天才”奖得奖学者在内，现在这个仅仅成立了 4 个月之久的新事业部，研究、产品和其他职能人员已经总计在 6000-7000 人左右。而微软全球员工总数则在 2016 年超过了 11 万人。\n在新事业部当中有着重要地位的微软研究院，已经成立了 25 年之久。在这 25 年里，微软研究院的招人的核心要求也十分简单——只要聪明，爱做学问搞研究即可。为了确保科研人员的创造性，研究院也和微软其他产品部门保持了一个相对独立但互相提供数据、技术和产品需求支持的友好关系。\n幸运的是，在新事业部成立之后，微软研究员们相对宽松自由的工作环境和要求并没有发生实质性的改变。\n“我在微软已经第 21 年了，做过很多的岗位，也是微软亚洲研究院的创始员工，一直觉得自己是一个比较传统的技术人，我以前研究做的还蛮好的……”沈向洋说，现在 AI 这个话题十分火热，而微软也已经决定要做了不起的人工智能产品和服务。“我一再对研究院的同事强调，现在成立新事业部，并没动原来研究院的运营模型。但现在我们有人工智能这个新的方向，研究院有责任，同事们挺身而出的时候到了。”\n以菲尔兹奖得主迈克·弗里德曼 (Michael Freedman) 以及另外几位学界最顶级的实验物理学家为例。他们在微软带队做拓扑量子计算的基础数学和物理研究，可以同时保留在原来大学里的研究项目和身份，又能通过微软和工业界进行理念和技术的交流，获得研究资源和额外的经验，帮助微软在量子计算方面获得优势。\n这也是近两年来工业界和学术界进行人才收购/共享的通用做法。去年年底，斯坦福人工智能实验室主任，终身教授李飞飞也是通过这种方式，在保留斯坦福教职的前提下加入到了 Google 云计算团队。微软在上周末收购了加拿大蒙特利尔的人工智能公司 Maluuba，沈向洋说收购当中重要的一点就是请到了该公司的顾问，在业界知名的深度学习专家约书亚·本吉奥 (Yoshua Bengio) ，来担任自己的顾问。\n“我们这个部门现在相对还比较小，就在三到五年内挣它个 100 亿（美元）吧！”他笑着说。\n100 亿美元的“小目标”听上去并不小。根据微软财报，在 2016 财年微软共获得 920 亿美元的收入，其中属于现金牛的云计算和企业事业部商业云业务贡献了超过 120 亿美元。沈向洋对于新事业部充满信心，“也不会停在这里，毕竟只是个小目标。新事业部很快会推出一些让人眼前一亮的东西，希望大家今年就可以看到。”\n沈向洋接受PingWest品玩独家专访 图/微软\n微软的人工智能原则：为机器赋予情感，帮我们成为更好的人类\n回到最初的问题：智能是什么？\n这个问题是所有人工智能学者在开始研究之前，甚至直到做了几十年研究都没搞清楚的问题。斯坦福大学找了 100 位在人工智能方面学界和工业界顶尖的人士组成了一个委员会 (Stanford AI100)。在“什么是人工智能”的问题上，100 位专家在今年的报告里洋洋洒洒好几页纸表自己的观点，但沈向洋说，这份报告他读完再读、又读，还是没明白人工智能到底是什么。\n他对人工智能的定义“其实很简单。就是用计算的方式，在某些人类智能的方面，让计算机逼近甚至超越它。”这些方面可能包括记忆、图像和视频的识别，语音识别等等。在他的预期中，当 5 年后计算机获得比人类更全面的语言理解能力，10 年后获得比人类更快、更准确和更全面的视觉处理能力，届时人工智能才能更好地服务人类，促进人类智能的发展。\n前不久刚从《纽约时报》离职的高级科技记者约翰·马尔科夫，曾经将计算机研究者分为两拨人：坚信机器可以取代人的人工智能派，和认为机器的永恒目的是辅助人的人机交互派。\n而据沈向洋，微软的官方态度倾向于后者：“作为人工智能研究者，我们在人工智能上的原则对于这个社会很重要，会产生很大的影响，就像有些公司会说不作恶一样。我们的原则是用更强大的机器，让我们成为更好的人类。”\n可以说直到 Siri 之前，主流人机交互普遍采用的都是图形界面，比如菜单、按钮这些元素和以触控作为交互方式，是因为计算机不能理解人类的语言，只能让人类去采用机器能够理解的交互语言。每一个菜单选项，每一个按钮，每一次触控，其实都是一次对话，这使得沈向洋开始思考：当自然语言理解技术足够强大之后，计算机交互方式是不是可以回归到最原本，最自然的对话？\n这也是微软相信对话是最自然的交互方式，将对话式人工智能 (Conversational AI) 看做下一代人机交互核心方式的原因所在，“人们每天说的话当中不一定每一句都有意义，不是每一句对话都是任务性，大量的对话是闲话甚至废话。但怎样能够通过循序渐进的闲聊，在多轮对话中学习关于用户的知识，了解情绪得到和完成任务，是微软想要解决的。”\n从这个角度上，他认为微软对人工智能的理解和大众理解应该是一致的。虽然大众担心人工智能取代和颠覆人类，但其实大众对于人工智能更普遍的理解是它是不是足够 human。而微软结合计算机视觉、语音、自然语言和知识技术开发能够理解人类情绪、识别人脸、翻译文本、回答问题的感知服务 (Cognitive Services)，以及像小冰这种具有明显人格特性的聊天机器人，都是为了向公众证明：计算机也能有同理心，有“情商”。\n图/ 微软\n作为一位从计算机视觉起步，已经研究人工智能技术 20 多年的科研人员，沈向洋认为接下来的十年很显然是人工智能的十年，“未来十年里，人工智能获得大的框架突破可能比较困难了，但在小范围内还有很大的机会。原来我们做深度学习都是要做 supervised learning（监督学习，采用标注数据）；根据我们自己的经验和观察到的情况，随着更优秀的神经网络技术来到，以后可能会更多利用未标注数据，或者即便用标注数据，需要的量也能急剧减少，这会让人工智能应用起来更加方便。这和微软‘普及人工智能全民化’ (democratize AI) 的使命吻合。”\n“这个世界里很多事情发生都并非偶然，而是建立在长期的积累上。数据多了，运算强了，再加上突破性的算法，未来的人工智能应用场景将会遍地皆是。”他说。\n以下是 PingWest品玩和沈向洋博士经过精简和编辑的采访实录：\n（PW=PingWest品玩，HS=沈向洋；专访后其他媒体加入的提问单独标注）\nPW：是什么促成了人工智能和微软研究事业部的成立？事业部有独立的商业目标吗？\nHS：25 年下来，微软研究院做出了很重要的贡献。事实上微软每一样产品力都有非常非常多研究院的技术。过去我们和产品部门相对比较独立，招人也很简单——只要聪明，进来想做什么都没问题，当然做了了不起的技术，发现了哪些产品可以被颠覆，哪些产品可以从技术重获得帮助，我们也都很鼓励。微软在全球有 10 个不同的实验室，北京和产品走得很近，其他的就不是这样。但每个实验室都走着自己的道路，每个人都做着不一样的贡献。\n人工智能是微软比较特殊的情况：包括语音、翻译、视频和图像、认知、尖端 AI 和机器人技术，大多数新技术其实都在研究院。新事业部和 Office、其他的事业部不太一样，我们之前就有自己的模式。我一再对研究院的同事强调，现在成立新事业部，并没动原来研究院的运营模型。但现在人工智能议题热得不得了，我们下定决心了要做“了不起”的人工智能产品和服务，但现在我们有人工智能这个新的方向，研究院有责任，要起到排头兵的角色，同事们挺身而出的时候到了。\n同时我也要明确的是，并不是整个研究院报告给我，我们做的东西就不给其他部门用了。研究院本身就是为了公司发展而存在，一些尖端技术，比如量子计算什么的，都在研究院。\nPW：架构调整后，对研究员的工作习惯是否有改变？新的架构是否会对他们的创造性产生制约？\nHS：我们原来研究院有 1000 多个人，又调进来 5000 多个工程师，研究院的大部分同事没有太大的变化，原来研究院的运营模型没有动。我告诉研究院的同事，正因为公司的新方向，给我们研究的同事带来了更好的机会。现在我们鼓励的是研究员把成果尽快推向市场。\n在之前的演讲中我提到，人工智能会颠覆掉很多商业应用。如果研究成果能够尽快投产，我们设计产品线就会有很大的优势。大家之后会不断地看到，我们这个新部门推出新的，让人眼前一亮的产品。\nPW：量子计算的确是一个未来十到十五年的热门领域，微软在这方面的情况如何？\nHS：我们专门成立了一个量子计算团队，已经做了十几年了。在量子计算的科研上，我们走了一条特别不一样的路，叫做拓扑量子比特 (Topological Qubit)。\nQubits 全名是 Quantom Bit，有一点像计算机的比特有 0 和 1 两种形态，但量子比特可以同时有两种形态 。我们有一个非常了不起的数学家，菲尔兹奖得主迈克·弗里德曼 (Michael Freedman) 带着团队。我们还有世界上最强的三个实验物理学家，他们是微软研究院的研究员，但我们也继续让他们在大学里学习。他们用半导或者超导材料，研究怎样长出稳定的量子比特。\n在弗里德曼数学物理的一层，上面的算法层、工程层，下面的芯片层，我们都在加大投入。今天业界连一个量子比特都做不出来，但我想接下来 2-3 年里，量子计算应该有非常振奋人心的东西分享出来，如果说小目标的话，应该是能拿诺贝尔物理学奖。\nPW：新事业部有没有一个小目标？\nHS：我们这个部门现在相对还比较小，但我自己很有信心，就在三到五年内挣它个 100 亿（美元）吧！我们公司总共九百多亿的样子吧，主要有 Office 和云业务，挣得还是比较多。我就先订个小目标吧，但也不会停在这里，毕竟是个小目标。\nPW：微软刚收购了 Maluuba，从什么时候开始计划这笔收购的？\nHS：其实挺长时间了。\n作为微软研究的负责人，我其实同时跟踪几十上百家公司。现在这么多人工智能公司你也知道，真正强的人不是很多。Maluuba 强大之处在于两个很年轻的创始人，很早就看到了深度学习这件事情，于是把公司从滑铁卢搬到蒙特利尔，跟约书亚·本吉奥 (Yoshua Bengio) 学习。Bengio 也很大方，就跟他们一起当他们的顾问。这家公司雇了十几个博士专门做深度学习的某一两个方向，而这几个方向我个人正好很感兴趣。他们主要做的是机器阅读理解。\n于是我就飞去加拿大和他们见面，也请他们来西雅图，跟 Bengio 吃饭拉拉感情什么的，这样的大师也不是出钱就能买到的。我们能收购 Maluuba，主要在于双方的目标一致。Bengio 博士就不说了，我也特别喜欢那两个年轻人。\nPW：人工智能的定义到底是什么？\nHS：刚才的演讲，我一直以为有人会问这个问题，结果居然没人问。我们在微软一直想要回答这个基本的问题：什么是智能？我认为，智能不光是 IQ，更重要的还要有情感。\n微软对人工智能的理解，和大众的理解比较一致：人工智能就是用计算的方式，在某些人类智能的方面，让计算机逼近甚至超越它。比如记忆，比如看懂物体，比如识别语音。我觉得更重要的问题是：我们微软在人工智能上应该研究什么东西？我们的技术和产品，应该怎样帮到用户？\nPW：刚才演讲你也提到了希望人工智能解决自闭症、忧郁症和老年痴呆症。微软对此有解吗？\nHS：这些都是实实在在的问题。比如患有自闭症的小孩，用普通的人类语言交流有问题。他能明白意思，但无法交流或者不愿意交流，但用符号语言，用几张图来表达。我们现在还不足够了解这种大脑中深层的情况。\n这三种病症里，老年痴呆症我们还算了解的比较多，最大的问题在于失忆。如果有一种方法，能够将很早的记忆保存下来，然后用很好的很方便的用户界面让这些记忆能够重现……我是觉得，如果我们能够做一些人工智能和脑科学方法的结合，应该比较好。\n我提这三种病症并不是说我已经有解，主要还是想鼓励我们的年轻学者和研究人员，去思考和解决这些问题。\nPW：过去一年人工智能在围棋上表现很好，高手都说几千年的看法被颠覆了。你觉得在未来，人和机器之间的关系会变成什么样，由谁来定义？\nHS：大家似乎都以为人工智能已经变成超级智能了，并不是这样。技术远远没有到那个地步。一两百年前，还需要那么多农民去耕地；现在农民变少，农民慢慢变成工人，人类的生产力极大的发展，今天有那么多人去操作机器制造东西。未来想要让全球人吃饱，或许只有三分之一的人工作就可以了。\n约翰·马尔科夫 (John Markoff) 的《与机器人共舞》(Machines with Loving Grace) 我建议你应该看一下，虽然写的比较戏剧化。他把计算机研究者分为两拨人：坚信机器可以取代人的人工智能派，他自己比较偏向人机交互派，认为机器的目的永远是辅助人。\n到底应该是计算机把所有的事情都做掉，还是人可以用计算机去做了不起的事情？这是从计算机出现第一天开始就在讨论的问题。我们把人机之间的关系定义成人机交互，而对话是我们认为更加自然和方便的交互方式。通过小冰，我们也在测试。\n刚才张钹老师说他跟小冰说话，小冰第一句就听不懂。但其实如果我们一句一句对话下去，“你不是这个意思？那你是这个意思？”她就能完全明白。我们觉得，这种对话交互式的人工智能，能够增强我们人类的交流沟通能力，让我们成为更好的人类。\n但这个使命的必经过程里，我们还有很多问题没有完全理解。比如演讲最后有个女孩子问到了计算机怎样理解情感。其实情感是人类计划的一件非常了不起的故事，如果计算机完全理性，那怎么会有情感？我们还在探索。\nPW：微软有一个 17 位优秀女性科学家对 2017 和 2027 年的期待，你对接下来十年的期待是怎样的？\nHS：我觉得毫无疑问会是人工智能的十年，当然你会说我老王卖瓜。我的理由是这个世界里很多事情发生都并非偶然，而是建立在长期的积累上。数据多了，运算强了，再加上突破性的算法，未来的人工智能应用场景将会遍地皆是。\n未来十年里，人工智能获得大的框架突破可能比较困难了，但在小范围内还有很大的机会。原来我们做深度学习都是要做 supervised learning（监督学习，采用标注数据）；根据我们自己的经验和观察到的情况，随着更优秀的神经网络技术来到，以后可能会更多利用未标注数据，或者即便用标注数据，需要的量也能急剧减少，这会让人工智能应用起来更加方便。这和微软普及人工智能全民化 (democratize AI) 的使命吻合。\nPW：你现在应该是美国科技公司地位最高的华人技术专家，走过这段路，有什么感想？\nHS：我在微软已经第 21 年了，做过很多岗位。当然，从小到大我比较喜欢做研究，一直觉得自己是一个比较传统的技术人。其实我以前做研究做的还蛮好的……\n今天有这样一个机会能够帮助公司做一些人工智能方向上的工作，是个很荣幸的事情。微软是一家十几万员工，很了不起的大公司。我也希望接下来三到五年，甚至一到两年内，给大家交出一份很好的答案。\n澎湃：AlphaGo 已经抢了这么多风头，微软怎么看？\nHS：我总是跟弟兄们讲，不要羡慕别的公司做什么。很有名的计算机学者艾伦·凯 (Alan Kay) 曾经说过，“预测未来的最佳方式就是创造未来。”\n图片来自微软\nhttp://laoyaoba.com/ss6/html/61/n-626261.html"}
