{"content2":"来源：商业电讯\n大家好，我叫赵勇，我们讨论一下人工智能。讲到人工智能，我们必须来说一下机器人。机器人其实在我们现在社会运用的比较广泛，先开始大规模应用在军事领域，然后在工业界。你们知道吗?现在机器人可以代替医生给人动手术，并且作得比人更好。接下来机器人可能会坐在驾驶员的位子上，帮我们来开车。在更遥远的未来我们可能会发现更多的机器人出现在街道上、出现在家里边，为我们服务。但是，如果这些机器人没有感知能力的话，它们就只是机器，不是机器人。所以我们必须赋予他们人工智能。\n实现这个目标我觉得必须要做好两件事，第一件事情是我们要给它们非常好的感知能力，简单的说，给它们非常好的耳朵和眼睛，让他们得到非常好的数据。在这方面其实过去这十年发生了非常大的进步，比如说在自动驾驶，以及人机交互领域，有一种特殊的传感器被成功应用，这种传感器可以探测三维的世界，通过这些传感器得到的数据不再是以前从传统相机上呈现的两维的数据格式。另外一件事情就是当数据被获取后，接下来就是去理解数据，识别数据中隐含的模式信息。那么这个就比较难了，所以我们来聊一下另外一个学科，machine learning，机器学习。\n机器学习不是一个新玩意儿，简单来说就是我们要设计一套算法机器，它可以帮我们去理解数据的意义。在过去做这个事大多都是用比较数学的方法，它包括两部分，第一部分是我们有一些非常聪明的人，他们看到这些数据的时候，能够发明一种数学的算法，把这种数据转换成高维度的数学表达，这种数学表达再结合某种统计工具，将这种结合精细地调教，把它完美地融合起来你就形成了一个体系。这个体系就可以去理解目标类型的数据。这张图片上显示了几种在图像处理领域常见的算法和统计方式。你可以看到，这些方式非常的解析。如果你要设计一个复杂的机器学习系统，就需要把很多这样的解析算法集成在一起共同实现一定的功能。这种系统基本上就是一个非常精密的仪器，它有很多零件，被我们发明出来然后集成在一起。可是这样的系统给设计者带来了很多的痛苦，因为它非常难设计，一方面这个过程需要非常聪明的算法设计者。可能今天某一个聪明的人发明了某种数学表达，用某种统计算法得到了一个结果;明天你想要超越他的话，需要某一个更聪明的人，找到了更好的算法，更好的统计工具，以及一个更好的组合，来完成超越。很多时候，这种超越需要将过去的方法推倒重来。那么这种创新的方式代价太高了，发展的速度也很慢。所以很多学者就忍不住想，人是怎么做到学习这件事情的?我们只有一个大脑，而且生物学家告诉我们，我们的大脑基本上在婴幼儿时期就已经发育得差不多了，等我们长大以后，在硬件层面上基本上没有太多空间提升我们的智能了。\n昨天有一个朋友告诉我说，他现在每天用左手刷牙，为什么呢?他听说通过这种方式可以来进一步开发他的右脑。我跟他说你来不及了，你这么作最可能的是进一步开发了你左手上的肌肉。事实是，我们用一个固定的大脑硬件可以学习很多东西。其实我们生下来大脑的硬件条件都差不多，谁也没有比谁聪明特别多。可是，我们的教育、我们的经历、我们见到的人、听到的故事，最终决定了我们变成了不同的人。\n人脑是怎样学习的?从一百多年前开始，就有科学家关注人脑。那个时候的科学家只能作到根据功能区分把人脑分成几个不同的区域，然后找到每一个区大致的功能，比如说听觉是哪儿做的，嗅觉是哪儿做的。也有科学家通过当时的显微技术去探索人脑的微观结构，尽管技术手段原始，在当时也是非常了不起的成就。然后科学家们发现，人脑里面没有CPU，也没有内存和硬盘，但是有很多微小的生物结构，我们把它叫神经元。这些神经元通过神经突触形成了复杂的网络连接。可是这个网络为什么可以工作呢?不清楚。所以我们对神经元做了一个最初级的假设。我们假设每个神经元可以进行最简单的运算，比如说一个线性运算。然后计算机科学家就根据这个原理设计了一个软件的神经网络模拟。在过去几年，科学家们惊奇地发现，当这个网络足够深，足够复杂的时候，它们产生了惊人的力量。这项技术，就是神经网络技术。在过去几年我们把这个网络做得越来越大、越来越深、越来越复杂，然后发现，他们展现了强大的学习能力。比如说，在图像识别领域，随着网络的深入，它们自动会提取出一些越来越复杂、越来越直观、越来越高级的图像特征。这些复杂的图像特征可以帮助我们把图像理解得更透彻。在过去，指望利用人脑发明的算法来稳定的检测这些高级特征的复杂度是无法想象的。然而现在一个足够深的神经网络就可以帮助我们轻松的打败最聪明的人发明的特征算法。这种奇迹不仅仅发生在图像分析领域，当我们把这项技术运用到其他领域的时候，发现它们都征服了曾经最先进的由人设计出来的特征算法。这是一个非常非常有趣的发现。\n我在这里要跟你们讲一个故事，在这张照片上显示了一个男孩，他的名字叫 Ben Underwood，他是美国加州的一个小孩。很不幸，在他两岁的时候，因为一种癌症，他的双眼不得不被摘除。从那之后他就完全没有视觉了。令人惊讶的是，从他四岁的时候，他的妈妈发现，他可以用耳朵来“看见”这个世界。他知道在什么地方可以行走;他可以通过听觉来感知桌子上的杯子具体放在哪里;他学会了骑自行车，自由地在街道上穿梭躲过那些汽车;他可以滑旱冰，很少发生事故，在滑冰的时候他可以精确地感受到路边停的车，两辆车中间有一个缝，他从这个缝钻过去。他去冲浪、他打跆拳道，他可以做很多其他盲人做不了的事情，他似乎可以真的看到这个世界。他还会打篮球，投篮还投的很准。当在一个安静环境里的时候，他的舌头就可以发出一种类似于海豚的声音，然后这种声音传出去以后，通过回波就可以做三维定位。所以科学家就觉得他非常奇怪，就请他去做研究。首先帮他检查耳朵的听力情况，发现他的听力很正常，他完全听不见正常人听不到的频率范围，他的耳朵跟正常人的耳朵是一样的。科学家们接着去观测他的脑子里发生了什么变化，他们发现当他做回声定位的时候，他大脑里原来去负责视觉的那部分神经元变得非常活跃，是这部分神经元帮他去做了回声定位这个事，这个大多数人类根本不存在的能力。回声定位，这个只存在于少数生物，比如说海豚、或者蝙蝠脑子里的功能，在Ben的大脑里原本负责视觉信号分析的那个区域实现了。也就是说，这个Ben其实他的脑子和我们正常人差不多的。同样的硬件，当失去一项功能的时候，那里面的部件可以去做另外一些全新的功能。\n在神经网络的领域里，现在就出现一个类似的现象：当我们把一个模拟的神经网络，它的规模加到一定程度的时候，这个结构就和你设计它的初衷关系不大了，只要你给它特殊的数据，只要把它教育好，它似乎可以把很多事情都做得很好。我们似乎把智能的硬件和软件分开来了。在过去，一个算法的设计需要对目标问题有极其深入的了解，需要设计针对性很强的算法和统计方法，这些模块之间必须有超强的相关性，因此开发这些方法的过程很长，人力成本也很高。深层次的神经网络技术，使得我们可以把把自己从一个设计完美算法体系的数学家，变成一个神经网络“教育者”。只要我们有足够多的数据，善于教育，然后过段时间之后，这个神经网络就会做一些事情了。就比如果我们想做一个无人驾驶汽车的项目，那我们就发明了一个神经网络，我们叫它“小王”，“小王”是一颗司机的大脑。那么我们就教他关于开车的所有的事情，经过一段时间的努力学习，“小王”就学会开车了。如果我们教小王一些证券交易知识的话，也许到时候他也会变成一个非常好的交易员。\n我曾经有一个老师，叫Hanspeter Pfister。他说我们人类对于神经元的理解太简单了，一百多年的那些照片给我们的启示太模糊。所以他就发明了一套机器，目标就是对大脑的神经网络进行高分辨率的扫描。你想象这么一个过程：给你一个大脑组织，先把脑子切成小“豆腐块”，然后呢，用非常精确的机器把它们切成非常非常薄的片。薄到什么程度呢?当科学家把这个切片放到电子显微镜下的时候，这些切片可以帮助科学家们看到神经元还有神经突触这些微观结构的连接。那么收集了很多这些图片之后呢，在三维上把这些图片垒起来，通过图像分析能够从三维空间里面重建这些生物体系的三维结构。而把这些数据扫出来之后，放在一个数据库里面，就可以供全世界的科学家们去研究人脑的奥秘。用这种方式扫描大脑产生了非常庞大的数据，以至于在一立方毫米的脑子上，扫描出来的图像数据就多达800个TB，如果你把这些数据存到DVD光盘上的话，需要20万张盘。请注意这些数据仅仅来自于一立方毫米的大脑组织，也就是大小类似于一粒盐那么丁点儿的大脑组织。当科学家们把这些数据重现出来的时候，不得不对它们进行着色，所以这些脑神经网络的图片变得五彩缤纷。下面我就要呈现给你们的照片，这些照片非常非常美丽，我建议我们现在屏住呼吸，来欣赏这些作品。\n这些照片非常漂亮，科学家们需要给这个项目起个名字。由于它们和大脑有关，所以想到了brain，又因为它们看上去五彩缤纷很像彩虹(rainbow)，所以科学家们把这个项目起名叫Brainbow。通过Brainbow这个项目，科学家们有一些很有意思的发现。首先，他们发现在一个普通人的大脑里至少拥有一千亿个神经元，每一个神经元平均拥有一千个以上的连接，通往其他的神经元。可是每一个神经元里面到底在做什么事情呢?我们现在拥有的技术还不能帮助我们在不损坏内部结构的前提下把这么微小的一个结构打开。所以这仍然是一个谜。但根据各种相关研究，科学家们发现之前人们对神经元功能的假设，例如线性运算假设，基本上都是错的。神经元完全有可能是一个非线性的操作甚至是复杂的矩阵操作。如果把每个神经元比做一个计算机的话，那么在我们这个大脑里面，有超过一千亿台计算机，这个数量超过了人类有史以来制造的计算机数目的总和。\n所以当看到这个人脑结构的时候，我被深深地震撼了。首先，它真的是个非常非常复杂的系统，我们现在最先进的科技，无论是在全世界的哪家公司里，我们无非是利用我们从脑神经科学里得到的最基本的知识，以及一些模糊的灵感去设计一套复杂程度远远低于真正人脑结构的模拟神经网络，利用大量的数据教育这些神经网络学习一些模式识别的功能。可是真正的人工智能、真正的人类智能是远远超越了模式识别这个层次的。比如说我们人脑除了重复执行一件已知的任务，我们还会创造，我们会造一系列东西，我们可以想一些过去历史中从未存在的事情，可以在一个想象的世界里的从未存在的时空中想象从未存发生过的故事。这些就是创造力和想象力。同时我们还拥有情感。我注意到，在这个世界上的生物里，越是高等的生物似乎就越有更丰富的情感。如果你问一个问题，这些情感在我们的智能体系里的功能是什么?它是一个优点还是弱点?我觉得答案是很明显的。但如果你问我另外一个问题：这些情感在人工智能里面，它帮助我们成为了这么高等的动物，在这个过程中，它是一个原因还是一个结果?或者两者都是?这个我答不上来。而且不只我们人有情感，很多动物也有情感，母子间的情感、恋人间的情感，这些情感甚至可以持续一辈子。这些层面的智能，我们现在全世界的科学家还知之甚少。所以我们今天的人工智能和我们的人类智能有着非常非常遥远的差距。\n如果让我预测singularity什么时候会发生，我无法像Ray Kurzwell先生那样做出一个精确的预测。但有一件事情我是确定的，我们现在距离这个目标还很遥远，必须仰望它。这种感觉非常非常像我们仰望宇宙。不用说整个宇宙，我们就来看一看我们的银河系吧。天文学家们现在有非常先进的射电天文望远镜，他们已经可以比较精确的观测说整个银河系大约有一千亿到四千亿颗恒星。这个规模和我们人脑的神经元规模是类似的。可是到现在，人类真正能够实地探测的范围还没有超越我们自己所在的太阳系，就好比在人脑的微观结构中我们没有能够进入到神经元微观结构中精确探索的能力。\n所以，在可以预见的未来，除了我们在探讨人工智能(AI)的奇点什么时候会到来，也许我们更应该把重点放在IA，也就是IntelligenceAugmentation，智能增强。如果我们能发明一个机器，这个机器虽然不像我们一样聪明，但他们可以忠诚地为我们服务，变成了我们的一个平行智慧：它看到我们能看到的东西，听到我们能听到的东西，他连到因特网网上，连接了人类所有的知识和智慧。我觉得这样的技术会给我们的生活带来巨大的变化和帮助。所以，奇点什么时候到来，我也说不上来，也许在很遥远的未来，但是人工智能的发展必然会给我们的世界带来非常有意义的变化。"}
