{"content2":"前言：\n说来也巧合，我在大学里加入的第一个社团就是数学建模，各种各样的社团对我没有完全没有吸引力，什么舞蹈、爱心、创业、英语等，加入数学建模的原因有二：一是可以参加比赛，二是可以认识更多的朋友，但是在加入的第四周我就完全失望了，完全没有达到我的预期，平时组织活动比较及时，但是真正给你教东西的却很少，所以从那开始我就退出了，再也没去。所以你感觉一个社团给你提供不了你当初加入的初心，那就赶紧离开吧，别再浪费时间了。之后一年里都是按部就班地上课，没有搭理社团，但是QQ通知群还是留着，直到有一天群里通知有没有人愿意参加数模大赛，虽然群里只剩下十几个人，那就报名呗，反正有专门的老师培训，之后都会在课余去参加培训，偶尔偷懒没去，之后经过平时，暑期培训参加了比赛。在比赛的时候一脸懵逼，B题题目都搞不懂，怎么做，那就选B吧，查各种资料写论文，建模，到了最后提交不了？你是在逗吗，三天的辛苦白费了？结果也就没有拿到好成绩，就这样大一结束了，大二同样参加了，也拿到了成绩，在其期间也参加了其他的比赛，比如美赛，亚太赛，数创杯等，就算是经历吧。\n总叙：\n好了，言归正传，参加了这么多关于数模比赛，到底是为什么，或者是我喜欢数学吗？不是的，我高数一般般，由于个中原因，反正没怎么听老师讲课，所以对于数学我平常心，从2016年开始，AI的兴起，让我非常感兴趣，就特地去了解了下所学的课程，结果是无论是machine larning 还是deep leraning都需要数学建模思维，也就是现在非常抢手，工资非常高的算法工程师，并且数学建模是核心点，没有很好地建模思维，那你的项目就达不到所谓的智能。\n那么数学与建模有什么联系，我们知道在大学如果要学高数必须要学习微积分，定积分，线性代数，概率论等，所以这些都是建模的基础，建模没有对错，只有better，所以基础肯定要有的，其次要会查资料，比如各种出版论文，最新的建模思维，只要熟练掌握，那么你的建模思维就会很高级，解决实际情况的方法就会很高效。我接触比较少，所以建模这块还在努力中，菜鸟一只。\n数学与数学建模：\n举个简单的列子：\n如：一个星级旅馆有150个客房，经过一段时间的经营实践，旅馆经理得到了一些数据：每间客房定价为160元时，住房率为55%，每间客房定价为140元时，住房率为65%，\n每间客房定价为120元时，住房率为75%，每间客房定价为100元时，住房率为85%。欲使旅馆每天收入最高，每间客房应如何定价？\n[简化假设]\n（1）每间客房最高定价为160元；\n（2）设随着房价的下降，住房率呈线性增长；\n（3）设旅馆每间客房定价相等。\n[建立模型]\n设y表示旅馆一天的总收入，与160元相比每间客房降低的房价为x元。由假设（2）可得，每降价1元，住房率就增加 。因此\n由\n可知\n[求解模型]\n利用二次函数求最值可得到当x=25即住房定价为135元时，y取最大值13668.75（元），\n[讨论与验证]\n（1）容易验证此收入在各种已知定价对应的收入中是最大的。如果为了便于管理，定价为140元也是可以的，因为此时它与最高收入只差18.75元。\n（2）如果定价为180元，住房率应为45%，相应的收入只有12150元，因此假设（1）是合理的。\n这便是一个简单的数学建模，在这道题中我们需要考虑的是：\n1.要做什么？\n2.怎么做？\n3.这样做合理吗？\n4.如果这样做，假设那些可以改变？\n5.这样做需要用到那些模型？\n6.这种模型简洁吗？\n7.确定了这种模型，怎么求解？\n8.求解出来了，与现实合理吗？\n9.在这个模型中，存在什么缺点，怎么去优化？\n10.总结\n差不多这十点是需要我们考虑的，也许要大量用到数学计算，甚至涉及到统计，经济学，专有软件（matlab，spass）的处理等，所以整个建模过程离不了数学知识。\n数学建模与人工智能：\n同样通过一个小例子来理解他们之间的关系：\n题目：在一个公司中，由于某些原因，有些员工渐渐离网（从公司流失），对于此，请用机器学习算法预测客户流失的一些特点，包括年龄，性别等其它因素。\n在这道题中，利用机器学习时要用到一种建模模型：决策树\n1.决策树如何构建？\n2.构建决策树\n3.生成决策树\n4.利用ID3算法实现function\n5.集成学习\n6.然后利用PAI算法执行\n7.分析效果\n8.总结\n不难发现通过这复杂的八步就完美提供了解决方案，完成项目需求，而这八步都需要扎实的建模思维，要不然几乎没办法做，所以数学建模对于人工智能算法非常关键。\n再者比如最新的滴滴Di-Tech算法大赛：\n问题是：对无人驾驶车而言，最重要的是能够理解周围环境并做出相应决策，保证行车安全。参赛者需要努力找到通过摄像头和 LIDAR 数据检测道路上的障碍物的最好方法。最终的系统应该能够识别行人、车辆和普通障碍物，对人类驾驶员和无人驾驶系统都有很大帮助。参赛者需要处理 LIDAR、RADAR及摄像头原始数据，输出障碍物位置、移除噪音和环境错误检测。参赛者可以利用已经较为完善的 Kitti 数据集，在现有技术的基础上，加入自己的新方法和手段，来让算法获得更好表现。\n不难发现无论是怎样的安全措施，数据分析，算法处理，都需要建模思维各个方面考虑，完美的建模便是最好的答案。\n所以学习人工智能，数学建模是必须的，很难，但要坚持！\n2017的最后一个月，大家努力！\n2017-12-01"}
