{"content2":"http://blog.csdn.net/landsuper/article/details/5720581ICCV的全称是International Comference on Computer Vision，正如很多和他一样的名字的会议一行，这样最朴实的名字的会议，通常也是这方面最nb的会议。ICCV两年一次，与ECCV正好错开，是公认 的三个会议中级别最高的。它的举办地方会在世界各地选，上次是在北京，下次在巴西，2009在日本。iccv上的文章看起来一般都比较好懂，我是比较喜欢 的。CVPR的全称是Internaltional Conference on Computer Vision and Pattern Recogintion。这是一个一年一次的会议，举办地从来没有出过美国，因此想去美国旅游的同学不要错过。正如它的名字一样，这个会上除了视觉的文 章，还会有不少模式识别的文章，当然两方面的结合自然也是重点。ECCV的全称是Europeon Conference on Computer Vision，是一个欧洲的会议。虽然名字不是International，但是会议的级别不比前面两个差多少。欧洲人一般比较看中理论，但是从最近一次 会议来看，似乎大家也开始注重应用了，oral里面的demo非常之多，演示效果很好，让人赏心悦目、叹为观止。不过欧洲的会有一个不好，就是他们的人通 常英语口音很重，有些人甚至不太会说英文，所以开会和交流的时候，稍微有些费劲。总的来说，以上三个会议是做计算机视觉人必须关注的会议，建议每一 期的oral都要精读，poster调自己相关的仔细看看。如果有好的进一步的想法，可以马上发表，因为他们已经是最新的了，对他们的改进通常也是最新 的。同时如果你做了类似的工作，却没有引用这些会议的文章，很有可能会被人指出综述部分的问题，因为评审的人一般都是牛人，对这三个会议也会很关注的。计算机视觉、IP、AI方向的一些顶级会议和期刊Computer VisionConf.:Best: ICCV, Inter. Conf. on Computer VisionCVPR, Inter. Conf. on Computer Vision and Pattern RecognitionGood: ECCV, Euro. Conf. on Comp. VisionICIP, Inter. Conf. on Image ProcessingICPR, Inter. Conf. on Pattern RecognitionACCV, Asia Conf. on Comp. VisionJour.:Best: PAMI, IEEE Trans. on Patt. Analysis and Machine IntelligenceIJCV, Inter. Jour. on Comp. VisionGood: CVIU, Computer Vision and Image UnderstandingPR,   Pattern Reco.NetworkConf.:ACM/SigCOMM ACM Special Interest Group of Communication..ACM/SigMetric   这个系统方面也有不少的Info Com 几百人的大会，不如ACM/SIG的精。Globe Com 这个就很一般了，不过有时候会有一些新的想法提出来。Jour.:ToN (ACM/IEEE Transaction on Network)A.I.Conf.:AAAI: American Association for Artificial IntelligenceACM/SigIR: 这个是IR方面的，可能DB/AI的人都有IJCAI: International Joint Conference on Artificial IntelligenceNIPS: Neural Information Processing SystemsICML: International Conference on Machine LearningJour.:Machine LearningNEURAL COMPUTATION: 这个的影响因子在AI里最高，2000年为1.921ARTIFICIAL INTELLIGENCE: 1.683(2000年的数据，下同)PAMI: 1.668IEEE TRANSACTIONS ON FUZZY SYSTEMS: 1.597IEEE TRANSACTIONS ON NEURAL NETWORKS: 1.395AI MAGAZINE: 1.044NEURAL NETWORKS: 1.019PATTERN RECOGNITION: 0.781IMAGE AND VISION COMPUTING: 0.616IEEE TRANSACTIONS ON KNOWLEDGE AND DATA ENGINEERING: 0.465APPLIED INTELLIGENCE: 0.268OS,SystemConf.:SOSP: The ACM Symposium on Operating Systems Principles(2年一次，想中一篇太难了)OSDI: USENIX Symposium on Operating Systems Design and ImplementationDatabaseConf.:ACM SIGMODVLDB:International Conference on Very Large Data BasesICDE:International Conference on Data Engineering//这三个会议并称为数据库方向的三大顶级会议SecurityConf.:IEEE Security and PrivacyCCS: ACM Computer and Communications SecurityNDSS (Network and Distributed Systems Security)WebConf.:WWW(International World Wide Web Conference)TheoryConf.:STOCFOCSEDAConf.:Best:DAC: IEEE/ACM Design Automation ConferenceICCAD: IEEE International Conference on Computer Aided DesignGood:ISCAS: IEEE International Symposium on Circuits And SystemsISPD: IEEE International Symposium on Physical DesignICCD: IEEE International Conference on Computer DesignASP-DAC: European Design Automation ConferenceE-DAC: Asia and South Pacific Design Automation Conference备注：x-DAC有很多，是地区性最高级DAC会议，上面两个影响最广。而且每年收录的论文大部分还是来自美国大学/研究所。GraphicsConf.:Best:Siggraph: ACM SigGraphGood:Euro GraphJour.:IEEE(ACM) Trans. on GraphicsIEEE Trans. on Visualization and Computer GraphicsCADJour.:CADCAGDSEconf.:ICSE    The International Conference on Software EngineeringFSE     The Foundations of Software Engineering ConferencesICASE   IEEE International Conference on Automated Software EngineeringCOMPSAC International Computer Software and Applications ConferencesESEC    The European Software Engineering ConferencesJour.:SEN     ACM SIGSOFT Software Engineering NotesTSE     IEEE Transactions on Software EngineeringASE     Automated Software EngineeringSPE     Software-Practice and Experience部分ai刊物影响因子05 SCI IF2005      2004JMLR    4.027     5.952PAMI    3.810     4.352TOIS    4.529     4.097AIJ     2.638     3.570MLJ     3.108     3.258ECJ     1.568     3.206TEvC    3.257     3.688IJCV    3.657     2.914DMKD    2.105     2.800NCJ     2.591     2.364TNN     2.205     2.178PR      2.153     2.176Alife   1.857     2.150JASIST 1.583     2.086JAIR    2.247     2.045CIJ     0.850     1.923NNJ     1.665     1.736TFS     1.701     1.373TKDE    1.758     1.243IRJ     2.036     1.231AIIM    1.882     1.124TSMCB   1.108     1.052AICom   0.612     0.738AIRev   0.868     0.562"}
