{"content2":"计算机视觉在工业方面的应用分类：            计算机视觉随想杂谈2011-09-21 14:17188人阅读评论(0)收藏举报videoprintingimagesystemclassificationvisualizationhttp://www.cs.ubc.ca/~lowe/vision.html本人是计算机视觉方向的研究生，偶然发现这个网页，列举了一些计算机视觉在工业上的应用，觉得比较受用，拿来分享。原网址见上面连接。Automobile driver assistanceIteris (Santa Ana, California). Lane departure and collision warning systems for trucks and cars. Used in over 100,000 vehicles (2009). Also creates traffic monitoring systems.MobilEye (Jerusalem, Israel). Vision systems that warn automobile drivers of danger, provide adaptive cruise control, and give driver assistance.Eye and Head TrackingMirametrix (Montreal, Quebec). Free-head eye-tracker using computer vision technologies.Smart Eye (Göteborg, Sweden). Systems to track eye and gaze position. Applications include detection of drowsiness or inattention in drivers.SMI (Berlin, Germany). Eye and gaze tracking systems.Film and Video: Sports analysisHawkeye (Winchester, UK). Uses multiple cameras to provide precise tracking in tennis, cricket, and other sports for refereeing and commentary.LiberoVision (Zurich, Switzerland). Creates photorealistic 3D visualization of sporting events for sports broadcasting and analysis.QuesTec (Deer Park, New York). Systems for tracking sports action to provide enhanced broadcasts.Red Bee Media (London, UK). Develops Piero system for sports analysis and augmentation.Amisco (Nice, France). Systems for tracking sports players and the ball in real time, using some human assistance.Sportvision (New York, NY). Vision systems to provide real-time graphics augmentaion for sports broadcasts.Film and Video2d3 (Oxford, UK). Systems for tracking objects in video or film and solving for 3D motion to allow for precise augmentation with 3D computer graphics.Image Metrics (Manchester, England). A markerless tracking system for the human face that can be used to map detailed motion and facial expressions to synthetic characters.Imagineer Systems (Guildford, UK). Computer vision software for the film and video industries.MirriAd (London, UK). Uses computer vision methods to track consistent regions in video and insert virtual advertising.Mova (San Francisco, California). Provides 3D tracking of points on the human face or other surfaces for character annimation. Uses invisible phosphorescent makeup to provide a random texture for stereo matching.Orad (Kfar Saba, Israel). Systems for creating virtual television sets, sports analysis, and other applications of real-time augmented reality.Ooyala (Mountain View, California). Video content management and delivery, including object identification and tracking.VideoSurf (San Mateo, California) Uses computer vision to search and classify online video.Games and Gesture RecognitionGestureTek (Toronto, Canada). Tracks human gestures for playing grames or interacting with computers.Microsoft Kinect (Redmond, Washington). Provides motion sensing and gesture recogntion for the Xbox gaming system. Creates 3D depth maps and registed images in real time using projected infrared light patterns and a single camera. Sold over 8 million units in the first 60 days, which makes it the fastest selling consumer electronics device (Wikipedia).Reactrix (Redwood City, California). Interactive advertising for projected displays that tracks human gestures.Sony EyeToy uses computer vision to track the hand and body motions of players to control the Sony Playstation. Sales were over 10 million units by 2008.(Wikipedia)General purpose vision systemsCognex (Natick, Massachusetts) is one of the largest machine vision companies (800 employees, 2010). Develops systems for inspection and localization tasks, people counting, and many other areas.(Hoover's)Evolution Robotics (Pasadena, California). Vision systems for object recognition and navigation. Applications include mobile robotics and grocery retail. Develops integrated vision and navigation solutions for household robots.Matrox Imaging (Dorval, Quebec, Canada). Software and hardware for machine vision applications.National Instruments (Austin, Texas). Vision software and systems used for many applications, including inspection, biomedical, and security.Neptec (Ottawa, Canada). Laser-based 3D vision systems for use on the space shuttles and other applications.Newton Research Labs (Renton, Washington). Vision systems for high-speed tracking and mobile robots.Point Grey Research (Vancouver, Canada). Real-time stereo vision systems, spherical vision systems, and imaging hardware.Sarnoff (Princeton, New Jersey). Vision systems for tracking, registration, navigation, biometrics, and other applications.Seeing Machines (Canberra, Australia). Systems for tracking head position and eye gaze direction.Soliton (Bangalore, India). Smart cameras for industrial inspection and other applications.SpikeNet (Toulouse, France). Trainable vision systems for performing recognition.Supercomputing Systems (Zurich, Switzerland). Developed the leanXcam, a low-cost intelligent camera using open source software.TYZX (Menlo Park, California). Produces real-time stereo vision systems that use a custom chip for fast stereo matching.ViSSee (Lugano, Switzerland). Developing a low-cost real-time sensor for measuring speed using an approach modeled on vision in the fruit fly.VISIONx (Pointe-Claire, Quebec, Canada). Vision systems for high accuracy measurement and other applications.Vitronic (Wiesbaden, Germany). Vision systems for inspection, manufacturing, logistics, traffic management, and other applications.Industrial automation and inspection: Automotive industryCogniTens (Ramat-Hasharon, Israel). Has developed a system for accurate scanning of 3D objects for the automotive and other industries. The system uses a 4-camera head with projection of textured illumination to enable accurate stereo matching.Perceptron (Plymouth, Michigan). Creates 3D laser scanning systems for automotive and other applications.Industrial automation and inspection: Electronics industryKLA-Tencor (San Jose, California). Systems for inspection and process control in semiconductor manufacturing.Orbotech (Yavne, Israel). Automated inspection systems for printed circuit boards and flat panel displays.(Hoover's)Industrial automation and inspection: Food and agricultureMontrose Technologies (Ottawa, Canada). Vision systems for the baked goods industry. Systems monitor bake color, shape, and size of bread, cookies, tortillas, etc.Ellips (Eindhoven, The Netherlands). Vision systems for inspecting and grading fruits and vegetables.Industrial automation and inspection: Printing and textilesAdvanced Vision Technology (Hod Hasharon, Israel). Systems to inspect output from high-speed printing presses.Elbit Vision Systems Ltd. (Yoqneam, Israel). Vision systems for textile inspection and other applications.Mnemonics (Mt. Laurel, New Jersey). Vision systems for print quality inspection and other applications.Xiris Automation (Burlington, Ontario, Canada). Inspection for the printing and packaging industries.Industrial automation and inspection: OtherAdept (Pleasanton, California). Industrial robots with vision for part placement and inspection.Avalon Vision Solutions (Lithia Springs, Georgia). Vision systems for the plastics industry.Basler (Ahrensburg, Germany). Inspection systems for optical media, sealants, displays, and other industries.Hermary Opto Electronics (Coquitlam, BC, Canada). Develops 3D scanners for sawmills and other applications.JLI vision (Soborg, Denmark). Vision systems for industrial inspection tasks, including food processing, glassware, medical devices, and the steel industry.LMI Technologies (Vancouver, Canada). Develops 3D vision systems using laser sensors for inspection of wood products, roads, automotive manufacturing, and other areas.MVTec (Munich, Germany). Vision systems for inspection and other applications.NeuroCheck GmbH (Remseck, Germany). Inspection systems for quality control.PPT Vision (Eden Prairie, Minnesota). Vision systems for automotive, pharmaceutical, electronics, and other industries.Seegrid (Pittsburgh, PA). Industrial mobile robots that use vision for mapping and navigation.SIGHTech (San Jose, California). Trainable computer vision systems for inspection and automation.Virtek Vision International (Waterloo, Ontario, Canada). Laser-based inspection and templating systems.Wintriss Engineering (San Diego, California). Vision systems for suface inspection and sports vision applications.Medical and biomedicalClaron Technology (Toronto, Canada). Uses real-time stereo vision to detect and track the pose of markers for surgical applications.Noesis (St. Laurent, Quebec, Canada). Software for biomedical and other scientific image analysis.Object Recogntion for Mobile DevicesKooaba (Zurich, Switzerland). Visual search for smartphones, photo management, and other applications.SnapTell (Palo Alto, California). Image recognition and product search for camera phones. Owned by Amazon A9.Panoramic PhotographyCloudburst Research (Vancouver, Canada). Develops AutoStitch Panorama, which provides fully automated image stitching for the iPhone platform (disclosure: the author of this list is a founder of the company).HumanEyes (Jerusalem, Israel). Develops software for creating 3D stereo views, including stereo mosaicing.Kolor (Challes les eaux, France). Develops the Autopano Pro software for automated panorama stitching of digital images. Also provides high-dynamic-range imaging by combining multiple exposures.People trackingBrickstream (Atlanta, GA). Tracking people within stores for sales, marketing, and security.Reveal (Auckland, New Zealand). Systems for counting and tracking pedestrians using overhead cameras.VideoMining (State College, PA). Tracking people in stores to improve marketing and service.Safety monitoringMG International (Boulogne, France). The Poseidon System monitors swimming pools to warn of accidents and drowning victims.Security and BiometricsAimetis (Waterloo, Ontario, Canada). Systems for intelligent video surveillance.Aurora (Northampton, UK). Systems for biometric face recognition.AuthenTec (Melbourne, Florida). Fingerprint recognition systems with a novel sensor.Briefcam (Jerusalem, Israel). Develops software for summarization of long surveillance video in a short summary video.Cernium (Reston, Virginia). Systems for behavior recognition in real-time video surveillance.Digital Persona (Redwood City, California). Fingerprint recognition systems.EVITECH (Paris, France). Smart video surveillance systems.Equinox (New York, NY). Security systems using novel sensors, such as registered visible and thermal infrared images and use of polarized lighting.Genetec (Montreal, Canada). Security systems for license plate recognition, surveillance, and access control.Honeywell (Morristown, New Jersey). Range of video surveillance systems and analysis software.Imagemetry (Prague, Czech Republic). Image processing and computer vision for image forensics.IntelliVision (San Jose, California). Automated monitoring systems, including face and object recognition.L-1 Identity Solutions (Stamford, Connecticut). Fingerprint, iris, and face recognition systems as well as other security applications.(Hoover's)ObjectVideo (Reston, Virginia). Automated video surveillance products for tracking, classification, and activity recognition.Viion Systems (Montreal, Canada). Detection and identification of computer users.Vitamin D (Menlo Park, California). Detection and monitoring of people in video streams.Three-dimensional modelingCreative Dimension Software (Guildford, UK). Creates 3D models from a set of images. Objects are imaged on a calibration mat.Eos Systems (Vancouver, Canada). PhotoModeler software allows creation of texture-mapped 3-D models from a small number of photographs. Also provides accurate photogrammetric 3D measurements from multiple images of a scene.Creaform (Quebec City, Canada). Develops 3D scanners for the human body and other applications.Traffic and road managementImage Sensing Systems (St. Paul, Minnesota). Created the Autoscope system that uses roadside video cameras for real-time traffic management. Over 100,000 cameras are in use.Yotta (Leamington Spa, UK). Imaging and scanning solutions for road network surveying.Web ApplicationsFace.com (Tel Aviv, Israel). Image retrieval based on face recognition.Incogna (Ottawa, Canada). Develops a system for image search on the web. Uses GPUs for increased performance.LTU Technologies (Paris, France). Image retrieval based on content.Photometria (San Diego, California). Virtual makeover website,TAAZ.com uses computer vision methods to allow users to try on makeup, hair styles, sunglasses, and jewelery"}
