{"content2":"深度 | AI芯片终极之战https://mp.weixin.qq.com/s?__biz=MzA4MTQ4NjQzMw==&mid=2652712307&idx=1&sn=28806ccb69a5f5d1142ac5f79ccde395&chksm=847dba7db30a336bfde664a5f2b75fdc443ac541483542eada358f298965614f60e3faaecf7e&scene=21#wechat_redirect2018-03-05 发布看点：解读AI芯片四大门派“少林、武当、五岳、明教”，看芯片与人工智能如何重塑世界。2015年的秋天，北京的雨水比往年要多些，温度却不算太冷。这一年里，年仅23岁的姚颂刚刚拿到清华大学的毕业证书；32岁的陈天石博士毕业后已在中科院计算所待了整整8年；而在芯片界摸爬滚打了14年的老将何云鹏却毅然辞掉了长虹芯片高管的职位，华丽创业转身。2015年的秋天，在大洋的另一端，英伟达的股价还在20多美元徘徊，谷歌公司内部却开始秘密地用上了TPU芯片；在彼岸的中国市场里，百度研究院两位高管：副院长余凯与异构计算团队负责人吴韧陆续离职，成立了两家芯片公司——地平线与异构智能。2015年的秋天，比特币虽然开始逐渐回暖，但依旧持续在200美元的低迷状态，日后的世界第一大矿机芯片生产商比特大陆除了不断迭代矿机产品，还悄然规划起了另一条人工智能产品线。比特大陆联席CEO詹克团那年36岁，话不多，爱看历史、哲学、科幻——比如科幻小说《三体》。谁也没有想到，就在短短两年多以后，这些人的生命会共同被卷入一场前所未有的科技洪流当中——人工智能专用芯片（AI芯片）——而与他们一同的，还有其他成百上千位前沿技术领域最顶尖的优秀人才。他们其中既有一路保送仅仅24岁就博士毕业的少年天才、也有在业内叱咤风云数十年的行业泰斗；既有成立仅一年公司估值就超过10亿人民币的创业神话、也有市值高达8000亿美元、全球坐二望一的科技霸主。经ZDX初步测算，仅国内AI芯片头部创业公司的融资金额就已超过了20亿人民币。而根据中信证券测算，2020年全球AI芯片的市场规模可达146.16亿美元。人工智能这一项新兴技术，在经历了最近几年的技术积累、升级、发酵之后，正在以AI芯片作为载体而全面崛起。AI芯片正在以一种前所未有的速度颠覆着以安防、手机、无人驾驶汽车、云计算等为首的四大领域，并从它们延展开来，进一步对工业、制造、医疗、教育等传统领域造成巨大冲击，重新塑造着世界格局。据ZDX报道了解得知，目前全球至少有45家初创公司正在研发语音交互和自动驾驶芯片，并且至少有5家企业已经获得超过1亿美元的融资，这一数目还在不断增加当中。回望中国市场，人工智能与AI芯片技术为中国市场这几十年来埋头追赶的芯片行业打开了一扇新大门，让我国第一次拥有傲立世界前沿科技之林、甚至引领全球科技潮流的机会窗口。在这个市场中，资本是最快响应起来的。在动辄融资上亿美元融资的催化之下，中国市场AI芯片创业市场尤为兴盛，除了融资独角兽层出不穷外，各大创业公司也根据自身特点陆续形成了四大派系，我们可以用武林几大门派来做形象的比喻——“少林、武当、五岳、明教”，这四大派系的玩家们各有特色，神通尽显。相比起来，海外各大巨头也不遑多让。就在大约20天前，当整个中国都沉浸在农历春节的团圆氛围当中时，大洋彼岸科技巨头谷歌突然宣布，其AI芯片“TPU”的强大计算能力将向民众开放——这块TPU的来头可不小，谷歌的AI程序AlphaGo（阿尔法狗）就是靠它提供的强大计算能力战胜了全球围棋第一高手，柯洁。恰恰就在同一天，那个一直以线上书店而广为人知的科技巨头亚马逊，也被曝出正在为其爆款产品——智能音箱Echo——打造专用AI芯片，该项目研发团队已有449名员工。ZDX历经半年，深入业内，首次对AI芯片全产业链上下近百家核心企业进行报道，覆盖国内外各大巨头玩家、新兴创企、场景应用、代工生产等，全面深入地对芯片产业发展、创新创业进行了追踪报道，由此也促成了ZDX举办的国内首创AI芯片创新峰会。此为ZDX AI芯片产业系列的重磅报道之一，通过对AI芯片最热的四大应用行业与各大入场行业玩家的拆解，全景式地解构了AI芯片产业链面貌。四大商业场景面临颠覆AI芯片之于人工智能的意义，则可以理解为发动机之于汽车。人工智能这一理论已经提出了多年，但是由于实现它需要的计算量实在太大，这辆“跑车”一直没有配备上合适的“发动机”，只能放在仓库积灰。直到AI算法和大数据时代的到来、以及AI芯片的出现。广义来说，能够驱动AI程序的芯片，都能叫做AI芯片。不过本文特指已经为AI算法进行了特殊设计的芯片。按照应用场景，AI芯片可以简单地分为用于云端服务器机房等地的云AI芯片，以及用于端智能设备、IoT设备的终端AI芯片。云AI芯片的特点是性能强大、能够同时支持大量运算、并且能够灵活地支持图片、语音、视频等不同AI应用。我们现在使用的各种互联网AI能力（比如在线翻译、人证比对），背后都有云AI芯片在发挥作用或提供算力。端AI芯片则需要嵌入到设备内部，让设备不需要联网就能具备AI能力。它们的特点是体积小、耗电少，而且性能不需要特别强大，通常只需要支持一两种AI能力。现在手机里的芯片、摄像头里的芯片、甚至你家电饭煲里的芯片都开始陆续AI化。全球GPU霸主英伟（NVIDIA）创始人黄仁勋曾经向ZDX说过，未来，AI与AI芯片将会无处不在：咖啡机、保温杯、麦克风、甚至耳环、鞋子这些小物件都会智能化。目前，AI芯片有四个最为火热的商业应用场景——家居/消费电子、安防监控、自动驾驶汽车、以及云计算。1）家居/消费电子——悄然入侵你家，润物细无声我们先从离我们生活最近的家居/消费电子说起。2017年9月，华为发布了世界首款手机AI芯片麒麟970，打响了AI芯片入侵手机的第一枪。10月，搭载这块AI芯片的华为Mate 10和Mate 10 Pro正式面世。这款麒麟970 AI芯片中搭载了一个专门用于处理AI的模块——NPU（神经网络处理单元），其技术来源于国内AI芯片创企中科寒武纪。这块NPU的计算速度比CPU快了25倍，同时还将能耗效率将提高了50倍。这款AI芯片不仅能够让你的手机能够照相更好看、翻译更流畅、语音识别更准确外，还能学习理解你的使用习惯，让手机自动释放内存，更快更流畅。在围绕华为Mate 10和麒麟970芯片进行的一系列独家深入采访中，华为无线终端芯片业务部总监Eric曾经告诉ZDX，未来AI将会是芯片中的一个基础技术，可能到了明年（2018年），每家芯片公司都会有这个能力。（18个月，华为AI手机涅槃诞生记）事实证明，他说的没错。就在麒麟970发布的短短两周后，9月13日，苹果发布十周年纪念款iPhone X，搭载自研的AI芯片A11，这块芯片不仅让iPhone X用起来更快更流畅，还能让iPhone X支持人脸识别解锁（FaceID）、人脸识别付款、照片自动分类、以及实时表情跟踪Animoji等功能。在今年春节年廿九（2月14日）当天，老牌芯片公司ARM正式宣布推出两款针对移动端的AI芯片架构：物体检测处理器和机器学习处理器。这事的重要性绝对不容小觑——要知道，目前全世界超过90%的手机芯片采用的是ARM的架构，连麒麟970和苹果A11都不例外。而在刚刚结束的MWC2018上，中端手机芯片巨头联发科发布了新款手机芯片Helio P60，支持AI和计算机视觉，能够提供精确的人脸识别等功能。而高端手机芯片巨头高通则在今年2月22日宣布推出基于其枭龙芯片系列的人工智能引擎（AI Engine），将高通手机SoC当中的所有软、硬件AI计算能力打包到这个引擎里，让人工智能在手机上的应用更快速、高效。这一系列风起云涌的新品发布证明，手机已然成为AI芯片市场红海战局的重要组成部分。不过除了手机之外，你日常使用的众多家用电子产品也在悄无声息地进行着AI升级，主要围绕语音AI展开，代表玩家包括亚马逊打造Echo智能音箱AI芯片、启英泰伦打造的家用电器语音AI芯片、杭州国芯打造语音AI芯片等等。联发科技副总经理暨智能设备事业群总经理向东西表示，2018年全球智能音箱市场预计将突破6000万大关，而在这6000万里面，也将会有越来越多的音箱产品搭载AI芯片。2）安防摄像头——被所有AI芯片玩家看好的大火市场随着市场经济的快速发展、技术的不断成熟、再加之国家政策的推动，中国安防产业的规模也在不断增长。根据佳都科技《人工智能技术白皮》显示，2017年安防市场规模将已经超过了6350亿，同比增长17.6%。安防市场规模不断增长的同时，意味着以摄像头为主的安防设备数量增加（最近一年内，国内安防高清摄像头的出货量会在1亿颗左右），人眼监控已经看不过来了；再加之社会对安保要求的提升，安防产业越发重视事前预警，传统的人工审查方式已经远不足以满足产业需求，安防要求的是机器独立实时监控、实时报警。由于AI能够对迅速对视频进行结构化处理，对人、车、物进行快速识别比对，机器不仅能认出逃犯、嫌疑人，还能记录分析他的实时位置，此类能力与公安、交警、民防等需求不谋而合。毫不夸张地说，现在几乎所有AI芯片创业公司都将安防作为核心应用场景之一，纷纷推出内嵌于安防监控摄像头的AI芯片，成亿的研发资金砸向这块，称安防AI芯片为“当红炸子鸡”丝毫不为过。此外，几个安防行业老牌巨头也在蠢蠢欲动着。安防是个集中度很高的传统行业，海康威视、大华股份、宇视科技这三大行业巨头加起来已经占了安放领域的半壁江山。这些安防巨头们有着积累深厚的行业经验，不仅是众多AI芯片公司的合作伙伴，其自身也在推进AI+安防的步伐。举个例子，宇视科技在AI+安防领域已经发布了一整套AI整体解决方案，涉及嵌入了GPU芯片的前端智能摄像机、人脸识别速通门、后端数据中心一体机等。不过宇视首席架构师姚华向ZDX提到，与AI初创不同，宇视这类传统安防企业除了研发AI技术外，还需要重点关注这一技术的工程化和落地性，比如用户机房耗电量、发热量等工程性问题。安防AI化的全面铺开并没有那么容易。而在发改委的2018年“互联网+”、人工智能创新发展和数字经济试点重大工程拟支持项目名单上，海康海康威视的“计算机视觉AI芯片研发及产业化项目”赫然纸上。3）自动驾驶汽车——三大AI芯片势力，推动无人车商用落地根据美国交通部的分类标准，自动驾驶汽车可以分为五个等级：L1-L5，L1驾驶辅助、L2部分自动化、L3有条件自动化、L4高度自动化、L5完全自动化（完全自动化也就是不需要司机，车子可以自己走），这也是业内普遍比较认可的分类方法。由于需要对环境进行感知、进而决策，因此L3-L5级别的自动驾驶技术对计算平台的要求越来越高，对AI芯片的需求也越来越强烈。目前，AI芯片正在成为自动驾驶计算平台的核心组成部分，由英伟达、英特尔这样的芯片巨头，和地平线这样的创业公司整合成为自动驾驶计算平台，提供给整车厂和Tier-1（一级供应商）汽车配件商巨头，落地到自动驾驶解决方案当中。目前看来有三股势力：1、英伟达的Xavier计算平台（前身是Drive PX），这一计算平台正在被超过20家自动驾驶创业公司，以及博世、采埃孚等供应商巨头采用，打造各自的自动驾驶。其中最接近量产商用的是采埃孚Pro AI方案。2、英特尔GO计算平台（由英特尔CPU、英特尔收购的Mobileye EyeQ芯片、英特尔收购的Altera FPGA处理器）被整车厂宝马、意大利FCA、以及供应商巨头德国大陆、加拿大麦格纳、德尔福（后拆分出安波福）、都陆续采用其打造为自动驾驶解决方案。其中英特尔、宝马、大陆等还牵头成立了自动驾驶联盟。3、以地平线为代表的创业公司正在打造自己的自动驾驶计算平台。地平线的雨果自动驾驶平台早期使用的是英特尔FPGA处理器，后打造自研BUP架构，并推出沿用这一架构的AI芯片“征程”。此外ZDX了解到，由于汽车自动驾驶行业巨大，不少第一阵营的AI芯片创业公司也秘密瞄准了这一领域。无论是上述何种自动驾驶计算平台，AI芯片都是其中的关键组成部分，也是自动驾驶技术发展的主要推动力。博世，作为汽车Tier-1领头玩家，将在2018年实现L2级别自动驾驶实用、2021年完成L3商用。博世底盘控制系统中国区驾驶员辅助系统雷达研发部门总监蔡旌向ZDX表示，博世正在与众多自动驾驶计算平台供应商合作探索，其中既有巨头，又有初创公司。博世对自动驾驶计算平台在功耗、成本上有较高要求。对于自动驾驶需要的计算平台，博世与较多供应商正在合作探索，其中既有巨头，又有初创公司。博世对自动驾驶计算平台在功耗、成本上有较高要求，未来博世的选择将会是嵌入式的计算平台。自动驾驶初创企业智行者CEO张德兆也曾向ZDX表示，自动驾驶技术离普及还有待时日，因此创业公司在进行技术研发的同时也要着力于技术的落地与商业变现。而且无人车虽然需要较强的算力，但成本、功耗与量产都是需要考虑的元素。4）云计算——为互联网AI供能，高效灵活无论上微博还是点外卖，我们现在使用所有互联网应用，背后都是云服务数据机房在提供计算能力。而我们现在使用的各种互联网AI能力（比如在线翻译、人证比对、图片搜索等），背后都有云AI芯片在庞大的数据中心机房中日夜不停地提供算力。上文提到，云AI芯片的特点是性能强大、能够同时支持大量运算、并且能够灵活地支持图片、语音、视频等不同AI应用。这是一个体量巨大的市场，同时也是各类芯片巨头厮咬最紧的战场。打响第一枪的是英伟达，这家成立于1993年的年轻芯片公司在人工智能时代尝尽的红利，由于其GPU特别适合用于如今的主流AI算法——深度学习——的训练，这家公司不仅股价从30多美元一路飙升至200多美元，还在全球范围内掀起了这场规模宏大的AI芯片热潮。最先响应是全球各大传统芯片巨头们，英特尔、高通、ARM、联发科等都陆续进场。而这其中，称霸芯片市场十多年的英特尔更是重金出仓，一路“买买买”，布局了众多AI芯片产品线，云AI芯片与端AI芯片都有所涉及。英特尔研究院院长宋继强曾经向ZDX表示，AI芯片的未来一定是多样化，不同种类的产品满足不同功耗、尺寸、价钱的要求——英特尔如今的AI芯片布局就朝着这种多样性发展。人工智能是一场马拉松，现在这场比赛才刚刚开始。此外，国内科技巨头如百度、阿里、腾讯、科大讯飞等也都陆续进军云AI芯片领域，不过暂时以投资动向居多，其中百度在2017年8月发布了XPU，这是一款256核、基于FPGA的云计算AI芯片。四大门派：少林、武当、五岳、明教云AI芯片方面，以英伟达GPU为代表的海外玩家起步较早。而在端AI芯片方面，中国的众多初创公司则跑在了世界前列。美国国家工程院院士、英伟达首席科学家Bill Dally教授曾经向ZDX表示，目前云端AI芯片的市场已经较为成熟，全球各大科技巨头扎根已深，格局很难被撼动。相比而言，种类繁多而且数量巨大的终端AI芯片市场还有待拓展，是众多AI芯片初创企业的机会所在。在动辄融资上亿元融资的催化之下，中国AI芯片创业市场尤为兴盛，不仅从2015年之后陆续涌现出一批AI芯片创业公司，还催生了不少独角兽企业。根据创始团队背景、公司属性、技术流派等特点，国内的这些AI芯片创业公司可以分成“少林、武当、五岳、明教”四大派系。1）少林：学术浓厚，一脉传承之所以把这几家称作“少林派”，是因为这些创业团队普遍成立较早，大多从清华、北大、中科院、电子科技大学等高等院校/研究机构脱胎而来，具备极强的学术属性。创始团队中一般还会有一个“老教授”加持，他们在芯片及相关学术研究上有着多年的学术积累，并且在这些院校与机构中任职多年，能够为公司提供一套成系统的人才资源体系——对于高新科技公司来说，人才意味着技术优势、也意味着强大的市场竞争力。这一派别不仅凭借深厚的学术背景受到资本亲睐，而且能够获得“母校”在市场与人才方面的支持。比如代表玩家之一：中科寒武纪——其创始人陈云霁、陈天石两兄弟都是中科院计算所博士毕业，2016年创业之初，寒武纪不仅在天使轮获得了中科院计算所的1000万元研究经费，还在各种项目资源中获得了中科院的支持。在搭载寒武纪AI芯片技术的华为海思麒麟970芯片发布之后，中科院计算所还特意向华为发来贺信，强调了寒武纪的中科院背景。此外，代表玩家还有清华电子系汪玉副教授带领团队成立的深鉴科技、电子科技大学博士生导师刘洋教授带队成立的深思创芯、清华大学魏少军教授带领的清华大学微电子学研究所、清华精仪系施路平老师组领衔的类脑计算芯片团队、北京大学高能效计算与应用中心主任丛京生带领的基于FPGA的深度学习加速团队等等。这些玩家中，深鉴科技是最早一批独立作为商业企业运营的创企业之一，它成立于2016年3月，最早由FPGA技术起家，目前已成功跻身中国AI芯片创企第一阵营。深鉴科技CEO姚颂向ZDX透露，目前深鉴已经接到了数千万的订单，两款AI芯片都在量产当中，已经有不少合作伙伴在使用当中。深思创芯CEO俞德军博士则告诉ZDX，除了现有的民间场景需要用到AI芯片外，军事上的导弹辅助、舰艇、潜艇等场景也需要AI芯片，深思创芯目前正与国内军用单位合作这些项目。魏少军教授带领的清华大学微电子学研究所则在30多年来一直致力于芯片前沿学术技术的研发，AI芯片属于其中的技术分支；去年，清华大学微电子学研究所的AI芯片Thinker在2017 ACM/IEEE ISLPED国际低功耗电子学与设计会议上获得了设计竞赛奖，这是中国大陆单位首次以第一完成单位获得此项荣誉。2）武当：老牌大厂，跨界转型武当，内家之宗。在AI芯片这个大江湖里，除了各类创业公司之外，不少传统芯片厂商也陆续入局，AI芯片对于他们来说既是其现有产品的自然升级，也是个机遇与挑战并存的时间窗口——做得好了，弯道超车、一举成为行业龙头；做不好了，容易先机尽失、甚至有被市场淘汰的危险。一直以来，这些公司因传统机顶盒芯片、手机芯片、安防摄像头芯片而为人所知。与AI芯片创业公司相比，这些老牌芯片公司普遍具有丰富的设计制造经验、市场渠道完善、并且有成熟的商业运作经验。代表玩家包括华为海思、杭州国芯、中星微电子等等。举个例子，杭州国芯成立于2001年，属于国内较早的一批芯片设计公司，目前在全球机顶盒芯片市场占据份额高达15%。2017年底，杭州国芯也发布了其首颗语音AI芯片GX8010。值得一提的是，由于安防是AI芯片落地应用的核心场景之一，而且市场巨大。但是现在几乎所有安防芯片巨头、安防硬件巨头（比如宇视科技、国科微、中天微等）都在陆续进行着AI芯片相关的研发与合作。目前这些厂商正式对外公布的消息不多，但是都在秘密进展当中。3）五岳：神通尽显，海渡八仙“五岳派”的玩家大多在传统芯片行业中有着多年的技术经验积累，与前两派的玩家相比，他们既有着多年的芯片打造经验、对于安防、家居等行业有着自己深入的理解，同时又具备创业公司快速决策、快速奔跑的市场属性。不过由于芯片前期的研发投入金额较大，“五岳派”的玩家背后普遍有科技巨头的投资身影，比如百度、腾讯、阿里、英特尔；又比如依图、云知声、云天励飞这类已经具备一定资本体量的人工智能创业公司。这一派的代表玩家包括英特尔参与投资的地平线机器人，值得一提的是，地平线机器人创始人余凯是原百度副院长。此外，还有依图科技投资的ThinkForce、阿里巴巴创业者基金与高通等投资的耐能（Kneron）、云知声旗下的云知芯、Roobo投资的启英泰伦、与上海宝信软件股份签订合作协议的海青智盈等等。4）明教：比特加持，另辟蹊径在众多AI芯片公司当中，还有着这样一派另类的玩家：他们用短短几十个月的创业时间就将年营收做到了25亿美元，财富积累的迅猛程度几近恐怖；他们狂热地崇拜技术，极尽可能地压榨出芯片最后一丝计算性能；他们蒙眼狂奔、千金一掷，与此同时却又神秘而低调，对于外界的种种猜疑不置一词。他们就是这波比特币狂潮中的卖水人——虚拟货币“矿机芯片”的生产商们，代表玩家包括比特大陆、嘉楠耘智等。获取虚拟货币需要进行“挖矿”，而“矿机”的本质就是一种专用于挖矿计算机，它同样由芯片驱动供能。芯片性能越强大，挖起矿来就越快、越多、越有优势。在以虚拟货币价格一飞冲天的市场里，这些为挖矿者提供发动机的芯片公司的财富积累自然水涨船高。拿比特大陆来说，比特大陆成立于2013年10月，2017年的总营收已经飙升至25亿美元，拥有超过1000名员工，在全球建立了百亿次计算的数据中心，占矿机专用芯片市场超过70%份额，几乎具有压倒性的市场优势。不过，就在虚拟货币一飞冲天的2017年年底，比特大陆却另辟蹊径，正式推出了第一款AI专用芯片“SOPHON（算丰）”——这一名字正是来源于比特大陆联席CEO詹克团爱读的那套科幻小说，《三体》。比特大陆产品战略总监汤炜伟还曾向ZDX透露，在最近这一两个月内，比特大陆的AI芯片团队规模已经极速扩张到300人。芯片一直是个“烧钱”的东西，这款采用28nm工艺的“算丰”AI芯片仅研发与流片费用就高达几百万美元。传统芯片的迭代速度为1-2年，但比特大陆宣布其产品将会以9个月一代的速度进行快速迭代着。此外，世界第二大比特币矿机生产商嘉楠耘智也在2017年12月预发布了其自研AI芯片KPU，目前，这个矿机巨头已申请挂牌新三板。2017年公司的收入超过12亿元，利润过3亿。与其他从AI起家切入芯片的公司相比，矿机厂有着丰富的芯片打造经验与丰厚的资本积累，不过相对而言，其他专注AI芯片的初创公司则在AI算法优化与软件生态打造上更有优势。毕竟对于AI芯片来说，AI与芯片两方面能力都十分重要。源起之初：云计算，第一批吃到肉的海外巨头所谓人工智能，其实就是让机器具备像人一样的智能。但是一直以来，计算机其实都是很“笨”的，一些对于人类来说易如反掌的任务，对于计算机来说却难于登天：比如认清楚这张照片里的动物是什么？对于人类来说，我们看到了一只在野外坐着的灰猫，而对于计算机而言，它看到的却是图像中的一组数字；我们看到的猫耳与猫眼，在计算机看来只是数字88和23的区别。由此衍生出的一门重要学科叫做计算机视觉（Computer Vision，CV），而分清楚“猫”、“狗”这两类外形相似的动物、并且在图片中圈出这只猫的位置，一直是这门学科的冠上明珠级别的难题，近20年来一直难有进展。直到2012年。2012年的初冬，发生了一件大事情。在2012年计算机视觉届的“奥林匹克”——ImageNet挑战赛的赛场上，出现了一位另类玩家，一位来自多伦多大学的老教授，Geoffrey Hinton。Hinton和他的团队们第一次用上了GPU芯片和深度学习算法，让计算机识图的错误率猛然降低了数倍，成为计算机视觉历史上的一个重要节点。在2015年的ImageNet大赛上，微软亚洲研究院团队更是凭借GPU与深度学习算法，第一次让计算机的识图能力超过了人类。人类识图错误率约为4%，而冠军团队机器识图的错误率为3.57%。一石激起千层浪。GPU芯片与深度学习算法一下成了人工智能届的“网红”，无数科学们都开始将研究重心转移到它们身上。深度学习算法可以理解为实现人工智能的一种电脑程序，它让计算机通过对大量素材的学习（比如成千上万张不同种类的“猫”图片），让机器自己总结出“猫”的特征，下次你再给它一张猫的照片，无论是黑猫、白猫、波斯猫，它都能认出来。在图片分类、识别兴起之后，视频识别、语音识别、翻译、语音助手等一系列AI应用应运而生。其实，GPU的本命更加广为人知——显卡。阴差阳错地，科学家们发现GPU芯片的并行计算架构与深度学习一拍即合，猛然把机器原先需要几个月的“学习”时间压缩到了几天、甚至几个小时之内，两强搭档，在2012年的ImageNet上大放异彩。不过，英特尔、IBM等老牌云服务器芯片厂商同样在积极布局这一市场，各自通过并购、投资、研发等方式不断切入云AI芯片市场。与此同时，谷歌作为创新科技的代表企业，也从2014年起开始打造属于自己的云AI芯片——TPU（张量处理单元），谷歌的AI程序AlphaGo（阿尔法狗）就是靠它提供的强大计算能力战胜了全球围棋第一高手柯洁。大约20天前，谷歌宣布将TPU的强大计算能力通过谷歌云将向用户开放。谷歌AI中国中心总裁&谷歌云AI研发主管李佳曾经向ZDX表示，AI芯片的热潮将会长时间影响AI行业，芯片的进步将会对人工智能行业发展带来一个正向的支持，通过算力的进步与发展，未来将会给人工智能带来更多的机会、更大的想象空间。自此，人工智能迎来了自学科建立60年以来最大规模的市场应用爆发潮，从曾经遥不可及的前沿技术忽然一夜之间就来到了我们身旁，成了家喻户晓的风口话题。如果说2015-2016年是AI芯片巨头们厮杀激烈的争夺战，那么接下来的2016-2017年则是国内AI芯片创业市场逐渐升温加热、最终大红大火、进入白热化竞争的时段。随着市场的进一步升温发酵，到了2017年年底，市场竞争达到了前所未有的激烈程度。仅仅是在2017年10月-11月这两个月间，就有四间国内AI芯片公司同时宣布获得千万美元以上的大额融资，如果从2017年8月开始算起，四个月间至少有十几款AI芯片面市。芯片产品升级周期普遍长达12-24个月，如今这样密集火热的市场轰炸，简直有如一场AI芯片的集体狂欢。狂欢后的思考不过，集体狂欢的背后，总是存在冷静的声音，不少业内人士都曾经向ZDX表示过对AI芯片行业几点担忧：1）芯片竞争非常惨烈，是个“数一数二”的行业。芯片的优势在于规模，一块普通芯片的销量需要达到百万颗级别才能达到盈亏平衡。一旦市场开始成熟，巨头们能够通过十倍、百倍的产量进行市场收割，这些大量涌现的AI芯片创业公司可能最终只能跑出来一两家。2）人工智能技术宣传多，行业落地少。几乎所有AI芯片创业公司都将自己的主要目标定在了安防与自动驾驶这两类市场上，对于安防而言，AI这一市场需求虽然已经存在多年，但是大规模远距离场景下的AI应用还有很多工程化问题需要解决；而对于自动驾驶而言，一则这一技术离大规模落地商用还有一段时间，二则各大车厂把安全属性奉为至高，对人工智能目前的“黑箱”状况较难接受。现在除了手机外，并没有哪一款AI芯片销售量超过100万块的。3）人工智能算法还在快速发展过程中，每半年到一年间计算模型都在发生变化。而芯片的设计研发周期普遍较长，只有非常成熟的算法才适合固化到芯片上，现在的人工智能算法还不够成熟。中国半导体行业协会IC设计分会理事长、清华大学微电子学研究所所长魏少军教授认为，从产业发展规律来看，在今明两年之内AI芯片将持续火热，大家扎堆进入；但是到了2020年前后，则将会出现一批出局者，行业洗牌开始。芯片，国之根本作为所有电子产品的“大脑”，芯片对于科技发展的重要性无需赘言。长久以来，中国大陆地区芯片技术发展落后，严重依赖海外进口：2013年以来，中国大陆用在进口芯片上金额已超高达2000亿美元，芯片已经超过石油，成为国内第一大进口商品。与发达国家与地区相比，我国大陆地区芯片制造工艺差距不小。虽然近年来国内芯片设计产业保持着快速增长（约20%），但总的来说，产业发展依旧存在自主创新能力弱、关键核心技术对外依存度度、人才缺乏等问题。举个例子，现在台积电、英特尔等已经在进行7nm芯片的技术开发当中，而我国大陆地区现阶段28nm工艺才刚刚顺利普及，14nm工艺仍在攻关当中。不过，AI芯片的崛起，为中国长久以来只能埋头追赶的芯片行业打开了一扇新大门。在这类新兴技术的战场上，我们第一次与技术发达国家站在了同一起跑线上，在有些领域甚至站在了全球科技发展的前列。国家对于人工智能及AI芯片的重视程度也达到了前所未有的高度，去年7月与12月，国务院与国家工业和信息化部接连发布《新一代人工智能发展规划》、《促进新一代人工智能产业发展三年行动计划》，对于人工智能行业下一步的发展规划提出了方向性的意见。其中除了包括我国面向2030年的新一代人工智能“三步走”战略，还将神经网络芯片（AI芯片）提到了三大核心技术之一的高度。《行动计划》指出，到2020年，国内AI芯片技术需要取得突破进展，包括云端神经网络芯片和终端神经网络芯片。与此同时，AI芯片需要实现在智能终端、自动驾驶、智能安防、智能家居等重点领域的规模化商用。而在今天公布的总理2018年政府工作报告中还提出，要加强新一代人工智能研发应用，在医疗、养老、教育、文化、体育等多领域推进“互联网+”。结语：重塑世界的AI芯片在一场AI芯片大火烧过了2017年之后，2018年，我们将看到一大批AI芯片初创企业的产品正式落地商用，各大芯片巨头玩家的相关产品也会逐一面市，我们即将进入“无芯片不AI、无终端不AI、无行业不AI”的时代当中。未来，每个芯片都提升它的AI计算能力，小到一个耳机、一台音箱，大到一台工业机器人、一辆自动驾驶汽车，这些终端的AI化将深入到各行各业当中，除了文中重点解读的四大行业，未来，工业、制造、医疗、教育等行业也会逐渐被AI芯片渗透入侵；随着AI计算逐步渗透社会各行各业，我们的世界将逐渐被AI重塑，我们也将进入一个AI社会。随着巨头玩家的不断入局、创业公司的快速奔跑，AI芯片——作为人工智能产业皇冠上的明珠——已经逐渐成为了一场高手间的较量。这一新兴技术既为科技巨头带来了业务升级、产业扩大的新风口；又也为各大创业者提供了颠覆现有格局，重塑科技话语权的崭新机会；同时还为中国半导体产业实现超车提供了一个绝好的新机遇。"}
