{"content2":"问题二：人工智能对教育行业的冲击和机遇分析\n作者：梁蓉\n一问：人工智能对教学方式有何优化作用?\n未来学家、发明家雷·库兹韦尔曾说：“不断减轻人类痛苦是技术持续进步的主要动力。”技术发展的愿景和初衷是好的，人工智能也一样，它的研发初衷是为了把人从简单、机械、繁琐的工作中解放出来，然后从事更具创造性的工作。教育人工智能的使命应该是让教师腾出更多地时间和精力，创新教育内容、改革教学方法，让教育这件事变得更好。\n目前人工智能在教育领域的应用技术主要包括图像识别、语音识别、人机交互等。比如通过图像识别技术，人工智能可以将老师从繁重的批改作业和阅卷工作中解放出来;语音识别和语义分析技术可以辅助教师进行英语口试测评，也可以纠正、改进学生的英语发音;而人机交互技术可以协助教师为学生在线答疑解惑，去年媒体曾报道美国佐治亚理工大学的机器人助教代替人类助教与学生在线沟通交流竟无学生发现，说明了人工智能在这方面的应用潜力。\n除此之外，个性化学习、智能学习反馈、机器人远程支教等人工智能的教育应用也被看好。虽然目前人工智能技术在教育中的应用尚处于起步阶段，但随着人工智能技术的进步，未来其在教育领域的应用程度或将加深，应用空间或许会更大。\n二问：人工智能会取代教师吗?\n自人工智能出现起，就存在一种人工智能威胁论，这种观点认为人工智能最终会取代人类，甚至消灭人类。比如著名物理学家史蒂芬·霍金继2015年9月抛出人工智能威胁论后，今年3月份在接受英国《独立报》采访时再次表达了对人工智能技术的担忧。回归到教育领域，假设未来人工智能不仅在教育的技术层面，而且在知识层面应用得越来越成熟，那么人工智能是否会取代人类教师呢?\n对于这种担心，笔者认为可以从教育的本质以及人与机器的区别等角度进行审视。教育的任务是教书育人，教师的作用不仅是传授知识，而且需要通过情感的投入和思想的引导教会学生做人、塑造学生的品质等。对于什么是真正的教育，德国著名哲学家雅斯贝尔斯曾形象地描绘为，用一棵树撼动另一棵树，一朵云推动另一朵云，一颗心灵唤醒另一颗心灵。教育是一项心灵工程，它的实施者——教师是富于情感和智慧、想象力与创造力的人类，这些特质是人工智能无法比拟的。同时我们也看到教师正在努力从教学的主宰者、知识的灌输者向学生的学习伙伴、引导者等方向转变。\n基于此，即使未来人工智能在知识储备量、知识传播速度以及教学讲授手段等方面超越人类，人类教师仍然具有不可替代的作用。但是面对人工智能的冲击，教师应该具备危机意识和改革意识，思考如何发展那些“AI无而人类有”的能力，思考如何提高教师这个角色的不可替代性，思考什么才是真正的教育，思考未来需要培养怎样的人才等问题。只有朝这些方向努力，才能将人工智能带来的挑战转变为变革传统教育、创新未来教育的机遇。\n三问：人工智能对学科设置有何引导作用?\n在科学技术日新月异的今天，世界正在发生快速变化。新时代对学校教育的影响之一是学科设置的变化，包括新学科的设立、传统学科的改良以及某些“过时”学科的撤销。\n回归到人工智能领域，自2003年北京大学提请建立智能科学系，并于2004年招收首批本科生后，至今十多年的时间里，随着人工智能的崛起，越来越多的高校开设此专业，从事有关智能科学发展的研究并培养相关人才。而人工智能是一个多学科交叉的领域，其发展也带动了其他相关专业地位和报考人数的提升。与此同时，人工智能带动了本专业与相关专业发展的同时，也对某些专业发展造成冲击。以外语专业为例，随着人工智能语音技术的发展，外语翻译行业受到挑战。\n跳出教育看教育，未来人工智能将不断取代或变革现有的工作，也会创造很多新的工作，学校教育必须紧跟时代步伐，不断调整学科专业方向与人才培养目标，才能为社会培养、输送有用的人才。\n四问：教育数据会成为教育人工智能的瓶颈吗?\n在教育行业，人工智能不仅被用来节省教师人力、提高教学效率，而且可以驱动教学方式的变革。以人工智能驱动个性化教育为例，收集学生作业、课堂行为、考试等数据，对不同学生的学情进行个性化诊断，并进一步为每个学生制定有针对性的辅导和练习，从而实现因材施教，这已成为教育人工智能探索个性化教育的一个方向。但是实现人工智能引领个性化教学的一个关键点是数据的采集与分析。\n关于数据与人工智能的关系，有一种说法认为数据是人工智能的某种“养料”。同样的，我们也可以说，教育数据是教育人工智能的“养料”。教育数据产生于各种教育活动和整个教学的全过程，人工智能要想更好地应用到教育中，首先面临的就是数据采集的问题。目前，教育数据的来源渠道有两个，一是来源于数字化的教学环境，教学和学习数据在这种数字化环境中自然而然的产生，二是从传统教学行为中收集教育信息，并将之转化为数据。前者的优势是实时收集数据，效率高、节省人力，而现如今在互联网+教育的广度和深度有待进一步推进的情况下，教育数据的来源很大一部分要依靠后者，未来教育数据或将成为发展教育人工智能的一大制衡因素。"}
