{"content2":"CCF ADL27：《视觉模式识别讲习班》开始报名-中国计算机学会信息网CCF ADL27：《视觉模式识别讲习班》开始报名 欢迎参加CCF 《学科前沿讲习班》 CCF ADL 第27期 主题 视觉模式识别 2012年5月18-20日北京   视觉模式识别是计算机学科近年来的研究热点，也是各种智能应用的关键技术，如视频监控、图像搜索、移动增强现实等。这是一个跨学科的领域，牵涉到机器学习、统计计算、优化算法、图像处理、模式识别等。视觉模式识别正处在一个基础研究和应用研究爆发的时期。随着智能设备和物联网的不断发展，视觉模式识别具有更广阔的研究和应用前景。   本期CCF学科前沿讲习班《视觉模式识别》，邀请到该领域知名的专家学者做主题报告，希望能对从事该领域的学生、老师和工业界研究人员有所帮助。本讲习班将对视觉模式识别的热点理论和方法、重点应用研究进行介绍，使参加者在了解学科热点、提高学术水平的同时，增加交流机会和实践体验。“工欲善其事，必先利其器”，我们相信这次讲习班将有助于大家未来的研究工作。   学术主任：谭铁牛　中科院自动化所研究员 　　　　　张益民　英特尔中国研究院研究员 　　　　　王　亮　中科院自动化所研究员 协办单位：模式识别国家重点实验室 英特尔中国研究院   详情请点击：《CCF视觉模式识别讲习班简介》   特邀讲者 l  Prof Yi Ma 2000年美国加州伯克利大学获得博士学位。目前是微软亚洲研究院主任研究员，美国UIUC大学副教授。1999年马尔奖（Marr Prize，计算机视觉领域最高奖项之一）得主。主要研究方向是计算机视觉和高维数据分析。 报告题目：Robust Principal Component Analysis: Exact Recovery of Corrupted Low-Rank Matrices via Convex Optimization l  周志华 教授 南京大学教授，教育部长江学者特聘教授、国家杰出青年基金获得者，主要研究领域为机器学习、数据挖掘、模式识别。《科学通报》副主编、《IEEE Trans Knowledge and Data Engineering》、《ACM Trans Intelligent Systems and Technology》、《中国科学》等十余种国内外学术期刊编委，二十余次国际会议程序主席或领域主席，CCF人工智能与模式识别专委会主任，中国人工智能学会机器学习专委会主任，IEEE计算智能学会数据挖掘技术委员会副主席。 报告题目：未标记与多标记样本的学习 l  Associate Prof. Jianbo Shi  University of Pennsylvania 1994年于康奈尔大学获得计算机科学与数学学士学位，1998年于加州伯克利大学获得计算机科学博士学位。1999年加入CMU的机器人研究所，领导HumanID项目研究。2003年至今，他在宾夕法尼亚大学工作，目前是计算机与信息科学系副教授。他的主要的研究兴趣包括人的行为分析、图像识别与分割、图像/视频检索等。 报告题目： Image Segmentation and Contour Grouping for Deformable Shape Detection l  王立威 博士 北京大学机器智能系副教授，主要研究领域为机器学习理论。已在JMLR, PAMI, NIPS, COLT, ICML, and CVPR等顶级的期刊和会议上发表30余篇论文。他于2010年被IEEE Intelligent System提名为AI’s 10 to Watch. 报告题目:  Probabilistic Graphical Models: Representation, Inference and Learning， 　　l Prof. Long Quan 香港科技大学教授，1989年在法国INPL获博士学位，在加入香港科技大学任教之前，他自1990年在法国INRIA(位于Grenoble)一直担任CNRS高级研究科学家。主要研究领域为三维重构，structure from motion, 基于图像的建模。 报告题目：Image-based Modeling l  陈熙霖  中国科学院计算技术研究所研究员 国家杰出青年基金获得者，中科院“百人计划”入选者并获终期评估优秀，新世纪百千万人才工程国家级人选。研究兴趣包括计算机视觉、模式识别、图像处理以及多媒体和数字视频广播等。目前是IEEE Transactions on Image Processing的Associate Editor，《JCST》领域编委，Frontiers of Computer Science in China和《计 算机学报》编委，先后担任过FG 2013 General Chair, ICMI 2010的Program Chair、FG2011的Tutorial Chair、ICMI 2009的Workshop Chair、ACM MM 2009和ICME 2007的Local Chair 以及ICMI 2006的Demo Chair。其研究工作先获得过三次国家科技进步奖，作为（共同）作者在刊物和会议上发表论文200多篇。 报告题目：人脸识别——问题、进展与挑战 l  Xiaogang Wang  香港科技大学助理教授 于中国科学技术大学少年班获得电子工程与信息科学学士学位，香港中文大学获得信息工程硕士学位，美国麻省理工学院获得计算机科学博士学位。自从2009年8月，他是香港中文大学电子工程系的助理教授。他是ICCV 2001的Area Chair，并且在2011年荣获自动人的行为分析研究优秀青年科学家奖。他的研究兴趣包括计算机视觉、机器学习和医学视觉计算。 报告题目：Human Behavior Analysis in Crowded Environment l  薛向阳  复旦大学计算机学院教授 现为IEEE/ACM会员，CCF理事，上海市计算机学会副理事长，中国图形图像学会多媒体专委会副主任。现担任《计算机研究与发展》、《计算机科学与探索》和《IEEE Transaction on Autonomous Mental Development》编委。主要研究图像视频分析与检索。 报告题目：图像标注   　 特邀讲者 l  谭铁牛 研究员 博士生导师。1984年获西安交通大学学士学位，1986年和1989年分别获英国帝国理工学院硕士与博士学位。1989-1997年在英国雷丁大学计算机科学系工作，1998年回国到中科院自动化所工作，历任研究所所长助理、所长。现为该所模式识别国家重点实验室主任。 谭铁牛博士主要从事图像处理、计算机视觉和模式识别等相关领域的研究工作。现已出版编（专）著11部、发表论文350多篇、获准和申请发明专利50项。他现为 IEEE 生物识别理事会候任主席、国际模式识别学会副主席、中国人工智能学会副理事长。现为或曾为国际权威期刊IEEE T-PAMI、IEEE T-CSVT、PR等多个国际刊物的编委。他是IEEE Fellow、IAPR Fellow、国际生物识别学术会议(ICB)和亚洲模式识别学术会议(ACPR)创始主席等。曾获中国青年五四奖章、中国青年科技奖以及国家自然科学二等奖、国家技术发明二等奖和国家科技进步二等奖各1项。 l  张益民 博士 张益民是英特尔中国研究院嵌入式应用实验室高级主任研究员及实验室主任。他的研究团队负责对各种新兴嵌入式应用进行研究，最近几年的研究重点主要在计算机视觉，多媒体分析及其在智能嵌入式设备的应用和硬件加速方面，如人脸识别、物体识别、视频挖掘等。他是中国计算机学会高级会员，现任理事。他于1999年从上海交通大学获计算机学科的博士学位。 l  王亮 研究员 博士生导师，IEEE高级会员。2010年入选中国科学院“百人计划”，现为中科院自动化所模式识别国家重点实验室研究员。主要从事图像处理、机器学习、计算机视觉和模式识别等相关领域的研究工作。已出版编（专）著5部，发表学术论文80多篇，并被广泛引用（GoogleCitation 3600余次）。他现为《IEEE Transactions on System, Man and Cybernetics – Part B》、《Neurocomputing》等国际学术刊物的编委，曾获得中科院院长奖学金特别奖、中科院优秀博士论文及全国百篇优秀博士论文提名奖等荣誉。  日程安排 2012年5月18日     9:00-9:30　　开班仪式、合影 09:30-12:30　Robust Principal Component Analysis: Exact Recovery of Corrupted Low-Rank 　　　　　　Matrices via Convex Optimization 　　　　　　Yi Ma, 美国UIUC大学副教授 12:30-14:00    午餐 14:00-17:00    未标记与多标记样本的学习 　　　　　　周志华，南京大学教授   2012年5月19日    09:00-12:00   Image Segmentation and Contour Grouping for Deformable Shape Detection              　　Jianbo Shi, 美国宾夕法尼亚大学副教授 12:00-14:00    午餐 14:00-17:00    Probabilistic Graphical Models: Representation, Inference and Learning                          王立威，北京大学副教授   2012年5月20日    09:00-10:30    人脸识别——问题、进展与挑战              　　陈煕霖, 中科院计算技术研究所研究员 10:30-12:00    Image-based Modeling              　　Long Quan, 香港科技大学教授 12:00-14:00    午餐 14:00-15:30    Human Behavior Analysis in Crowded Environment               　Xiaogang Wang, 香港中文大学助理教授 15:30-17:00    图像标注               　薛向阳，复旦大学教授 17:00-17:20    结业式   注册费： 1、开班三个月前注册并缴费： 非会员：1300元。 CCF会员：900元（开班日三个月前入会的CCF会员享受此优惠）。 　　CCF团体会员单位的人士参加，按CCF会员标准收费（按单位办理）。 2、4月30日之后注册并缴费：会员1300元，非会员1300元。 　　3、开班前入会者，注册费1100元。 4、现场缴费：1500元。 注：注册费含资料和3天的午餐。   优惠办法： 1、同一单位一次有5人报名者，第六个人免注册费（无论会员与否，仅对提前注册者有效，当天不予受理）。 2、2011年参加过2次讲习班的CCF会员可优惠100元。 3、2012年参加3次讲习班的CCF会员，第4次参加时免交注册费。 4、往届学员推荐一名新学员时，推荐者当期注册费优惠100元。 5、同时满足以上多项优惠条款时，只能选择一项。 食宿自理   缴费方式： 邮寄：北京2704信箱，邮编：100190 收款人：中国计算机学会， 银行转账：开户行：北京银行北京大学支行；户名：中国计算机学会 01090519 5001 201 097 020 28 请务必注明：姓名，ADL27 报名方式： 即日起至2012年4月30日，报名者请填写附表并发送至：ccf-adl@ccf.org.cn，按报名先后录取。学会秘书处将与邮寄联系确认。 联系人：余遐 E-Mail: ccf-adl@ccf.org.cn 电话：010-6256 2503-22 /139 1065 9011 地址：北京科学院南路6号计算所大楼336室 CCF ADL27报名表 视觉模式识别     姓名 　 性别 　 任职单位 　 职称 　 是否CCF会员1 　 会员号 　 手机 　 Email 住宿2 （如需安排） 入住时间： 离开时间： 单住： 合住： 发票抬头3 发票项目内容4 √ □注册费□会议费□会务费□培训费 参加本期讲习班的目的： 信息来源：√ （请注明） □CCF周刊 □CCF网页 □《CCCF》 □熟人介绍 □单位通告 □其它　　　　 我申请参加本届研究峰会并承诺按主办单位的规定参加。                 说明 　　1、会员号：不填写会员号，按非会员处理，对会员优惠，仅对开班前三个月前入会者有效。 　　2、仅需要组织者代位安排住宿是，填写“安排住宿”一栏。 　　3、发票：“发票付款单位”如空，则认为同“任职单位”。 　　4、发票项目如不选择，则认为是“会议费”。 　　5、 对会员优惠400元，仅对开班前三个月前入会者有效。如果正在申请入会，请填写“正在办理”，享受200元优惠。"}
