{"content2":"华为云总裁郑叶来：易获取、用得起、方便用的算力是人工智能发展的关键\nhttps://mp.weixin.qq.com/s/EGbjW7_rA08rO7wspKyXXw\n这是一个变革的时代，我们见证了人工智能改变了下围棋的方式，也通过语音助手、人脸识别等技术感受到AI的无处不在。未来已来，AI产业发展逐渐成为人们重视的话题。\n9月17日，一场大咖云集、干货满满的世界人工智能大会在上海拉开帷幕。华为公司副总裁、云BU总裁郑叶来在大会上分享了对于人工智能发展的思考。\n以下为郑叶来先生的演讲实录\n人工智能将会改变每个行业、每个职业、每个组织、每个家庭和每个人\n人工智能是一系列新的通用目的技术（GPT），包括自然语言处理、图片识别等。我们讲信息技术带来了效率的提升，人工智能则带来生产成本的变化。\n过去几年中，华为在许多行业做了很多探索，取得了良好的社会经济效益。例如在交通领域，我们在深圳市建设了城市交通智能体，我们让深圳这个本来“应该最堵”的城市，通行效率做到稳步提升。在物流行业，我们和客户一起在路径规划、识别暴力分拣、防拆解等方面都做了有力的探索。\n人工智能将会改变每个行业、每个职业、每个组织、每个家庭和每个人。我们一直都说是行业+AI，而不是AI+行业。今天组织的人才结构是这样的：上方是商业领袖，下方是高级管理者/专家，然后是基层管理者/业务骨干和基层员工。未来使用人工智能以后，会改变我们整个组织的人才结构，从上方的商业领袖、管理者到基层员工，中间一定有AI工程师。中间这些重复性的劳动一定会被人工智能所替代。\n未来2-3年的改变会如此之快，Gartner预测在2020年之前众多行业、职业将巨变。\n人工智能是信息化进程的新高度\n所有通用目的技术的应用一定会有一个过程。通常华为看待一个产业会分为4个阶段：第一个是技术与应用局部探索的阶段，第二个阶段是技术发展与社会环境相互碰撞。我们认为今天的人工智能是在第二个阶段的开始。人工智能的发展带来了兴奋和冲动，也有一丝焦虑和困惑，但是人工智能终将改变这些行业。\n我们的观点是什么呢？首先，人工智能不是万能的。任何技术有可解决的问题也有解决不了的问题。我们应该聚焦人工智能能够解决的问题、创造价值的领域，而不应该把精力花在人工智能不能解决的问题，或者说不能创造价值的领域。预计机器将在越来越多的任务中继续达到并超越人类的表现。\n我们还有一个重要的观点就是——选择正确的问题比寻找新奇的解决方案更加重要。对一些有模式可循的、有数据支撑的，机器学习就比人更有效。上午嘉宾讲了一个核心的问题就是数据支撑，这里面就涉及很多的问题，包括数据主权是谁的，以及最终客户的隐私怎样来保护等，这些问题亟待解决。\n人工智能是信息化进程的新高度，是会降低生产成本的。人工智能是一种科学和一组计算技术，它启发于人但不同于人，能够进行感知、学习，推理和采取行动。所以人工智能和此前信息化最大的变化是，信息化能提升人的效率、降低人力的成本，但很难（自动）降低生产成本。人工智能不但可以替代人，还能够（自动）降低生产成本。我们和中国一家很著名的污水处理公司合作，通过监控整个污水池氧化的浓度，提升了整个的效率。\n那么，人工智能人才应该怎样获取？以AI思维解决人才的短缺。企业的AI人才能力结构，将不仅仅是数据科学家，而是由数据科学家、领域专家、公众数据科学家相互配合组成。除了从外部获取数据科学人才，我们认为还应该加强企业内部培训，打造内生的公众数据科学家，甚至数据科学家能力，这样更快速、更重要、更长久。以AI的方式解决AI人才问题，就是着力于整个智能化、自动化、简单易用的人工智能工具和平台服务，让所有的企业以更快捷和高效的方式使用人工智能技术，来解决问题、创造价值，也就是怎么让人工智能成为一种普惠的技术，高而不贵的技术。\n易获取、用得起、方便用的算力是AI产业发展的关键\n人工智能有三个方面，数据、算法、算力。面向人工智能这个大的潮流，华为应该踏踏实实做什么？我们认为，易获取、用得起、方便用的算力，是AI产业发展的关键。\n第一个是价格贵。我们现在看人工智能整个训练的过程还是很贵的，训练人脸识别、交通综合治理、自动驾驶，模型的训练成本非常高昂的。\n第二个是使用难。缺乏一个统一的开发框架，无法适配从训练到推理，从公有云到私有云、边缘、终端的多种应用场景，开发、调优、部署的工作量巨大。\n第三个是难获取。GPU供货周期长，限量供应。\n我们希望华为在这些方面可以努力。今年10月10日到12日，华为将在上海举办面向全球的年度全联接大会，发布华为人工智能发展战略和全栈、全场景解决方案。大会第三天，我们将分享华为人工智能在这个环境下如何构建一个生态，同时支持高校的研究，支持企业方便地获取人工智能，打造一个真正面向AI开发者和企业应用的AI开发平台和工具，实现普惠AI，让大家用得起、用得好、用得放心。"}
