{"content2":"人工智能与机器学习技术在医疗保健行业中的应用\nlqfarmer 深度学习与NLP 3月25日\n人工智能( AI )、机器学习和深度学习正在席卷医疗保健行业，本文全面总结了以深度学习为主导的AI技术正给医疗保健行业带来巨大的变化，并给出了AI技术在检测阿尔茨海默病、癌症检测、机器人辅助医疗、脑出血检测、结核病检测等大量具体实例。他们不再是天上的馅饼技术；它们是实用工具，可帮助公司优化其提供的服务、提高护理标准、创造更多收入并降低风险。医疗保健领域的几乎所有主要公司都已开始在实践中使用该技术；在此，我将介绍实践过程中的一些重要亮点，以及它们对其他医疗保健公司的意义。\n对工业的一般收益\n我发现描述人工智能重要性的最好的比喻是贝尔塔伦·梅斯克在他的一篇文章中提出的。看起来问题不是“是否”而是“什么时候”人工智能将彻底改变医疗保健行业。\n医学界花了一段时间才接受听诊器。承认人工智能是一个成熟的医疗工具还需要一段时间，尽管它有着巨大的变革医疗保健的潜力。然而，它是如此强大，当它最终在医疗保健中占据应有的位置时，取代听诊器将标志这一切的开始。\n贝尔塔伦·梅斯克, MD, PhD\n人工智能、机器学习和深度学习已经增加了医疗行业的利润。例如，根据研究公司Frost & Sullivan的数据显示，到2021年，人工智能系统将为全球医疗保健行业带来约67亿美元的收入。2014年，他们只创造了6.34亿美元—这一指标将以每年40%的比例增长。\n对这些技术的投资正蓬勃发展。2014年，跨行业IT平均收入支出为3.3 %，但医疗保健提供商的平均支出为4.2 %。大约35 %的医疗保健组织将在未来两年内实施人工智能解决方案，其中一半以上的组织计划在未来五年内效仿。我已经分析了这一趋势，并认识到增长的驱动因素是医疗保健领域的任何业务运营的各种特定需求，包括创建足够安全且遵守隐私保护法的电子医疗保健记录的需求。2012年至2017年期间，电子医疗记录的普及率从40%增至67%；。我发现这一统计数据对于医疗保健领域机器学习的未来至关重要，因为数据的可用性对其发展至关重要。\n与此同时，医疗AI交易量也大量增加，从2012年的20笔交易增加到2016年中期的近70笔。对人工智能驱动的医疗技术的风险资本的投资也在激增，至少在精通技术的有钱人眼中，等于公开承认该领域有投资的潜力。2012年，人工智能驱动的医疗保健项目，如机器人、机器学习( ML )和计算机视觉，总计3，000万美元；2016年，这一投资领域超过8.92亿美元。\n根据埃森哲( Accenture )的一份报告显示，目前医疗保健业务的最大近期价值存在于以下三大应用程序中:\n机器人辅助手术( 400亿美元)\n虚拟护理助理( 200亿美元)\n行政工作流程助理( 180亿美元)\n然而，我研究过的其他领域，如医学成像也是非常有希望的—特别是因为它们满足了如此巨大的需求。例如，目前世界上一半以上的人口无法有效获得医学成像的途径，因为那些没有人工智能辅助的技术昂贵、笨重，需要不切实际的培训。埃森哲估计，到2026年，人工智能将能够满足至少20%未满足的临床医生需求。\n收获:更多的资金投入到医疗保健行业中，由人工智能驱动的实际应用中，因为这些应用正在创造收入。这只是一个开始。\n具体的应用场景\n为了更好地了解人工智能和机器学习正如何改变医疗保健行业，给出一些具体案例很有用，具体的实例可以有力证明这些前沿技术的实用价值。\n判断发展中国家的结核病情况\n识别图像中的模式（Pattern）是现有人工智能系统中最强有力的一点，研究人员现在正在训练人工智能检查胸部x光片，识别结核病。这项技术可以为缺乏放射学家的结核病流行地区带来有效的筛查和评估手段。\n一种治疗退伍军人创伤后应激障碍( PTSD )的人工智能\n退伍军人创伤后成长计划与IBM Watson合作使用人工智能和分析技术，以确保更多患有创伤后应激障碍的退伍军人能够完成心理治疗。使用这些技术，他们的完成率从不到10 %上升到73 %。根据退伍军人事务部的统计，80 %的患有创伤后应激障碍的退伍军人在确诊后一年内完成治疗计划，然后康复。在300万阿富汗和伊拉克战争老兵中，大约五分之一患有创伤后应激障碍。\n检测脑出血\n以色列医疗技术公司MedyMatch和IBM Watson Health正在使用人工智能，通过检测颅内出血，帮助医院急诊室的医生更有效地治疗中风和头部外伤患者。AI系统使用临床洞察力（clinical insight）、深度学习、患者数据和机器视觉来自动标记潜在的脑出血，以供医生检查。\n优化管理工作流程并消除等待时间\n行政和助理工作是AI起作用的主要领域。埃森哲表示，语音到文本转录等省时的工作流功能有可能替代为医疗专业人员订购测试和处方以及在图表中写笔记等任务—任何涉及非患者护理的任务。这相当于节省了17%的医生工作时间和51%的注册护士工作时间。\n人工智能还可以优先处理医生的电子邮件，并帮助患者解决简单的医疗问题，而无需医生的帮助，优化双方的时间表。例如，启动Scanadu的doc.ai自然语言处理程序允许患者通过应用程序向他们解释实验室结果，从而节省了患者和医生的时间和金钱。Nuance Communication推出了一款类似类似虚拟助手的产品，可以解释测试结果并处理患者的基本问题。首先实施这些技术的医疗保健组织将会从中获利，因为他们将有最多的时间来构建知识库。\n检测阿尔茨海默病\n现在，人工智能机器人只需要不到一分钟的时间，就可以根据语音模式和声音来诊断阿尔茨海默氏病，准确率达到82 %，而且这种准确率还在不断提高。人工智能系统可以处理单词之间的停顿长度、处理代词优于专有名词的任何偏好、处理过于简单的描述以及语音频率和幅度的变化。所有这些因素对于人类听众来说都很难高精度地记录和检测，但人工智能系统却能够进行客观和可量化的分析。\n癌症诊断\n用于检测和诊断癌症的传统方法包括计算机断层扫描( CT )、磁共振成像( MRI )、超声和X射线。不幸的是，许多癌症无法通过这些技术得到足够准确的诊断，从而可靠地挽救生命。微阵列基因图谱的分析是一种替代方法，但这项技术需要计算很多小时，除非这项技术可以使用AI替换。现在已经被证明，斯坦福大学的人工智能诊断算法与由21名经委员会认证的皮肤科医生的团队一样有效地从图像中检测潜在的皮肤癌。Startup Enlitic正在使用深度学习来检测CT图像中的肺癌结节，其算法比作为一个团队工作的专家胸科医生的准确率高50%。\n在人工智能的帮助下，其他医疗保健公司正在经历诊断、治疗甚至治愈的过程。Insilico Medicine正在用深度学习算法寻找新药和治疗方法，包括新的免疫疗法。这些基因疗法使用每个病人的细胞来模拟他们自己的生物学和免疫系统。\n人工智能之所以能使这些疗法奏效，是因为它能设计出组合疗法，并以闪电般的速度，以模拟的形式进行数百万次实验来识别令人难以置信的复杂的生物标记物。\n机器人辅助手术\n在价值潜力方面，机器人辅助手术是人工智能辅助方向的佼佼者。AI-enabled机器人技术可以通过集成实时操作矩阵、来自实际手术医生的数据以及来自手术前病历的信息来提高和指导手术器械的精度。事实上，埃森哲报告说，人工智能机器人技术带来的进步缩短了21 %的停留时间。\n研究各种解决方案，我发现Mazor机器人最有希望。它使用AI来最大限度地减少侵入性（invasiveness），并最大限度地制定解决具有复杂解剖结构的区域(如脊柱)的外科手术。AI系统帮助外科医生在病人出现之前，通过CT扫描将植入物（implant）放在指定的位置，Mazor的脊柱外科机器人臂引导外科器械的运动，确保高度的精度。\n更糟糕的是，它变得更聪明了！\n我们不应该对机器学习和人工智能将如何改变我们所知道的医疗保健行业感到太兴奋。如果我们想看到这些变化发生，人们还有很多工作要做。事实上，在这种情况下，人的因素对这一成功至关重要。此外，提出这一议题可能对参与这一进程的各方机构造成不必要的压力。Kevin Pho大概总结行业情况，Kevin认为，我们需要将重点转移到将我们的优先事项（priority）和工作流程转换到模型上，以便技术能够以我们需要的方式改进医疗保健。\n科技是伟大的。但是人和过程改善了护理。最好的预测只是建议，直到付诸于实际行动。在医疗保健领域，这是最困难的部分。成功需要与人交谈，并花时间学习环境和工作流程—无论供应商或投资者多么不愿意相信这一点。如果能够通过安装软件来实现医疗保健行业的转型，这将是一件非常棒的事情。\nKevin Pho，医学博士"}
